{
    "username": "1hehaq",
    "name": "haq",
    "bio": "الله مغنا",
    "location": "saturn",
    "avatar_url": "https://avatars.githubusercontent.com/u/162917546?u=9f1d0f96abb6c9c3219394bafa03856c8297ff9d&v=4",
    "profile_url": "https://github.com/1hehaq",
    "top_languages": [],
    "top_projects": [],
    "followers": 67,
    "following": 10,
    "public_repos": 26,
    "pull_requests_merged": 2,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 573,
        "repositories_contributed_to": 9
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://x.com/1hehaq"
        }
    ],
    "activity_summary": {
        "poisonthecache": {
            "link": "https://github.com/1hehaq/poisonthecache",
            "summary": "Recently updated with multiple commits to the nuclei.yml and kxss.yml files, also committing various minor updates"
        },
        "HacktivityOne": {
            "link": "https://github.com/1hehaq/HacktivityOne",
            "summary": "Committed updates and improvements including fetch and hacktivity push events, overhauling the project."
        },
        "run": {
            "link": "https://github.com/1hehaq/run",
            "summary": "Made updates to the rdp.yml file with multiple minor improvement commits"
        },
        "1hehaq": {
            "link": "https://github.com/1hehaq/1hehaq",
            "summary": "Made a recent update to the repository's README.md file."
        },
        ".github": {
            "link": "https://github.com/tryhaqme/.github",
            "summary": "Made an update to the README.md file in the repository."
        }
    },
    "profile_summary": "Haq is a highly skilled and innovative developer with a strong foundation in software development, demonstrated by his impressive portfolio of 26 public repositories. With a professional network of 67 followers, Haq has established himself as a reliable and influential figure in the development community. His technical expertise is complemented by his dedication to delivering high-quality solutions, showcasing his commitment to excellence in every project he undertakes.\n\nAs a seasoned developer, Haq brings a unique combination of technical skills and industry expertise to the table, enabling him to tackle complex projects with ease and efficiency. His passion for software development is evident in his work, which reflects his ability to stay up-to-date with the latest trends and advancements in the field. With his impressive track record and technical prowess, Haq is an invaluable asset to any team, delivering cutting-edge solutions that meet and exceed client expectations."
}