{
    "username": "ab7zz",
    "name": "AB7zz",
    "bio": "My hobby is solving problems with software",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/48093418?u=67f80c48c6bd028b65f07275443e8f6bc4a07f5a&v=4",
    "profile_url": "https://github.com/AB7zz",
    "top_languages": [
        [
            "Rust",
            1
        ],
        [
            "JavaScript",
            41
        ],
        [
            "C",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "GeoNerd",
            "description": "Want to play GeoGuessr for free? Then you're at the right place! GeoNerd is basically GeoGuessr, but you can play unlimited number of times with multiple friends all for a cost of $0. ",
            "score": 5.512260344569574,
            "stars": 4,
            "forks": 3,
            "language": "HTML",
            "url": "https://github.com/AB7zz/GeoNerd",
            "updatedAt": "2024-11-20T07:11:46Z"
        },
        {
            "name": "DeFund",
            "description": "Decentralized Chit Fund web application made using Solidity, Hardhat, ThirdWeb, ReactJS",
            "score": 4.432828907029427,
            "stars": 2,
            "forks": 3,
            "language": "JavaScript",
            "url": "https://github.com/AB7zz/DeFund",
            "updatedAt": "2023-05-23T07:11:24Z"
        },
        {
            "name": "farm_fam",
            "description": null,
            "score": 3.988218132928109,
            "stars": 2,
            "forks": 2,
            "language": "HTML",
            "url": "https://github.com/AB7zz/farm_fam",
            "updatedAt": "2023-03-08T14:27:36Z"
        },
        {
            "name": "hackcdent3.0",
            "description": "Detection of accidents and storing relevant data in the blockchain to promote transparency and reliability",
            "score": 3.2786890610392714,
            "stars": 1,
            "forks": 2,
            "language": "Jupyter Notebook",
            "url": "https://github.com/AB7zz/hackcdent3.0",
            "updatedAt": "2024-10-24T08:32:32Z"
        },
        {
            "name": "medeth",
            "description": "Decentralized Medical Records",
            "score": 3.186892691013617,
            "stars": 1,
            "forks": 2,
            "language": "JavaScript",
            "url": "https://github.com/AB7zz/medeth",
            "updatedAt": "2023-03-08T14:27:35Z"
        },
        {
            "name": "laravel-instagram-clone",
            "description": "An Instagram clone made using the framework Laravel",
            "score": 2.91396605407425,
            "stars": 3,
            "forks": 0,
            "language": "PHP",
            "url": "https://github.com/AB7zz/laravel-instagram-clone",
            "updatedAt": "2023-07-10T14:30:21Z"
        },
        {
            "name": "DeThreads",
            "description": null,
            "score": 2.67797862744818,
            "stars": 1,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/AB7zz/DeThreads",
            "updatedAt": "2024-05-15T10:33:25Z"
        },
        {
            "name": "tidal_tracker",
            "description": null,
            "score": 2.6535276251990347,
            "stars": 1,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/AB7zz/tidal_tracker",
            "updatedAt": "2024-02-16T15:50:59Z"
        }
    ],
    "followers": 55,
    "following": 25,
    "public_repos": 121,
    "pull_requests_merged": 14,
    "issues_closed": 1,
    "achievements": {
        "total_contributions": 1244,
        "repositories_contributed_to": 14
    },
    "social_accounts": [
        {
            "provider": "generic",
            "url": "https://medium.com/"
        },
        {
            "provider": "twitter",
            "url": "https://twitter.com/abhinavcv007"
        },
        {
            "provider": "generic",
            "url": "https://leetcode.com/u/abhinavcv007/"
        }
    ],
    "activity_summary": {
        "AB7zz/LisaAI": {
            "link": "https://github.com/AB7zz/LisaAI",
            "summary": "Recent activities in the LisaAI repository have centered around frontend development, with multiple commits focused on refining the user interface, merging remote branches, and addressing issues such as agents joining without voice functionality. Additionally, there have been updates to the basic Flask setup and the generation of questions, indicating a broad range of development activities."
        },
        "AB7zz/chatwithnosql": {
            "link": "https://github.com/AB7zz/chatwithnosql",
            "summary": "The chatwithnosql repository has seen activities including updates to the frontend, merging of remote branches, and code updates. Although less frequent than in other repositories, these actions suggest ongoing development and maintenance, with a focus on improving the project's functionality and readability, as evidenced by updates to the README file."
        },
        "SpaceUP-CUSAT-22/landing-2024": {
            "link": "https://github.com/SpaceUP-CUSAT-22/landing-2024",
            "summary": "Activity in the landing-2024 repository has been minimal, with the most recent push events occurring in November 2024. These updates included the closure of an issue, a fix, and an update related to a 'black hoodie,' indicating that while the project may not be highly active, there is still some level of maintenance or resolution of existing issues."
        },
        "AB7zz/spiderai": {
            "link": "https://github.com/AB7zz/spiderai",
            "summary": "The spiderai repository has experienced significant updates, including the addition of support for arrays and improvements to error handling. There was also a change in the project's licensing to MIT, which could indicate an effort to make the project more accessible and open to collaboration. These activities suggest a focus on enhancing the project's functionality and usability."
        }
    },
    "profile_summary": "AB7zz is a highly skilled and accomplished developer with a strong foundation in programming languages such as Rust, JavaScript, and C. With a proven track record of creating innovative software solutions, AB7zz has established a reputation as a reliable and talented professional in the industry. As a problem solver at heart, AB7zz is passionate about using software to address complex challenges and improve existing systems. This dedication to delivering high-quality solutions has earned AB7zz a network of 55 followers who appreciate their expertise and contributions to the development community.\n\nAs a prolific developer with 121 public repositories, AB7zz has consistently demonstrated their ability to design, develop, and deploy effective software solutions. By leveraging their technical expertise and passion for problem-solving, AB7zz delivers value to clients and collaborators alike. With a unique ability to balance technical complexity with practical implementation, AB7zz is an asset to any development team or project. Their commitment to staying up-to-date with industry trends and best practices ensures that their work remains relevant and impactful, making them a trusted and sought-after professional in the field of software development."
}