{
    "username": "abm32",
    "name": "Abhimanyu R B",
    "bio": "Passionate developer experienced in building robust applications using various technologies. Always eager to learn and explore new technologies.",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/110992125?u=64e13362264e65dd158940f4fb8ead7aa2da3968&v=4",
    "profile_url": "https://github.com/Abm32",
    "top_languages": [
        [
            "Python",
            10
        ],
        [
            "JavaScript",
            14
        ],
        [
            "Kotlin",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "global-fire-safety-system",
            "description": "This project leverages cutting-edge technology and machine learning to analyze satellite imagery, providing early detection of potential wildfires. It aims to democratize access to this critical information, engaging local communities in reporting, monitoring, and proactive measures.",
            "score": 4.09121308414666,
            "stars": 2,
            "forks": 2,
            "language": "Python",
            "url": "https://github.com/Abm32/global-fire-safety-system",
            "updatedAt": "2024-10-05T18:15:21Z"
        },
        {
            "name": "Glitch-Service-Hub",
            "description": "Glitch Service Hub bridges the gap between skilled job seekers (e.g., plumbers, electricians, mechanics) and those in need of their services. Our tech-powered platform connects service providers with customers, addressing global issues of poverty and unemployment.",
            "score": 3.389067139106278,
            "stars": 2,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/Abm32/Glitch-Service-Hub",
            "updatedAt": "2023-09-01T07:53:06Z"
        },
        {
            "name": "Personal_diary_app_electronjs",
            "description": "Personal diary app made using electronjs. Store the note written into our system",
            "score": 2.4317732313650113,
            "stars": 2,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/Abm32/Personal_diary_app_electronjs",
            "updatedAt": "2024-01-10T14:23:17Z"
        },
        {
            "name": "mysite",
            "description": null,
            "score": 1.9034856708161925,
            "stars": 0,
            "forks": 2,
            "language": "Python",
            "url": "https://github.com/Abm32/mysite",
            "updatedAt": "2024-01-05T08:44:29Z"
        },
        {
            "name": "Arambh-Hackathon",
            "description": null,
            "score": 1.6175559731596056,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Abm32/Arambh-Hackathon",
            "updatedAt": "2024-04-20T01:40:59Z"
        },
        {
            "name": "facebook_clone",
            "description": "This is a duplicate facebook page made for educational purpose",
            "score": 1.6086735220983888,
            "stars": 1,
            "forks": 0,
            "language": "CSS",
            "url": "https://github.com/Abm32/facebook_clone",
            "updatedAt": "2024-09-21T06:12:37Z"
        },
        {
            "name": "OTD",
            "description": "OTD is made to predict the probability of an individual to get affected by a disease and gives him suggestions on how to get not affected based on his/her habits.",
            "score": 1.5378750666535004,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Abm32/OTD",
            "updatedAt": "2023-01-02T11:30:25Z"
        },
        {
            "name": "Chatbot-with-Tkinter",
            "description": "A chatbot written in python and given a GUI using tkinter module",
            "score": 1.5371986304488998,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Abm32/Chatbot-with-Tkinter",
            "updatedAt": "2023-09-01T13:09:21Z"
        }
    ],
    "followers": 44,
    "following": 33,
    "public_repos": 102,
    "pull_requests_merged": 29,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 1169,
        "repositories_contributed_to": 6
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/AbhimanyuRB1"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/abhimanyurb"
        }
    ],
    "activity_summary": {
        "survival_guide": {
            "link": "https://github.com/Abm32/survival_guide",
            "summary": "Recent activities include multiple updates to the README.md file, addition of new pages and project documents, and the implementation of a basic UI with an apocalyptic theme. Furthermore, the repository was initialized with base files, indicating the start of a new project. These updates suggest ongoing development and refinement of the project."
        },
        "Real-Time-Stock-and-Sentiment-Analysis-Dashboard": {
            "link": "https://github.com/Abm32/Real-Time-Stock-and-Sentiment-Analysis-Dashboard",
            "summary": "The repository has seen significant activity, including the removal of Databricks and the integration of TextBlob for sentiment analysis. Additionally, base project code was added on multiple occasions, and the project was initialized with base files. These updates indicate a focus on setting up the project's foundation and integrating key technologies for sentiment analysis."
        },
        "student_management": {
            "link": "https://github.com/Abm32/student_management",
            "summary": "Recent activities have centered around enhancing the functionality of the student management system, including the addition of delete functionality, implementation of edit functionality, and routing it in Express to MySQL. The repository also saw fixes to the read command and the connection of the client and server to MySQL, showcasing progress in developing a comprehensive management system."
        },
        "coqui-tts-practise": {
            "link": "https://github.com/Abm32/coqui-tts-practise",
            "summary": "The repository has seen a recent update with the creation of a Text-to-Speech component, specifically a C42-Text-to-Speech addition, indicating the start or enhancement of a project focused on text-to-speech capabilities."
        }
    },
    "profile_summary": "Abhimanyu R B is a skilled and accomplished developer with a strong foundation in programming languages such as Python, JavaScript, and Kotlin. With a proven track record of building robust and efficient applications, he has established himself as a reliable and innovative professional in the field of software development. His extensive experience and technical expertise have earned him a significant following of 44 professionals, who value his insights and contributions to the development community. As a passionate and committed developer, Abhimanyu is always looking to expand his skill set and stay up-to-date with the latest technologies and trends.\n\nWith a portfolio of 102 public repositories, Abhimanyu has consistently demonstrated his ability to design, develop, and deploy high-quality applications that meet the needs of users. His dedication to his craft and his enthusiasm for learning and exploring new technologies have made him a valuable asset to any development team. As a seasoned developer with a unique blend of technical skills and professional experience, Abhimanyu is well-positioned to drive innovation and deliver results in a rapidly evolving technological landscape. His expertise in languages such as Python, JavaScript, and Kotlin makes him an ideal candidate for a wide range of development projects, from web and mobile applications to data science and machine learning initiatives."
}