{
    "username": "abnv-o",
    "name": "Abhinav O",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/105405861?u=4e197c6c5c9364574103ebace0c4fdacac0e6212&v=4",
    "profile_url": "https://github.com/abnv-o",
    "top_languages": [
        [
            "JavaScript",
            2
        ],
        [
            "Python",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "network_packet_sniffer",
            "description": null,
            "score": 0.30672656709592333,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/abnv-o/network_packet_sniffer",
            "updatedAt": "2024-08-25T15:58:50Z",
            "isPinned": false,
            "homepage": null
        },
        {
            "name": "Kaleidoscope",
            "description": "A simple kaleidoscope using javascript",
            "score": 0.27787232118406857,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/abnv-o/Kaleidoscope",
            "updatedAt": "2024-05-29T17:11:09Z",
            "isPinned": false,
            "homepage": "https://kaleidoscope-theta.vercel.app"
        },
        {
            "name": "portfolio",
            "description": null,
            "score": 0.26901249854551246,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/abnv-o/portfolio",
            "updatedAt": "2024-12-29T08:57:29Z",
            "isPinned": false,
            "homepage": "https://portfolio-dun-alpha-91.vercel.app"
        },
        {
            "name": "abnv-o",
            "description": null,
            "score": 0.2674048564229461,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/abnv-o/abnv-o",
            "updatedAt": "2024-04-07T15:56:22Z",
            "isPinned": false,
            "homepage": null
        }
    ],
    "followers": 2,
    "following": 1,
    "public_repos": 8,
    "pull_requests_merged": 3,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 128,
        "repositories_contributed_to": 2
    },
    "social_accounts": [],
    "readme_content": "# Greetings, 👋 I'm Abhinav O\n\nWelcome to the vibrant world of my GitHub playground! 🎉 Here, we embark on thrilling journeys through code and creativity, crafting digital wonders together.\n\n## A Peek into My Universe\n\nI'm currently embarking on the thrilling journey of pursuing my B.Tech in Information Technology, wielding the spirit of a cosmic explorer! 🚀 While web development serves as my main fuel, propelling me into the boundless expanse of computer science, I'm not confined solely to its realm. As a freelance web developer and tutor, I sprinkle programming magic like confetti! 🎓💻 . I'm fervently exploring other captivating domains within computer science, driven by an insatiable curiosity to delve deeper and uncover more treasures.\n\n## Skills at Warp Speed\n\n- **Web Wizardry:** Picture this: crafting enchanting web experiences with React.js, Next.js, and the mystical powers of JavaScript—it's where I excel!\n- **Languages:** Fluent in the tongues of JavaScript, C, C++, and Java—because who can resist the allure of a juicy coding challenge, right?\n- **Teaching Tales:** Ever heard of the power of knowledge-sharing? It's my secret weapon! Let's embark on a journey of growth and learning together. 🌱\n\n## Let's Chart a Course!\n\nFeeling the urge to connect? Reach out through these cosmic channels:\n\n- **LinkedIn:** [Join me on this voyage!](https://www.linkedin.com/in/abhinav-o/) 🤝\n- **Instagram:** [Hop on board my journey](https://www.instagram.com/abhi_nav.o/?next=%2F) 📸\n- **Email:** Dive into the depths of conversation at abhinavrajesh2002@gmail.com 📧\n\n## Ready for Liftoff?\n\nWhether it's sparking new ideas, collaborating on projects, or simply swapping memes, I'm all ears! 🤓 Don't hesitate—let's conjure up some tech wizardry together.\n\nThanks for stepping into this cosmic realm, and let's weave our dreams into the fabric of reality through code! 💫✨\n\nCatch you on the digital flip side,  \nAbhinav O\n",
    "activity_summary": {
        "Make-a-Ton/make-a-ton-2024": {
            "link": "https://github.com/Make-a-Ton/make-a-ton-2024",
            "summary": "Recent activities in this repository have focused on refining the website's content and layout. Multiple push events have addressed issues with links, added and removed sections such as track prizes and partnerships, and made adjustments to the design, including the positioning of the Logitech section. These updates indicate a concerted effort to improve the user experience and ensure the accuracy of the information presented."
        },
        "abnv-o/portfolio": {
            "link": "https://github.com/abnv-o/portfolio",
            "summary": "The portfolio repository has seen significant updates, including the deletion of old files and the introduction of version 2, which is currently a work in progress. Additionally, efforts have been made to enhance the repository's visibility through the addition of a verification meta tag for Google Search Console and the inclusion of a Google Search Console verify file, highlighting a focus on search engine optimization and online presence."
        }
    },
    "profile_summary": "I'm Abhinav O, a freelance web developer and tutor with a strong foundation in JavaScript and Python, currently pursuing my B.Tech in Information Technology. With a passion for web development and a curiosity-driven approach to computer science, I create engaging web experiences with technologies like React.js and Next.js. As a collaborative and knowledge-sharing enthusiast, I'm excited to connect with like-minded individuals and work together on innovative projects."
}