{
    "username": "adarshps123",
    "name": "adarshps123",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/67976453?v=4",
    "profile_url": "https://github.com/Adarshps123",
    "top_languages": [
        [
            "Cadence",
            1
        ],
        [
            "Solidity",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "flow-assessment",
            "description": null,
            "score": 0.16398619526897049,
            "stars": 0,
            "forks": 0,
            "language": "Cadence",
            "url": "https://github.com/Adarshps123/flow-assessment",
            "updatedAt": "2023-10-01T09:01:34Z"
        },
        {
            "name": "Metacrafters-assesment",
            "description": null,
            "score": 0.1618118616895588,
            "stars": 0,
            "forks": 0,
            "language": "Solidity",
            "url": "https://github.com/Adarshps123/Metacrafters-assesment",
            "updatedAt": "2023-08-24T17:15:54Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Adarshps123 is a high-performing developer with a strong focus on Cadence and Solidity, delivering innovative solutions in complex technology environments. With a passion for staying updated on the latest advancements in his field, he continues to hone his technical skills and expand his knowledge base. Having actively managed and developed multiple projects, he demonstrates exceptional problem-solving abilities and collaboration skills, showcasing his ability to effectively translate code into real-world applications.\n\nAs a skilled developer with a strong track record, adarshps123 brings reliability, expertise, and technical prowess to his work. With a keen eye for detail and a commitment to delivering high-quality solutions, he consistently exceeds expectations in his coding endeavors. Whether addressing complex technical challenges or driving innovative projects forward, adarshps123 applies his in-depth knowledge of Cadence and Solidity to drive results and make meaningful contributions in the field of software development."
}