{
    "username": "afnash",
    "name": "Afnash",
    "bio": "🥷",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/146858914?u=a2acb7c02cde8ba774b0013f1efc23175d415166&v=4",
    "profile_url": "https://github.com/afnash",
    "top_languages": [
        [
            "C++",
            1
        ],
        [
            "Python",
            2
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "calculator",
            "description": "A simple calculator using Python tkinter GUI",
            "score": 0.3796273039159753,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/afnash/calculator",
            "updatedAt": "2024-11-02T13:14:48Z"
        },
        {
            "name": "expense_manager",
            "description": null,
            "score": 0.33015687334523836,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/afnash/expense_manager",
            "updatedAt": "2024-09-22T16:20:46Z"
        },
        {
            "name": "sound_level_meter",
            "description": "sound level meter using arduino uno",
            "score": 0.28793626779905185,
            "stars": 0,
            "forks": 0,
            "language": "C++",
            "url": "https://github.com/afnash/sound_level_meter",
            "updatedAt": "2024-06-25T05:31:05Z"
        },
        {
            "name": "userprofile",
            "description": "User authentication and profile system using Python django and SQLite.",
            "score": 0.28077614189870803,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/afnash/userprofile",
            "updatedAt": "2024-05-30T10:53:08Z"
        }
    ],
    "followers": 1,
    "following": 2,
    "public_repos": 4,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 13,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "activity_summary": {
        "afnash/calculator": {
            "link": "https://github.com/afnash/calculator",
            "summary": "Recent activities in the afnash/calculator repository involve initial setup and development, marked by the first commit on November 2, 2024, laying the groundwork for future enhancements and contributions to the project."
        }
    },
    "profile_summary": "Afnash is a highly skilled software developer with a strong foundation in programming languages such as C++, Python, and HTML. With a growing professional network, as evidenced by their followers, Afnash has established themselves as a reliable and innovative technologist. Their expertise in these technical areas enables them to design, develop, and deploy high-quality software solutions that meet the demands of today's fast-paced digital landscape. As a passionate and dedicated developer, Afnash consistently delivers exceptional results, demonstrating a deep understanding of computer science principles and software development best practices.\n\nWith a portfolio of four public repositories, Afnash showcases their commitment to active development and collaborative engagement. Their technical proficiency, combined with a keen eye for detail and a passion for innovation, makes them a valuable asset to any development team. As a ninja-like developer, Afnash navigates complex coding challenges with ease, leveraging their expertise to drive projects forward and achieve outstanding outcomes. By emphasizing technical excellence, creativity, and a customer-centric approach, Afnash has established a strong reputation as a high-performing developer who consistently delivers high-quality solutions that exceed expectations."
}