{
    "username": "ajayyai",
    "name": "Ajay",
    "bio": "Breaking down binaries and containerizing chaos, one byte at a time",
    "location": "Bengaluru",
    "avatar_url": "https://avatars.githubusercontent.com/u/114474634?u=25025b57adf0656f2129d036f6341c580df2836f&v=4",
    "profile_url": "https://github.com/ajayyAI",
    "top_languages": [
        [
            "TypeScript",
            11
        ],
        [
            "Go",
            1
        ],
        [
            "JavaScript",
            3
        ]
    ],
    "top_projects": [
        {
            "name": "lib-manage-nestjs",
            "description": "A simple Library Management System API for managing books and authors with CRUD operations and search functionality. Documented using OpenAPI (Swagger) and includes unit tests.",
            "score": 1.6710400689023328,
            "stars": 1,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/ajayyAI/lib-manage-nestjs",
            "updatedAt": "2024-07-20T18:36:16Z"
        },
        {
            "name": "elevate",
            "description": "🌐 Investor-Founder Connection Platform: Bridging ideas and investment seamlessly. Utilizing microservices, Kubernetes, Docker, and Kafka for a scalable and dynamic collaboration space",
            "score": 1.6315570258667005,
            "stars": 1,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/ajayyAI/elevate",
            "updatedAt": "2024-06-12T04:56:11Z"
        },
        {
            "name": "space-shopping",
            "description": " 🛍️ FunkoToys E-commerce: Explore a vibrant world of Funko toys in this Node.js-powered e-commerce app. Utilizing EJS for dynamic views and seamless user interactions. Shop, discover, and enjoy your favorite Funko collectibles effortlessly! 🎉",
            "score": 1.6189496797879541,
            "stars": 1,
            "forks": 0,
            "language": "EJS",
            "url": "https://github.com/ajayyAI/space-shopping",
            "updatedAt": "2024-12-05T15:50:19Z"
        },
        {
            "name": "companio.ai",
            "description": "An AI companion app that leverages openai to provide personalized conversational experiences and memory management capabilities",
            "score": 1.3175930920239864,
            "stars": 0,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/ajayyAI/companio.ai",
            "updatedAt": "2024-05-28T11:17:27Z"
        },
        {
            "name": "BrainBox-Quiz",
            "description": "A versatile and user-friendly quiz platform for creating, managing, and taking quizzes. Perfect for educators, trainers, and quiz enthusiasts",
            "score": 1.205211547381209,
            "stars": 0,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/ajayyAI/BrainBox-Quiz",
            "updatedAt": "2023-11-13T18:53:01Z"
        },
        {
            "name": "videoTranscode",
            "description": null,
            "score": 0.38959545325840733,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/ajayyAI/videoTranscode",
            "updatedAt": "2024-12-17T19:29:20Z"
        },
        {
            "name": "dotfiles",
            "description": null,
            "score": 0.3367496740233143,
            "stars": 0,
            "forks": 0,
            "language": "Lua",
            "url": "https://github.com/ajayyAI/dotfiles",
            "updatedAt": "2024-11-05T06:30:34Z"
        },
        {
            "name": "gale-shapley-test",
            "description": null,
            "score": 0.28559061529244567,
            "stars": 0,
            "forks": 0,
            "language": "Go",
            "url": "https://github.com/ajayyAI/gale-shapley-test",
            "updatedAt": "2024-06-20T10:53:38Z"
        }
    ],
    "followers": 47,
    "following": 38,
    "public_repos": 24,
    "pull_requests_merged": 25,
    "issues_closed": 2,
    "achievements": {
        "total_contributions": 1207,
        "repositories_contributed_to": 5
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/ajay-er/"
        }
    ],
    "activity_summary": {
        "ajayyAI/videoTranscode": {
            "link": "https://github.com/ajayyAI/videoTranscode",
            "summary": "Recent activities include multiple refactor updates to the transcoding and structure, as well as the addition of cloudfront secure URL generation and updates to .gitignore and .env.example files, all occurring between December 2 and 17, 2024."
        },
        "ajayyAI/space-shopping": {
            "link": "https://github.com/ajayyAI/space-shopping",
            "summary": "Recent activities include a Pull Request Event and Push Event on December 5, 2024, which involved bumping mongoose from 7.0.3 to 7.8.3, addressing various fixes and enhancements such as query handling and performance improvements, as outlined in the mongoose changelog."
        }
    },
    "profile_summary": "Ajay is a highly skilled developer with a strong background in programming languages such as TypeScript, Go, and JavaScript. With a unique approach to breaking down complex systems and containerizing chaos, Ajay brings a distinctive perspective to the field of software development. As a seasoned professional, Ajay has built a reputation for delivering high-quality solutions that are both efficient and reliable. With a network of 47 followers and a portfolio of 24 public repositories, Ajay has demonstrated a commitment to collaborative development and open-source sharing.\n\nAs a technical expert with a passion for innovation, Ajay is dedicated to staying at the forefront of industry trends and advancements. With a focus on cloud-native applications, microservices architecture, and containerization, Ajay is well-versed in the latest technologies and frameworks. By leveraging expertise in languages like TypeScript, Go, and JavaScript, Ajay is able to design and develop scalable, secure, and high-performance solutions that meet the needs of modern businesses and organizations. With a bio that reflects a passion for simplifying complex systems, Ajay is a trusted and respected figure in the development community, known for breaking down binaries and containerizing chaos one byte at a time."
}