{
    "username": "aloshdenny",
    "name": "Alosh Denny",
    "bio": "I saw. I came.",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/97750960?u=a60c27ced30c5c58f855ca09efa79f09699a593a&v=4",
    "profile_url": "https://github.com/aloshdenny",
    "top_languages": [
        [
            "Jupyter Notebook",
            14
        ],
        [
            "Python",
            6
        ],
        [
            "TypeScript",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "mygpt",
            "description": "super small gpt implementation",
            "score": 7.37436834623553,
            "stars": 17,
            "forks": 1,
            "language": "Jupyter Notebook",
            "url": "https://github.com/aloshdenny/mygpt",
            "updatedAt": "2024-12-16T18:28:25Z"
        },
        {
            "name": "ai50",
            "description": "Intro to Artificial Intelligence, Machine Learning and Applied Deep Learning",
            "score": 3.9595545361146054,
            "stars": 5,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/aloshdenny/ai50",
            "updatedAt": "2024-12-17T08:09:06Z"
        },
        {
            "name": "superfloat-accelerator",
            "description": "Accelerators for AI. Reimagined.",
            "score": 3.873309627964261,
            "stars": 5,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/aloshdenny/superfloat-accelerator",
            "updatedAt": "2024-12-29T08:26:32Z"
        },
        {
            "name": "MEDETH",
            "description": "Med_ETH is a decentralized Ethereum-based medical record network that utilizes IPFS technology to securely store patient data widely over the planet's medical industry.",
            "score": 3.4817685939358505,
            "stars": 2,
            "forks": 1,
            "language": "CSS",
            "url": "https://github.com/aloshdenny/MEDETH",
            "updatedAt": "2024-08-18T09:50:19Z"
        },
        {
            "name": "agent-orange",
            "description": "Agentic Workflow for Tasks; Scalable Digital Twin Solutions",
            "score": 2.549115885918635,
            "stars": 2,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/aloshdenny/agent-orange",
            "updatedAt": "2024-11-26T16:47:08Z"
        },
        {
            "name": "RevGen",
            "description": "GPT-2 model trained on 20 million amazon reviews. Can generate product reviews, text completion and some other weird gibberish.",
            "score": 1.8052044992620666,
            "stars": 0,
            "forks": 2,
            "language": "Jupyter Notebook",
            "url": "https://github.com/aloshdenny/RevGen",
            "updatedAt": "2023-10-21T16:40:34Z"
        },
        {
            "name": "Attack-Detection",
            "description": "Regularized Hybrid Deep Learning for DDoS Attack Prediction in Software-Defined  IoT Networks",
            "score": 1.6494317785310384,
            "stars": 1,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/aloshdenny/Attack-Detection",
            "updatedAt": "2024-08-27T07:58:59Z"
        },
        {
            "name": "AutoTranslate",
            "description": "AI-assisted multilingual TTS and STT",
            "score": 1.6351216166897935,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/aloshdenny/AutoTranslate",
            "updatedAt": "2024-01-24T09:15:56Z"
        }
    ],
    "followers": 36,
    "following": 0,
    "public_repos": 48,
    "pull_requests_merged": 12,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 327,
        "repositories_contributed_to": 7
    },
    "social_accounts": [],
    "activity_summary": {
        "aloshdenny/superfloat-accelerator": {
            "link": "https://github.com/aloshdenny/superfloat-accelerator",
            "summary": "The superfloat-accelerator repository has seen significant activity, with multiple push events in the last two weeks. The updates include adding sf8, sf11, and sf16 experimental models, updating the README.md file, and adding a new LTH Trainer. The repository has also seen multiple merges from the main branch, indicating collaborative development. Additionally, there have been updates to experimental results, including sf4 and sf11."
        },
        "aloshdenny/mygpt": {
            "link": "https://github.com/aloshdenny/mygpt",
            "summary": "The mygpt repository has experienced recent activity, including updates to the README.md file and the addition of Malayalam support. There have also been refactorings and training of default models, indicating ongoing development and improvement of the repository's content. These changes suggest a focus on expanding the repository's capabilities and maintaining its documentation."
        },
        "aloshdenny/ai50": {
            "link": "https://github.com/aloshdenny/ai50",
            "summary": "The ai50 repository has seen some activity, with updates to the README.md file and the addition of new files via upload. These changes were made using Colab, suggesting a focus on data-driven development. Although the activity is less extensive compared to other repositories, the updates indicate ongoing work and potential for future growth in the repository."
        }
    },
    "profile_summary": "Alosh Denny is a highly skilled developer with a strong foundation in technical skills, including expertise in Jupyter Notebook, Python, and TypeScript. With a growing professional network of 36 followers, Alosh has established himself as a reliable and innovative presence in the development community. His active portfolio of 48 public repositories showcases his dedication to ongoing learning and improvement, demonstrating a consistent ability to deliver high-quality solutions. As a seasoned developer, Alosh brings a unique combination of technical expertise and creative problem-solving skills to the table, making him a valuable asset to any project or team.\n\nAlosh's approach to development is guided by a simple yet powerful philosophy, \"I saw, I came,\" reflecting his commitment to tackling complex challenges head-on and delivering results-driven solutions. With a keen eye for detail and a talent for leveraging industry-leading tools and technologies, Alosh is well-equipped to drive innovation and growth in a rapidly evolving development landscape. As a trusted and experienced developer, Alosh is dedicated to delivering exceptional results, fostering collaborative relationships, and pushing the boundaries of what is possible in the world of software development, making him an ideal partner for businesses and organizations seeking to harness the power of technology to drive success."
}