{
    "username": "amith786",
    "name": "Amith Anand",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/116346852?v=4",
    "profile_url": "https://github.com/Amith786",
    "top_languages": [
        [
            "Python",
            1
        ],
        [
            "Java",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Codsoft",
            "description": null,
            "score": 0.26407648204542317,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Amith786/Codsoft",
            "updatedAt": "2024-03-02T14:22:03Z"
        },
        {
            "name": "410622243003",
            "description": null,
            "score": 0.15927316838500055,
            "stars": 0,
            "forks": 0,
            "language": "Java",
            "url": "https://github.com/Amith786/410622243003",
            "updatedAt": "2023-07-07T02:11:06Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 4,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Amith Anand is a skilled software developer with a strong background in Python and Java, leveraging these expertise to design and develop high-quality software applications. With a keen eye for innovation and a passion for staying up-to-date with the latest technologies, Amith continually expands his technical knowledge to deliver efficient and effective solutions. As an active developer, he maintains a growing portfolio of public repositories, showcasing his ability to collaborate and contribute to a wide range of projects.\n\nWith expertise spanning multiple programming languages and a proven track record in delivering reliable and scalable software applications, Amith is well-positioned to drive technical projects forward and add value to collaborative teams. His growing professional network is a testament to his dedication to the field and his strong technical acumen. As a talented developer committed to delivering exceptional results, Amith Anand is poised to drive innovation and success in the software development industry."
}