{
    "username": "aneesv",
    "name": "Anees v",
    "bio": "https://appmaker.xyz \r\nhttps://intercept.rest ",
    "location": "Kerala,India",
    "avatar_url": "https://avatars.githubusercontent.com/u/849175?u=3c10998705e3217000e1addfbc69dbf79de9700c&v=4",
    "profile_url": "https://github.com/aneesv",
    "top_languages": [],
    "top_projects": [
        {
            "name": "docker",
            "description": null,
            "score": 1.510947810245933,
            "stars": 1,
            "forks": 0,
            "language": null,
            "url": "https://github.com/aneesv/docker",
            "updatedAt": "2023-03-04T08:39:05Z"
        }
    ],
    "followers": 26,
    "following": 8,
    "public_repos": 12,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 503,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/aneesv"
        }
    ],
    "profile_summary": "Anees v is a highly skilled and accomplished developer with a strong online presence, boasting 26 followers and 12 public repositories that showcase his active development and commitment to innovation. His technical expertise is further highlighted by his involvement in notable projects, including appmaker.xyz and intercept.rest, demonstrating his ability to design and deliver cutting-edge solutions. With a proven track record of developing high-quality software, Anees v has established himself as a reliable and talented professional in the field of software development.\n\nAs a seasoned developer, Anees v brings a unique combination of technical skills and industry knowledge to the table, making him a valuable asset to any project. His expertise in software development, paired with his experience in creating innovative solutions, enables him to drive projects forward with precision and accuracy. With a strong focus on delivering exceptional results, Anees v is dedicated to staying up-to-date with the latest industry trends and technologies, ensuring that his skills remain relevant and in-demand. His professional network and online presence continue to grow, solidifying his position as a high-performing and innovative developer in the industry."
}