{
    "username": "aryavinodkv",
    "name": "Arya Vinod",
    "bio": "",
    "location": "Kochi",
    "avatar_url": "https://avatars.githubusercontent.com/u/145095317?u=c8af7f60d8d4da7dfc3809983ba036533315b97e&v=4",
    "profile_url": "https://github.com/AryaVinodKV",
    "top_languages": [
        [
            "Java",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Order-Managament-SpringBoot",
            "description": null,
            "score": 0.16292676282081378,
            "stars": 0,
            "forks": 0,
            "language": "Java",
            "url": "https://github.com/AryaVinodKV/Order-Managament-SpringBoot",
            "updatedAt": "2023-09-20T09:38:14Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 1,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Arya Vinod is a skilled Java developer with a strong foundation in software development and a passion for creating innovative solutions. With a focus on delivering high-quality results, Arya brings a unique combination of technical expertise and collaborative mindset to the table. As a dedicated professional, Arya is committed to staying up-to-date with the latest industry trends and technologies, ensuring that clients and projects receive the best possible outcomes. With a growing portfolio of public repositories, Arya is actively engaged in the development community, demonstrating a commitment to continuous learning and improvement.\n\nAs a Java expert, Arya Vinod offers a distinct value proposition to clients and collaborators, leveraging expertise in software development to drive project success. With a strong online presence and a track record of active development, Arya is poised to make a meaningful impact in the tech industry. By combining technical prowess with a collaborative approach, Arya delivers reliable, efficient, and effective solutions that meet the needs of clients and stakeholders. With a focus on building a strong professional network, Arya is dedicated to fostering meaningful relationships and driving success through innovative software development and collaborative partnerships."
}