{
    "username": "aswinasok",
    "name": "Aswin Asok",
    "bio": "i don't want to learn everything by heart. Rather, I would use my logic to derive or apply the best solution.",
    "location": "Trivandrum",
    "avatar_url": "https://avatars.githubusercontent.com/u/64626875?v=4",
    "profile_url": "https://github.com/AswinAsok",
    "top_languages": [
        [
            "JavaScript",
            26
        ],
        [
            "C",
            1
        ],
        [
            "TypeScript",
            5
        ]
    ],
    "top_projects": [
        {
            "name": "editr",
            "description": "A Minimalist Text Editr web application made using React.js and pure CSS.  Integrated with functions like speech recognition and text statistics.",
            "score": 11.798632837986977,
            "stars": 62,
            "forks": 8,
            "language": "JavaScript",
            "url": "https://github.com/AswinAsok/editr",
            "updatedAt": "2024-06-29T01:11:40Z"
        },
        {
            "name": "InstaFetcher",
            "description": "This is a python project built using Selenium library which can fetch the usernames of People who aren't following you back.",
            "score": 7.078614864111577,
            "stars": 10,
            "forks": 3,
            "language": "Python",
            "url": "https://github.com/AswinAsok/InstaFetcher",
            "updatedAt": "2024-01-19T11:42:17Z"
        },
        {
            "name": "Profile-Retriever",
            "description": "This is a React Project made using Material UI which can fetch the details of a GitHub user using GitHub API. This is my first react.js web-app",
            "score": 5.714238318547349,
            "stars": 9,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/AswinAsok/Profile-Retriever",
            "updatedAt": "2022-03-20T04:40:31Z"
        },
        {
            "name": "chat-inn",
            "description": "The Chat'Inn is a simple and minimal realtime chat application whose database is powered by firebase and firestore.",
            "score": 5.499356145558971,
            "stars": 13,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/AswinAsok/chat-inn",
            "updatedAt": "2024-11-24T12:31:50Z"
        },
        {
            "name": "shotr",
            "description": "Shorten your links with ease using Shotr! This is a web application made with HTML, CSS, JavaScript, and React.js. The UI is minimalistic and clean, and the app has a memory function that makes it easy to use.",
            "score": 5.429865466239304,
            "stars": 7,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/AswinAsok/shotr",
            "updatedAt": "2024-11-26T16:09:10Z"
        },
        {
            "name": "Shopping-Cart",
            "description": "This is my first Full-stack project made using Nodejs, MongoDB, Express.js and Handlebars. I am currently pausing this project here as I am not able to understand the working of the code and once the confusion has been cleared I will resume it.",
            "score": 4.93482858852786,
            "stars": 4,
            "forks": 2,
            "language": "Handlebars",
            "url": "https://github.com/AswinAsok/Shopping-Cart",
            "updatedAt": "2021-10-28T13:21:15Z"
        },
        {
            "name": "lev",
            "description": "ev App is a lightweight and cool web application that provides a list of upcoming holidays.  The app is built using React.js and Pure CSS, with a touch of my creativity, resulting in a sleek and modern design that is easy to navigate",
            "score": 4.625656469289831,
            "stars": 8,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/AswinAsok/lev",
            "updatedAt": "2024-01-01T06:41:37Z"
        },
        {
            "name": "vow",
            "description": "vow is a simple & static app that displays an affirmation along with a fact about it.",
            "score": 3.8149988280873037,
            "stars": 5,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/AswinAsok/vow",
            "updatedAt": "2024-05-26T11:40:41Z"
        }
    ],
    "followers": 198,
    "following": 96,
    "public_repos": 113,
    "pull_requests_merged": 6,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 3057,
        "repositories_contributed_to": 15
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/_aswin_asok_"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/-aswinasok/"
        }
    ],
    "activity_summary": {
        "BuildNShip/hoogo": {
            "link": "https://github.com/BuildNShip/hoogo",
            "summary": "Recent activities in the BuildNShip/hoogo repository include multiple push events with various features and fixes added, such as adding total connections, images, and a carousel, as well as fixes for build issues, responsive design, and leaderboards, indicating a significant amount of development and refinement."
        },
        "theparentcompany-xyz/makemypass-app": {
            "link": "https://github.com/theparentcompany-xyz/makemypass-app",
            "summary": "The theparentcompany-xyz/makemypass-app repository has seen substantial activity with numerous push events, focusing on features like rejection-approval systems, user submission structures, and finance-related updates, along with several bug fixes and improvements for user interfaces, APIs, and more, showing comprehensive development and maintenance efforts."
        },
        "Scaleupvillage/scaleup25": {
            "link": "https://github.com/Scaleupvillage/scaleup25",
            "summary": "The Scaleupvillage/scaleup25 repository has had notable activities, including push events that introduced a flipbook feature, updated forms, and made adjustments to stalls and form fields, along with some merge operations, indicating ongoing enhancements and refinements to the repository's content and structure."
        }
    },
    "profile_summary": "Aswin Asok is a highly skilled and innovative developer with a strong foundation in programming languages such as JavaScript, C, and TypeScript. With a professional network of 198 followers and a portfolio of 113 public repositories, Aswin has established himself as a reliable and accomplished professional in the field of software development. His approach to problem-solving is centered around logical thinking and creative application, allowing him to derive and implement effective solutions to complex technical challenges.\n\nAswin's technical expertise and passion for development have earned him a reputation as a high-performing and results-driven professional. By leveraging his skills in JavaScript, C, and TypeScript, he delivers high-quality solutions that meet the needs of his clients and peers. With a focus on using logic to drive innovation, Aswin continues to push the boundaries of what is possible in software development, making him a valuable asset to any project or team. His dedication to his craft and commitment to staying at the forefront of industry trends make him an exceptional developer and a sought-after collaborator in the field of software development."
}