{
    "username": "austin-alukka",
    "name": "Austin Benny",
    "bio": "",
    "location": "Kochi",
    "avatar_url": "https://avatars.githubusercontent.com/u/118275774?v=4",
    "profile_url": "https://github.com/AUSTIN-ALUKKA",
    "top_languages": [
        [
            "TypeScript",
            1
        ],
        [
            "C#",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "StoreRoom_Mangement",
            "description": null,
            "score": 0.43681001432994365,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/AUSTIN-ALUKKA/StoreRoom_Mangement",
            "updatedAt": "2024-12-17T10:38:59Z"
        },
        {
            "name": "3DGame",
            "description": "First 3D Unity game",
            "score": 0.1635084431645399,
            "stars": 0,
            "forks": 0,
            "language": "C#",
            "url": "https://github.com/AUSTIN-ALUKKA/3DGame",
            "updatedAt": "2023-09-30T08:46:28Z"
        }
    ],
    "followers": 0,
    "following": 1,
    "public_repos": 3,
    "pull_requests_merged": 1,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 51,
        "repositories_contributed_to": 1
    },
    "social_accounts": [],
    "activity_summary": {
        "AUSTIN-ALUKKA/StoreRoom_Mangement": {
            "link": "https://github.com/AUSTIN-ALUKKA/StoreRoom_Mangement",
            "summary": "Recent activities in the StoreRoom_Mangement repository include the initiation of a new project with the first instance commit on November 25, 2024, marking the beginning of the project's development."
        }
    },
    "profile_summary": "Austin Benny is a skilled and dedicated software developer with a strong foundation in TypeScript and C#. With a growing portfolio of public repositories, he demonstrates his ability to design, develop, and deploy high-quality software solutions. As a proficient programmer, he leverages his technical expertise to drive innovation and deliver results-driven projects that meet the evolving needs of the industry. With a keen eye for detail and a passion for coding, Austin is committed to staying up-to-date with the latest trends and advancements in software development.\n\nAs a rising talent in the programming community, Austin brings a unique blend of technical skills and creative problem-solving abilities to the table. With a focus on building scalable, efficient, and reliable software systems, he is well-equipped to tackle complex challenges and collaborate with cross-functional teams to achieve shared goals. As he continues to expand his professional network and contribute to open-source projects, Austin is poised to make a lasting impact in the world of software development, delivering innovative solutions that drive business value and exceed customer expectations."
}