{
    "username": "biohazard786",
    "name": "Mohd Zaid",
    "bio": "Average software engineer",
    "location": "Dehradun, India",
    "avatar_url": "https://avatars.githubusercontent.com/u/54793151?u=0e510cb52f2537fc3cf6d0bfd12923f191eaa387&v=4",
    "profile_url": "https://github.com/BioHazard786",
    "top_languages": [
        [
            "TypeScript",
            2
        ],
        [
            "Python",
            3
        ],
        [
            "JavaScript",
            4
        ]
    ],
    "top_projects": [
        {
            "name": "Nyaa-Proxy",
            "description": "Easily deployable nyaa proxy to access nyaa from blocked regions. Using vercel rewrites",
            "score": 7.709437403285332,
            "stars": 7,
            "forks": 8,
            "language": "JavaScript",
            "url": "https://github.com/BioHazard786/Nyaa-Proxy",
            "updatedAt": "2024-10-14T18:50:03Z"
        },
        {
            "name": "Billicious",
            "description": "Billicious is an open-source bill splitter app designed to simplify group expense splitting.",
            "score": 4.913347947023768,
            "stars": 5,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/BioHazard786/Billicious",
            "updatedAt": "2024-12-18T04:25:34Z"
        },
        {
            "name": "BookMyMovie",
            "description": "Use this bot to book fictional movie tickets – the only movie that is good for your eyes! A live version of the available here",
            "score": 3.8298629925208982,
            "stars": 5,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/BioHazard786/BookMyMovie",
            "updatedAt": "2024-05-08T20:34:51Z"
        },
        {
            "name": "Dump-Search-Index",
            "description": null,
            "score": 3.7385084630337677,
            "stars": 5,
            "forks": 0,
            "language": "CSS",
            "url": "https://github.com/BioHazard786/Dump-Search-Index",
            "updatedAt": "2023-12-03T13:08:30Z"
        },
        {
            "name": "InternFreak-Bot",
            "description": "Telegram bot that fetchs feed from internfreak and posts to telegram",
            "score": 3.181633118288581,
            "stars": 1,
            "forks": 2,
            "language": "Python",
            "url": "https://github.com/BioHazard786/InternFreak-Bot",
            "updatedAt": "2023-01-26T17:24:03Z"
        },
        {
            "name": "Yt-Music-Bot",
            "description": "A Telegram bot to download music from youtube and yt music links in best quality.",
            "score": 3.022324287255985,
            "stars": 3,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/BioHazard786/Yt-Music-Bot",
            "updatedAt": "2024-01-20T15:22:00Z"
        },
        {
            "name": "Billicious-Landing-Page",
            "description": "Landing page for app.billicious.tech",
            "score": 2.5016537981247855,
            "stars": 2,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/BioHazard786/Billicious-Landing-Page",
            "updatedAt": "2024-12-11T11:08:11Z"
        },
        {
            "name": "Custom-Posters",
            "description": "Custom Posters of anime, tv and movies",
            "score": 1.6423573718170938,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/BioHazard786/Custom-Posters",
            "updatedAt": "2024-05-28T18:21:53Z"
        }
    ],
    "followers": 11,
    "following": 3,
    "public_repos": 12,
    "pull_requests_merged": 34,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 177,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "generic",
            "url": "https://Lulu786.t.me"
        },
        {
            "provider": "twitter",
            "url": "https://x.com/Coder_Zaid"
        }
    ],
    "activity_summary": {
        "BioHazard786/Billicious": {
            "link": "https://github.com/BioHazard786/Billicious",
            "summary": "The Billicious repository has seen significant activity with multiple push events, including minor bug fixes, quality of life improvements, and the addition of features such as delete bill and transfer options. A final v1 release was also made, indicating a major milestone in the project's development."
        },
        "Alchemist-Alliance/Billicious": {
            "link": "https://github.com/Alchemist-Alliance/Billicious",
            "summary": "The Billicious repository in the Alchemist-Alliance organization has experienced substantial activity, with push events including minor bug fixes, a final v1 release, and updates to the README file. Additionally, efforts have been made to show the latest bills on top, and several pull requests have been merged, reflecting a high level of collaboration and development."
        },
        "BioHazard786/Billicious-Landing-Page": {
            "link": "https://github.com/BioHazard786/Billicious-Landing-Page",
            "summary": "The Billicious-Landing-Page repository has seen updates including the addition of a Product Hunt tag, updates to the README file, and the implementation of terms and privacy pages. These changes suggest an effort to enhance the user experience and comply with legal requirements, preparing the landing page for public engagement."
        },
        "Alchemist-Alliance/Billicious-Landing-Page": {
            "link": "https://github.com/Alchemist-Alliance/Billicious-Landing-Page",
            "summary": "The Billicious-Landing-Page repository within the Alchemist-Alliance organization has undergone similar updates as its counterpart, including updates to the README file and the addition of terms and privacy pages. These synchronistic updates indicate a coordinated effort to maintain consistency and legality across related projects, ensuring a unified public image."
        }
    },
    "profile_summary": "Mohd Zaid is a skilled software engineer with a strong background in programming languages such as TypeScript, Python, and JavaScript. He has established a reputation as a reliable and innovative developer, with a growing professional network of 11 followers who appreciate his technical expertise. With a portfolio of 12 public repositories, Mohd Zaid demonstrates his commitment to active development and collaboration, showcasing his ability to design, develop, and deploy high-quality software solutions. His proficiency in multiple programming languages enables him to tackle complex projects with ease, making him a valuable asset to any development team.\n\nAs a seasoned software engineer, Mohd Zaid brings a unique blend of technical skills and professional experience to the table. His expertise in TypeScript, Python, and JavaScript allows him to develop efficient, scalable, and maintainable software applications that meet the needs of diverse clients. With a strong foundation in software development, Mohd Zaid is well-equipped to handle a wide range of projects, from backend development to frontend engineering. His dedication to his craft and passion for innovation make him a sought-after professional in the industry, and his growing network of followers is a testament to his exceptional skills and collaborative spirit."
}