{
    "username": "destroyer-32",
    "name": "DESTROYER32",
    "bio": "gσ нαя∂ σя gσ нσмє.",
    "location": " Dehradun",
    "avatar_url": "https://avatars.githubusercontent.com/u/44976858?u=f57cebf51c7590c3742c0501819f8fc0ea84a53a&v=4",
    "profile_url": "https://github.com/DESTROYER-32",
    "top_languages": [
        [
            "JavaScript",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "DESTROYER-32",
            "description": null,
            "score": 0.2959219468663434,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/DESTROYER-32/DESTROYER-32",
            "updatedAt": "2024-07-18T02:35:10Z"
        },
        {
            "name": "profile-summary-cards",
            "description": null,
            "score": 0.2959219468663434,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/DESTROYER-32/profile-summary-cards",
            "updatedAt": "2024-12-22T00:47:42Z"
        },
        {
            "name": "DESTROYER-32.github.io",
            "description": null,
            "score": 0.07213475204444816,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/DESTROYER-32/DESTROYER-32.github.io",
            "updatedAt": "2022-03-05T17:08:22Z"
        }
    ],
    "followers": 27,
    "following": 11,
    "public_repos": 11,
    "pull_requests_merged": 14,
    "issues_closed": 18,
    "achievements": {
        "total_contributions": 311,
        "repositories_contributed_to": 6
    },
    "social_accounts": [],
    "activity_summary": {
        "ebertti/awesome-telegram": {
            "link": "https://github.com/ebertti/awesome-telegram",
            "summary": "Recent activities in the ebertti/awesome-telegram repository include three pull requests, all of which pertain to adding the XyroChatBot, submitted in November and December 2024, indicating ongoing work to integrate this bot into the project."
        },
        "DESTROYER-32/awesome-telegram": {
            "link": "https://github.com/DESTROYER-32/awesome-telegram",
            "summary": "In the DESTROYER-32/awesome-telegram repository, noticeable activities comprise push events, including updates to the README.md file and the addition of the XyroChatBot, demonstrating active maintenance and expansion of the repository's content in November and December 2024."
        },
        "PunisherxD/snake": {
            "link": "https://github.com/PunisherxD/snake",
            "summary": "The PunisherxD/snake repository saw a recent push event in December 2024, involving an update to the index.html file, suggesting ongoing development or refinement of the project's frontend or web-related components."
        }
    },
    "profile_summary": "DESTROYER32 is a highly skilled JavaScript developer with a strong online presence, boasting a network of 27 followers and an impressive portfolio of 11 public repositories. With a keen focus on delivering high-quality solutions, DESTROYER32 has established themselves as a reliable and innovative professional in the field of software development. Their expertise in JavaScript is complemented by a passion for staying up-to-date with the latest industry trends and technologies, ensuring that their work is always cutting-edge and effective.\n\nAs a seasoned developer, DESTROYER32 brings a unique value proposition to the table, combining technical expertise with a creative approach to problem-solving. With a motto that reflects their commitment to pushing boundaries and striving for excellence, gσ нαя∂ σя gσ нσмє, DESTROYER32 is dedicated to delivering exceptional results that exceed expectations. By leveraging their technical skills and industry knowledge, DESTROYER32 is well-positioned to drive innovation and growth in the tech industry, and their work is likely to have a lasting impact on the development community."
}