{
    "username": "dhanay-j",
    "name": "DHANAY J",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/121504874?u=6a7d86d9a350ac06209e01ea5f112db5f1f3dba2&v=4",
    "profile_url": "https://github.com/Dhanay-J",
    "top_languages": [
        [
            "Python",
            11
        ],
        [
            "C",
            1
        ],
        [
            "TypeScript",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Air-Hockey-Using-CV",
            "description": "This repository contains the code for a computer vision-based air hockey game developed using OpenCV and Python. The game is designed to be played using a webcam or other camera device, with the computer vision algorithm tracking the movement of the puck and paddles.",
            "score": 1.7092645917861575,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Dhanay-J/Air-Hockey-Using-CV",
            "updatedAt": "2024-09-16T05:53:28Z"
        },
        {
            "name": "test-repo",
            "description": "For Understanding Git Workflow",
            "score": 1.193858980584846,
            "stars": 0,
            "forks": 1,
            "language": "HTML",
            "url": "https://github.com/Dhanay-J/test-repo",
            "updatedAt": "2023-03-10T10:28:39Z"
        },
        {
            "name": "gRPC-Calculator",
            "description": "Basic Calculator API in gRPC-python",
            "score": 0.5683847725349267,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Dhanay-J/gRPC-Calculator",
            "updatedAt": "2024-12-12T15:58:22Z"
        },
        {
            "name": "RM_BG_Script",
            "description": "Helper Module to remove background from images using briaai/RMBG-2.0 for windows",
            "score": 0.41236136661374034,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Dhanay-J/RM_BG_Script",
            "updatedAt": "2024-12-15T04:18:21Z"
        },
        {
            "name": "PACMAN-AI-Micro-Project",
            "description": "This project is a recreation of the classic Pac-Man game, built using Pygame, a popular library for developing 2D games in Python. The project was developed as part of an AI Micro Project, focusing on implementing game mechanics, pathfinding algorithms for ghost AI, and a smooth, user-friendly experience.",
            "score": 0.3271560827809689,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Dhanay-J/PACMAN-AI-Micro-Project",
            "updatedAt": "2024-09-20T08:50:52Z"
        },
        {
            "name": "Py-Plat",
            "description": "A Coding Platform For Python Learning",
            "score": 0.30487923075586354,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Dhanay-J/Py-Plat",
            "updatedAt": "2024-08-15T08:23:12Z"
        },
        {
            "name": "Youtube2Mp3",
            "description": "Simple GUI to Convert Youtube Video to MP3 Using pytube and ttkbootstrap",
            "score": 0.27929642477188826,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Dhanay-J/Youtube2Mp3",
            "updatedAt": "2024-05-27T12:08:29Z"
        },
        {
            "name": "DBMS-Micro-Project",
            "description": null,
            "score": 0.2701262231536975,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/Dhanay-J/DBMS-Micro-Project",
            "updatedAt": "2024-05-13T06:29:31Z"
        }
    ],
    "followers": 13,
    "following": 31,
    "public_repos": 30,
    "pull_requests_merged": 3,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 235,
        "repositories_contributed_to": 3
    },
    "social_accounts": [],
    "activity_summary": {
        "RM_BG_Script": {
            "link": "https://github.com/Dhanay-J/RM_BG_Script",
            "summary": "Recent activities in the RM_BG_Script repository include several push events with updates such as correction of download filename, changes to IP and nginx, addition of HTTPS and deployment commands, updates to python-publish.yml, and addition of libmagic. These updates suggest ongoing development and refinement of the script's functionality."
        },
        "BUDai_HFT": {
            "link": "https://github.com/princejohnongit/BUDai_HFT",
            "summary": "The BUDai_HFT repository has seen significant activity with multiple push events, including updates to README.md, main.dart, and corrections to csp. Additionally, new pages have been added and initial commits have been made, indicating active development and expansion of the project's scope."
        },
        "gRPC-Calculator": {
            "link": "https://github.com/Dhanay-J/gRPC-Calculator",
            "summary": "The gRPC-Calculator repository has had recent push events, including the addition of basic gRPC calculator files and removal of blank space, suggesting initial setup and preparation for further development of a gRPC-based calculator application."
        }
    },
    "profile_summary": "Dhanay J is a highly skilled developer with a strong foundation in programming languages, including Python, C, and TypeScript. With a growing professional network of 13 followers, Dhanay J has established himself as a reliable and innovative presence in the development community. His technical expertise is complemented by a passion for collaborative development, with 30 public repositories demonstrating his active engagement in creating and sharing high-quality code. As a seasoned developer, Dhanay J is well-versed in leveraging his technical skills to drive project success and deliver results-driven solutions.\n\nDhanay J's unique value proposition lies in his ability to balance technical expertise with a keen eye for innovation and problem-solving. With a solid grasp of industry-relevant technologies, he is adept at crafting efficient, scalable, and reliable code that meets the evolving needs of the development landscape. As a dedicated and forward-thinking professional, Dhanay J is committed to staying at the forefront of industry trends and advancements, continually expanding his skill set to drive growth and excellence in his work. With his strong technical foundation, collaborative spirit, and passion for innovation, Dhanay J is poised to make a lasting impact in the world of development."
}