{
    "username": "gyanthakur",
    "name": "gyan pratap singh",
    "bio": "Web developer passionate about creating interactive applications. Skilled in React, Next.js, and Node.js. Open-source enthusiast committed to collaboration.....",
    "location": "Fatehpur Uttar Pradesh",
    "avatar_url": "https://avatars.githubusercontent.com/u/98226958?u=db20227ea69110af54d14655a367aa9389e2d02e&v=4",
    "profile_url": "https://github.com/Gyanthakur",
    "top_languages": [
        [
            "C++",
            9
        ],
        [
            "JavaScript",
            39
        ],
        [
            "TypeScript",
            4
        ]
    ],
    "top_projects": [
        {
            "name": "Dev_Profiles",
            "description": "DevProfiles: A place to list and shocase your developer skills and profile",
            "score": 15.798716214786843,
            "stars": 66,
            "forks": 116,
            "language": "HTML",
            "url": "https://github.com/Gyanthakur/Dev_Profiles",
            "updatedAt": "2024-12-14T17:12:59Z"
        },
        {
            "name": "GFG_POTD",
            "description": "Add GfG potd fcfsWelcome to Hacktoberfest, a fantastic opportunity for students to engage with the open-source community and contribute meaningfully to various projects. Here's a comprehensive guide to help you navigate your way through this exciting journey.",
            "score": 12.779425914293983,
            "stars": 26,
            "forks": 52,
            "language": "C++",
            "url": "https://github.com/Gyanthakur/GFG_POTD",
            "updatedAt": "2024-12-14T17:10:41Z"
        },
        {
            "name": "LeetCode_potd",
            "description": null,
            "score": 11.06795144252144,
            "stars": 15,
            "forks": 33,
            "language": "C++",
            "url": "https://github.com/Gyanthakur/LeetCode_potd",
            "updatedAt": "2024-11-07T08:11:14Z"
        },
        {
            "name": "e_learning_website",
            "description": "🌐 e_learning_website",
            "score": 7.861334265838359,
            "stars": 6,
            "forks": 11,
            "language": "HTML",
            "url": "https://github.com/Gyanthakur/e_learning_website",
            "updatedAt": "2024-12-14T17:43:21Z"
        },
        {
            "name": "Dev_Projects",
            "description": "Welcome to the Hacktoberfest Project Showcase! This repository is a platform for developers from around the world to show your project and share their amazing projects. Whether you've built a web app, a mobile app, a cool machine learning model, or any other tech project, we'd love to see it!",
            "score": 6.919281551251118,
            "stars": 4,
            "forks": 9,
            "language": "HTML",
            "url": "https://github.com/Gyanthakur/Dev_Projects",
            "updatedAt": "2024-12-20T18:33:13Z"
        },
        {
            "name": "WSA_Internship_Project",
            "description": "Food Ordering Website for WSA internship Using MERN",
            "score": 6.215055951192556,
            "stars": 6,
            "forks": 3,
            "language": "JavaScript",
            "url": "https://github.com/Gyanthakur/WSA_Internship_Project",
            "updatedAt": "2024-11-14T08:46:06Z"
        },
        {
            "name": "CureConnect",
            "description": "CureConnect is a healthcare appointment booking platform that connects patients with doctors. Admin URL https://cureconnect-admin.onrender.com/",
            "score": 5.226128431490893,
            "stars": 4,
            "forks": 2,
            "language": "JavaScript",
            "url": "https://github.com/Gyanthakur/CureConnect",
            "updatedAt": "2024-12-20T19:06:10Z"
        },
        {
            "name": "Gyanthakur",
            "description": "Hi, I'm Gyan Pratap Singh!",
            "score": 4.855217195722742,
            "stars": 5,
            "forks": 1,
            "language": null,
            "url": "https://github.com/Gyanthakur/Gyanthakur",
            "updatedAt": "2024-12-19T16:55:05Z"
        }
    ],
    "followers": 111,
    "following": 8,
    "public_repos": 118,
    "pull_requests_merged": 203,
    "issues_closed": 40,
    "achievements": {
        "total_contributions": 1478,
        "repositories_contributed_to": 2
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/gyan-pratap-singh-275785236/"
        },
        {
            "provider": "instagram",
            "url": "https://www.instagram.com/gp.singh.ro.ckstar4438/"
        },
        {
            "provider": "facebook",
            "url": "https://www.facebook.com/profile.php?id=100026766931684"
        },
        {
            "provider": "generic",
            "url": "https://notes-store-app.vercel.app/"
        }
    ],
    "activity_summary": {
        "AgriConnect": {
            "link": "https://github.com/Gyanthakur/AgriConnect",
            "summary": "Recent activities in the AgriConnect repository include updates to the README.md file, addition of features such as all merchant and all farmer functionalities, fixes to the toastify feature, and implementation of a login merchant feature, indicating active development and maintenance of the project."
        },
        "Gyanthakur": {
            "link": "https://github.com/Gyanthakur/Gyanthakur",
            "summary": "The Gyanthakur repository has seen recent updates to its README.md file on multiple occasions, suggesting ongoing maintenance and refinement of the project's description and documentation, but lacks significant feature additions or code changes."
        },
        "gyan-pratap-singh-portfolio-v1": {
            "link": "https://github.com/Gyanthakur/gyan-pratap-singh-portfolio-v1",
            "summary": "Activity in the gyan-pratap-singh-portfolio-v1 repository is primarily focused on updates to the README.md file, with multiple pushes occurring on the same day, indicating a focus on refining the project's documentation and description."
        },
        "JobLoom-portal": {
            "link": "https://github.com/Gyanthakur/JobLoom-portal",
            "summary": "The JobLoom-portal repository has shown recent activity with updates to its README.md file, suggesting efforts to maintain and possibly expand the project, but the scope of these updates is limited to documentation at this time."
        },
        "yourcss_contribution": {
            "link": "https://github.com/Gyanthakur/yourcss_contribution",
            "summary": "Activity in the yourcss_contribution repository is constrained to updates of the README.md file, indicating a focus on project documentation, but lacks diverse contributions such as code additions or feature implementations."
        }
    },
    "profile_summary": "Gyan Pratap Singh is a highly skilled web developer with a strong foundation in programming languages such as C++, JavaScript, and TypeScript. With a proven track record of creating interactive applications, he demonstrates expertise in React, Next.js, and Node.js, showcasing his ability to build dynamic and engaging web experiences. As a dedicated open-source enthusiast, he collaborates with others to drive innovation and Knowledge sharing. With a professional network of over 111 followers and a portfolio of 118 public repositories, Gyan has established himself as a reliable and proficient developer who consistently delivers high-quality work.\n\nAs a passionate and innovative web developer, Gyan Pratap Singh brings a unique value proposition to the table, combining technical expertise with a passion for collaboration and knowledge sharing. With his expertise in web development and commitment to open-source principles, he is well-positioned to drive projects forward and contribute to the growth of the web development community. By leveraging his technical skills and industry knowledge, Gyan delivers interactive and engaging web applications that meet the needs of users, making him a valuable asset to any development team or project. His dedication to his craft and passion for innovation make him a standout professional in the field of web development."
}