{
    "username": "hamzashaheempv",
    "name": "Hamza Shaheem P V",
    "bio": "CSE Student at APJAKTU",
    "location": "Kerala",
    "avatar_url": "https://avatars.githubusercontent.com/u/75874557?u=3d1a6551675be09bee2049bdc6aca4a40fdd0b86&v=4",
    "profile_url": "https://github.com/HamzaShaheemPv",
    "top_languages": [],
    "top_projects": [
        {
            "name": "HamzaShaheemPv",
            "description": "Config files for my GitHub profile.",
            "score": 0.07566585240412206,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/HamzaShaheemPv/HamzaShaheemPv",
            "updatedAt": "2022-12-14T12:53:39Z"
        },
        {
            "name": "test",
            "description": "Testdescription",
            "score": 0.06960036167572557,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/HamzaShaheemPv/test",
            "updatedAt": "2021-05-16T08:22:05Z"
        }
    ],
    "followers": 9,
    "following": 15,
    "public_repos": 5,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/hamzashaheempv"
        }
    ],
    "profile_summary": "Hamza Shaheem P V is a skilled and dedicated computer science student at APJAKTU, with a strong online presence and a growing professional network of peers and mentors. With a notable following of 9 and an impressive collection of 5 public repositories, he has established himself as an active and talented developer, consistently demonstrating his technical abilities and sharing his knowledge with the community. His expertise in software development, coding, and problem-solving is evident in his work, showcasing his passion for innovation and collaboration.\n\nAs a rising star in the tech industry, Hamza brings a unique set of skills and perspectives to the table, with a strong foundation in computer science and a keen interest in emerging technologies. With a focus on delivering high-quality solutions and driving results, he is poised to make a significant impact in the field, leveraging his technical expertise and creative approach to tackle complex challenges and drive innovation. By combining his technical prowess with a collaborative mindset and a passion for learning, Hamza is well-positioned to succeed in an ever-evolving industry, and his contributions are sure to be valued by peers and employers alike."
}