{
    "username": "har-sha2004",
    "name": "har-sha2004",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/118581228?v=4",
    "profile_url": "https://github.com/har-sha2004",
    "top_languages": [
        [
            "JavaScript",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Netflix",
            "description": null,
            "score": 0.2631374174111478,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/har-sha2004/Netflix",
            "updatedAt": "2024-02-25T12:04:21Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 19,
        "repositories_contributed_to": 1
    },
    "social_accounts": [],
    "profile_summary": "har-sha2004 is a highly skilled and dedicated JavaScript developer, known for delivering innovative, high-quality solutions to drive technical excellence. With expertise in leveraging JavaScript to create cutting-edge applications, har-sha2004 possesses a unique value proposition that combines technical prowess with attention to detail and a passion for continuous learning. By focusing on writing clean, reusable code, har-sha2004 delivers efficiency and scalability to software projects.\n\nThrough a strong portfolio of public repositories, har-sha2004 showcases an unwavering commitment to ongoing development, actively pushing the boundaries of what is possible with JavaScript. As a skilled problem solver and proficient coder, har-sha2004 is well-positioned to drive impactful projects forward, fostering success through collaboration, adaptability, and a focus on delivering results. With a forward-thinking approach and dedication to staying at the forefront of industry trends, har-sha2004 continues to grow and evolve as a leader in the world of JavaScript development."
}