{
    "username": "hasimpk",
    "name": "Mohamed Hasim P K",
    "bio": "Designer / UI Dev",
    "location": "Kochi, kerala, India",
    "avatar_url": "https://avatars.githubusercontent.com/u/18107674?u=cdcc99b1f2ca08153f5df22e238f565725349ef5&v=4",
    "profile_url": "https://github.com/hasimpk",
    "top_languages": [],
    "top_projects": [
        {
            "name": "hasimpk",
            "description": "Config files for my GitHub profile.",
            "score": 0.0746874845029752,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/hasimpk/hasimpk",
            "updatedAt": "2022-10-10T04:43:33Z"
        }
    ],
    "followers": 4,
    "following": 14,
    "public_repos": 8,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 1359,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/hashimpk_"
        }
    ],
    "profile_summary": "Mohamed Hasim P K is a highly skilled and accomplished designer and UI developer with a strong presence in the development community, evidenced by his growing network of followers and extensive portfolio of public repositories. With a keen eye for design and a deep understanding of user interface development, he brings a unique combination of creativity and technical expertise to his work. His expertise spans a range of areas, including design and development, and he is well-versed in the latest industry trends and technologies.\n\nAs a seasoned designer and UI developer, Mohamed Hasim P K delivers high-quality solutions that meet the evolving needs of users and businesses alike. With a proven track record of successful projects and a commitment to innovation and excellence, he is a trusted partner for companies seeking to elevate their online presence and user experience. His technical prowess, combined with his passion for design and development, makes him a valuable asset to any team, and his expertise is optimized for search with relevant keywords, making him easily discoverable by those seeking top-tier design and development talent."
}