{
    "username": "hostao",
    "name": "Hostao® L.L.C",
    "bio": "Whether you are looking for a personal website hosting plan or a business website hosting plan, We are the perfect solution for you. .in Accredited Registrar",
    "location": "India",
    "avatar_url": "https://avatars.githubusercontent.com/u/68838635?u=62e9406136a118ae41ed9b33a13e72c060db1d53&v=4",
    "profile_url": "https://github.com/HOSTAO",
    "top_languages": [],
    "top_projects": [],
    "followers": 0,
    "following": 4,
    "public_repos": 1,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/Trusted_Host"
        },
        {
            "provider": "facebook",
            "url": "https://www.facebook.com/TrustedWebHost"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/company/hostao"
        },
        {
            "provider": "youtube",
            "url": "https://www.youtube.com/channel/UCN_SMe33cnV9toHs10H1GKg"
        }
    ],
    "profile_summary": "Hostao is a reputable Registrar and innovative web hosting solution provider, delivering cutting-edge services to cater to diverse needs. As a trusted domain registrar and web hosting expert, they specialize in providing secure, reliable, and efficient hosting solutions for personal and business websites. With a strong foundation in web hosting, Hostao continuously strives to improve and expand their expertise to meet evolving demands, ensuring seamless experiences for clients.\n\nDriven by a passion for web development and a commitment to excellence, Hostao leverages their technical expertise to build innovative solutions. As an accredited Registrar, they bring a professional approach to web hosting, empowering clients to grow and succeed online. With a solid track record of reliability and customer satisfaction, Hostao aims to set new standards for web hosting and domain registration, solidifying their position as a trusted partner in the digital landscape."
}