{
    "username": "hussbtwyt",
    "name": "hussbtwyt",
    "bio": "Hi there👋, I am a young developer who is very interested in looking to collaborate with others, mainly in Python Web Development Projects.",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/121028340?v=4",
    "profile_url": "https://github.com/HussBTWYT",
    "top_languages": [
        [
            "Python",
            4
        ]
    ],
    "top_projects": [
        {
            "name": "JokeAPI-Video-Creator",
            "description": "A TikTok-Inspired Python Tool to create jokes for a video.",
            "score": 3.471618325502351,
            "stars": 4,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/HussBTWYT/JokeAPI-Video-Creator",
            "updatedAt": "2024-02-17T18:15:44Z"
        },
        {
            "name": "Password-Generator",
            "description": "This repository is a password generator which its logic was programmed in Python, and can be run using main.py locally. For web preview uses, use the main.py file and make sure you have all packages in requirement.txt installed. This project is Open-Source and Free-To-Use. ",
            "score": 1.55139848202232,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/HussBTWYT/Password-Generator",
            "updatedAt": "2023-12-11T20:36:54Z"
        },
        {
            "name": "HussBTWYT",
            "description": null,
            "score": 0.24765618135364398,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/HussBTWYT/HussBTWYT",
            "updatedAt": "2024-11-07T17:21:51Z"
        },
        {
            "name": "JokeAPI",
            "description": "An API to connect to for funny jokes to be passed.",
            "score": 0.1684200256571097,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/HussBTWYT/JokeAPI",
            "updatedAt": "2023-12-10T23:14:52Z"
        },
        {
            "name": "Speech-Recognition",
            "description": "A module which defines the input being based on the microphone, programmed in Python.",
            "score": 0.16510412090242932,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/HussBTWYT/Speech-Recognition",
            "updatedAt": "2023-10-23T19:10:11Z"
        }
    ],
    "followers": 1,
    "following": 0,
    "public_repos": 5,
    "pull_requests_merged": 0,
    "issues_closed": 1,
    "achievements": {
        "total_contributions": 1,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "activity_summary": {
        "HussBTWYT/HussBTWYT": {
            "link": "https://github.com/HussBTWYT/HussBTWYT",
            "summary": "Recent activities in the HussBTWYT/HussBTWYT repository include a push event that occurred on November 7, 2024, which involved updating the README.md file to improve repository documentation and clarity."
        }
    },
    "profile_summary": "Hussbtwyt is a skilled Python developer with a strong passion for collaborating on innovative web development projects. With a solid foundation in Python programming, he brings a unique perspective and expertise to the table, leveraging his technical skills to drive project success. As a young and ambitious developer, he is committed to delivering high-quality solutions that meet the evolving needs of the industry. His professional network is growing, with a notable following of like-minded professionals who appreciate his technical abilities and collaborative spirit.\n\nAs an active developer with a portfolio of five public repositories, hussbtwyt demonstrates his ability to design, develop, and deploy effective web applications using Python. His expertise in Python web development makes him a valuable asset to any project team, and his enthusiasm for collaboration ensures that he is always open to new ideas and approaches. With a strong focus on reliability, innovation, and technical excellence, hussbtwyt is poised to make a significant impact in the world of Python web development, and his professional profile is a testament to his skills, dedication, and passion for the field."
}