{
    "username": "kgs-cjburns",
    "name": "C Burns",
    "bio": "Senior IT Technician @KingstonGrammarSchool ",
    "location": "Kingston upon Thames",
    "avatar_url": "https://avatars.githubusercontent.com/u/37700458?u=2dff74c1d9f8fe8f97df171edde5d1ab5341ed60&v=4",
    "profile_url": "https://github.com/KGS-CJBurns",
    "top_languages": [],
    "top_projects": [],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/KGS1561"
        },
        {
            "provider": "instagram",
            "url": "https://www.instagram.com/kgs1561/"
        },
        {
            "provider": "facebook",
            "url": "https://www.facebook.com/KingstonGrammar/"
        }
    ],
    "profile_summary": "C Burns is a highly skilled and experienced IT professional, currently serving as a Senior IT Technician at Kingston Grammar School. With a strong foundation in computer systems and network administration, C Burns possesses a unique blend of technical expertise and practical knowledge. As a seasoned developer, C Burns has established a notable presence in the IT community, with a growing portfolio of public repositories that demonstrate a commitment to active development and innovation. \n\nAs a dedicated and results-driven IT expert, C Burns brings a high level of professionalism and expertise to every project, leveraging a deep understanding of computer systems and network administration to drive success. With a focus on delivering high-quality solutions and exceptional customer service, C Burns has earned a reputation as a reliable and skilled technician, well-versed in the latest technologies and trends. With a strong passion for innovation and a commitment to staying up-to-date with the latest developments in the field, C Burns is an invaluable asset to any organization, poised to make a lasting impact in the world of IT."
}