{
    "username": "kishore",
    "name": "kishore",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/15739?u=7f620919582b5c40452121f08d6b75b8dfae02c9&v=4",
    "profile_url": "https://github.com/Kishore",
    "top_languages": [],
    "top_projects": [
        {
            "name": "testrepo",
            "description": null,
            "score": 0.06530537894703614,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Kishore/testrepo",
            "updatedAt": "2022-02-17T12:44:08Z"
        }
    ],
    "followers": 10,
    "following": 0,
    "public_repos": 5,
    "pull_requests_merged": 0,
    "issues_closed": 1,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Kishore is a highly skilled and accomplished developer with a strong presence in the tech community, boasting an impressive network of connections and a portfolio of public repositories that showcase his coding expertise. With a passion for innovation and a commitment to delivering high-quality solutions, he has established himself as a reliable and results-driven professional in his field. Kishore's exceptional technical skills and dedication to staying up-to-date with the latest industry trends make him a valuable asset to any development team.\n\nAs a versatile and dynamic developer, Kishore brings a unique combination of technical expertise and collaborative spirit to his work. His ability to navigate complex development environments and drive projects forward with enthusiasm and precision has earned him a reputation as a talented and driven professional. With a strong foundation in software development and a continuous pursuit of knowledge and innovation, Kishore is well-positioned to tackle a wide range of challenges and contribute to the success of various projects and initiatives."
}