{
    "username": "lsxprime",
    "name": "Ahmed Abdallah",
    "bio": "Jobless Reincarnation...but not Rudeus Greyrat.",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/99611810?u=99c22578101339555de397aa7075b51b4f4d9854&v=4",
    "profile_url": "https://github.com/LSXPrime",
    "top_languages": [
        [
            "C#",
            10
        ],
        [
            "Dart",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Aegis",
            "description": "Aegis is a robust and flexible .NET licensing library that simplifies the implementation of various licensing models for your applications. It offers strong security features, both online and offline validation, and easy integration with your existing projects. Securely manage your software licenses with Aegis.",
            "score": 14.199198166196325,
            "stars": 199,
            "forks": 8,
            "language": "C#",
            "url": "https://github.com/LSXPrime/Aegis",
            "updatedAt": "2024-12-23T03:06:08Z"
        },
        {
            "name": "Octagrm",
            "description": "a social media platform built with ASP.NET Core 8 Web API, inspired by Instagram. Octagram provides features like user authentication, post creation, liking, commenting, following, stories, real-time messaging, notifications, and more.",
            "score": 11.87501069628459,
            "stars": 68,
            "forks": 7,
            "language": "C#",
            "url": "https://github.com/LSXPrime/Octagrm",
            "updatedAt": "2024-12-06T16:51:09Z"
        },
        {
            "name": "Hermes",
            "description": "Hermes is a robust e-commerce platform built with .NET 8, offering comprehensive product, order, and user management. Key features include product creation & management with variants, order tracking and status updates, user registration & authentication, and inventory control. It leverages a layered architecture for clean code and testability.",
            "score": 10.917345202054399,
            "stars": 46,
            "forks": 6,
            "language": "C#",
            "url": "https://github.com/LSXPrime/Hermes",
            "updatedAt": "2024-12-14T14:55:04Z"
        },
        {
            "name": "RIWebServer",
            "description": "RIWebServer is a lightweight, cross-platform web server made in C#. It’s simple to use and expand, great for whipping up web apps quickly. It’s not exactly groundbreaking, but I had some free time, so I made it.",
            "score": 7.414641979112957,
            "stars": 20,
            "forks": 1,
            "language": "C#",
            "url": "https://github.com/LSXPrime/RIWebServer",
            "updatedAt": "2024-09-23T21:06:24Z"
        },
        {
            "name": "LibLoader",
            "description": "Cross-platform native library loader for .NET, simplifying the process of loading and interacting with native libraries (DLLs, SOs, dylibs) in your C# applications.  It supports dependency management, flexible loading options (local files, embedded resources, remote URLs), and provides a clean, fluent API for configuration and function calling.",
            "score": 6.847605057890674,
            "stars": 14,
            "forks": 1,
            "language": "C#",
            "url": "https://github.com/LSXPrime/LibLoader",
            "updatedAt": "2024-11-11T00:10:35Z"
        },
        {
            "name": "EGOIST",
            "description": "AI Hub that unifies voice, text, and image AI models, simplifying user interaction while reducing storage needs. By automating tasks, it offers a seamless, all-in-one solution for diverse AI functionalities, streamlining accessibility and usage.",
            "score": 5.53131101862044,
            "stars": 13,
            "forks": 0,
            "language": "C#",
            "url": "https://github.com/LSXPrime/EGOIST",
            "updatedAt": "2024-12-06T16:53:34Z"
        },
        {
            "name": "NovelNode",
            "description": "A visual novel creator tool empowering developers to craft immersive narrative experiences with ease. Utilize a node-based editor to manage characters, dialogues, scenes, and events seamlessly. Export projects to Unity or NOVEL NODE PLAYER for standalone playback",
            "score": 4.663279375270956,
            "stars": 8,
            "forks": 0,
            "language": "C#",
            "url": "https://github.com/LSXPrime/NovelNode",
            "updatedAt": "2024-12-04T09:24:23Z"
        },
        {
            "name": "NovelNodePlayer",
            "description": "Integrate NOVEL NODE visual novels into Unity for immersive storytelling, enhancing player engagement in game narratives",
            "score": 2.466054797934736,
            "stars": 2,
            "forks": 0,
            "language": "C#",
            "url": "https://github.com/LSXPrime/NovelNodePlayer",
            "updatedAt": "2024-04-13T12:48:31Z"
        }
    ],
    "followers": 26,
    "following": 0,
    "public_repos": 16,
    "pull_requests_merged": 6,
    "issues_closed": 6,
    "achievements": {
        "total_contributions": 33,
        "repositories_contributed_to": 3
    },
    "social_accounts": [
        {
            "provider": "facebook",
            "url": "https://www.facebook.com/LSXAxeller"
        },
        {
            "provider": "generic",
            "url": "https://www.artstation.com/lsxaxeller"
        }
    ],
    "activity_summary": {
        "Aegis": {
            "link": "https://github.com/LSXPrime/Aegis",
            "summary": "Recent activities in the Aegis repository include enhancements to serialization and hardware identification, as well as cleanup efforts for the v1.2.0 release. Notably, the Serialization Improvements feature was added, and unused properties such as EncryptionKey were removed, showcasing ongoing development and refinement."
        },
        "bark.cpp": {
            "link": "https://github.com/PABannier/bark.cpp",
            "summary": "The bark.cpp repository saw significant activity with a pull request submitted to fix a DivideByZeroException by calling ggml_time_init() before the ggml_time_us() function, preventing potential errors and improving overall stability."
        }
    },
    "profile_summary": "Ahmed Abdallah is a highly skilled and accomplished software developer with a strong proficiency in C# and Dart. With a proven track record of delivering high-quality solutions, he has established himself as a reliable and innovative professional in the field of software development. His expertise in these programming languages enables him to design, develop, and implement efficient and scalable software applications. As a dedicated and passionate developer, Ahmed Abdallah is committed to staying up-to-date with the latest industry trends and technologies, ensuring that his skills remain relevant and effective.\n\nWith a network of 26 followers and a portfolio of 16 public repositories, Ahmed Abdallah has demonstrated his ability to collaborate with others and share his knowledge and expertise with the development community. His bio, which humorously references the popular anime series Jobless Reincarnation, suggests a creative and lighthearted approach to his work. As a skilled and experienced developer, Ahmed Abdallah is well-equipped to contribute to a wide range of software development projects, from mobile and web applications to enterprise-level systems. His technical expertise, combined with his passion for innovation and collaboration, makes him a valuable asset to any development team, and his online presence is a testament to his commitment to his craft and his desire to connect with like-minded professionals."
}