{
    "username": "m1dlj",
    "name": null,
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/150415027?v=4",
    "profile_url": "https://github.com/m1dlj",
    "top_languages": [
        [
            "JavaScript",
            1
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "meme-generator",
            "description": null,
            "score": 1.7106205919015207,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/m1dlj/meme-generator",
            "updatedAt": "2024-09-17T18:04:40Z"
        },
        {
            "name": "Stag-Men-Fashion",
            "description": "First frontend project in learning",
            "score": 1.6429878835697518,
            "stars": 1,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/m1dlj/Stag-Men-Fashion",
            "updatedAt": "2024-09-01T10:41:43Z"
        },
        {
            "name": "m1dlj",
            "description": "Config files for my GitHub profile.",
            "score": 0.2566935224498611,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/m1dlj/m1dlj",
            "updatedAt": "2024-09-11T04:31:55Z"
        }
    ],
    "followers": 2,
    "following": 5,
    "public_repos": 3,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 8,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "This developer is a skilled and accomplished professional with a strong background in JavaScript and HTML, consistently delivering high-quality solutions that showcase technical expertise and innovative thinking. With a growing professional network of followers and a portfolio of public repositories, this individual demonstrates a commitment to collaboration, open-source development, and community engagement. By leveraging expertise in JavaScript and HTML, this developer creates dynamic, user-friendly, and efficient applications that meet the needs of modern web development.\n\nAs a seasoned developer with a proven track record of active development and public repositories, this professional brings a unique value proposition to the table, combining technical proficiency with a passion for innovative problem-solving. With expertise in key areas of web development, this individual is well-positioned to drive projects forward, collaborate with others, and contribute to the growth and success of organizations in the tech industry. By emphasizing reliability, technical prowess, and a customer-centric approach, this developer establishes themselves as a trusted and skilled partner for businesses and individuals seeking high-quality web development solutions."
}