{
    "username": "m1rshad",
    "name": "Abdulla Mirshad",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/150795259?u=e6c314d0401e2c425952cf26fd73485875ac059f&v=4",
    "profile_url": "https://github.com/M1rshad",
    "top_languages": [
        [
            "JavaScript",
            3
        ],
        [
            "Python",
            1
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Notely",
            "description": null,
            "score": 0.3554917077553708,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/M1rshad/Notely",
            "updatedAt": "2024-10-20T15:41:04Z"
        },
        {
            "name": "User-Management",
            "description": null,
            "score": 0.33334743242371556,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/M1rshad/User-Management",
            "updatedAt": "2024-10-22T21:06:52Z"
        },
        {
            "name": "M1rshad",
            "description": null,
            "score": 0.32501859800329747,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/M1rshad/M1rshad",
            "updatedAt": "2024-10-21T08:11:37Z"
        },
        {
            "name": "React-Netflix-Clone",
            "description": "A Netflix-inspired streaming platform clone built with React. Features include browsing movies and TV shows, video playback, and a responsive design.",
            "score": 0.2897906895081508,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/M1rshad/React-Netflix-Clone",
            "updatedAt": "2024-08-10T15:04:43Z"
        },
        {
            "name": "React-OLX-Clone",
            "description": "An OLX-inspired classifieds platform clone built with React and Firebase. Features include user authentication, listing management and real-time updates.",
            "score": 0.28284249651958554,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/M1rshad/React-OLX-Clone",
            "updatedAt": "2024-08-11T10:34:23Z"
        },
        {
            "name": "Urbanwrap",
            "description": "A modern fashion e-commerce platform offering trendy urban clothing and accessories, built with Django and Bootstrap.",
            "score": 0.25759714536400297,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/M1rshad/Urbanwrap",
            "updatedAt": "2024-10-21T08:10:10Z"
        }
    ],
    "followers": 1,
    "following": 0,
    "public_repos": 6,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 217,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "activity_summary": {
        "M1rshad/Notely": {
            "link": "https://github.com/M1rshad/Notely",
            "summary": "Recent activities in the Notely repository include significant updates to the frontend and backend, such as the addition of loaders, authentication, and private routes. The repository also saw improvements to note editing, searching, and deletion, as well as the implementation of JWT authentication and user registration. Multiple push events have been made in the past few weeks, indicating active development and refinement of the project's features."
        },
        "M1rshad/User-Management": {
            "link": "https://github.com/M1rshad/User-Management",
            "summary": "The User-Management repository has seen substantial activity, with recent updates focusing on user management, login, and admin panel functionality. Changes include the addition of user deletion, editing, and password change features, as well as improvements to the admin panel and login system. These updates demonstrate ongoing efforts to enhance the repository's user management capabilities and overall user experience."
        }
    },
    "profile_summary": "Abdulla Mirshad is a skilled and innovative developer with a strong foundation in JavaScript, Python, and HTML. He has established himself as a proficient programmer, delivering high-quality solutions that meet the needs of his clients. With a growing professional network, Abdulla has garnered a notable following, demonstrating his influence and reputation within the development community. His expertise in programming languages and web development enables him to create efficient, scalable, and user-friendly applications.\n\nAs an active developer, Abdulla has contributed to numerous public repositories, showcasing his commitment to collaborative development and open-source initiatives. His experience in developing and maintaining repositories has honed his skills in version control, bug fixing, and code optimization. With a strong online presence, Abdulla is well-positioned to leverage his technical expertise and professional network to drive innovative solutions and deliver exceptional results. His dedication to staying up-to-date with industry trends and best practices ensures that his work remains relevant, reliable, and of high quality, making him a valuable asset to any development team."
}