{
    "username": "maryammohamedyahya",
    "name": null,
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/147263523?v=4",
    "profile_url": "https://github.com/MaryamMohamedYahya",
    "top_languages": [
        [
            "TypeScript",
            1
        ],
        [
            "Python",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "skills-communicate-using-markdown",
            "description": "My clone repository",
            "score": 0.28391863668643885,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/skills-communicate-using-markdown",
            "updatedAt": "2024-06-16T12:19:07Z"
        },
        {
            "name": "Amico",
            "description": null,
            "score": 0.2743203185926573,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/MaryamMohamedYahya/Amico",
            "updatedAt": "2024-05-07T17:04:38Z"
        },
        {
            "name": "Todo",
            "description": null,
            "score": 0.2738993852101801,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/MaryamMohamedYahya/Todo",
            "updatedAt": "2024-05-07T11:08:30Z"
        },
        {
            "name": "Trial",
            "description": null,
            "score": 0.26237410037930087,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/Trial",
            "updatedAt": "2024-03-02T03:20:26Z"
        }
    ],
    "followers": 1,
    "following": 0,
    "public_repos": 15,
    "pull_requests_merged": 10,
    "issues_closed": 3,
    "achievements": {
        "total_contributions": 315,
        "repositories_contributed_to": 12
    },
    "social_accounts": [],
    "activity_summary": {
        "MaryamMohamedYahya/Top-100-Coders": {
            "link": "https://github.com/MaryamMohamedYahya/Top-100-Coders",
            "summary": "Recent activities in the Top-100-Coders repository include multiple updates to the profile and creation of new files, reflecting ongoing efforts to maintain and expand the repository's contents."
        },
        "GSSoC24/Hack-Web3Conf": {
            "link": "https://github.com/GSSoC24/Hack-Web3Conf",
            "summary": "The Hack-Web3Conf repository has seen a recent pull request titled 'Postman Challenge', indicating collaboration and potential integration with external challenges or projects, contributing to the repository's development and community engagement."
        },
        "MaryamMohamedYahya/Hack-Web3Conf": {
            "link": "https://github.com/MaryamMohamedYahya/Hack-Web3Conf",
            "summary": "Activity in the Hack-Web3Conf repository involves adding files via upload, with a reference to an external pull request, suggesting active participation in related projects and challenges, such as the Postman Challenge."
        },
        "GSSoC24/Postman-Challenge": {
            "link": "https://github.com/GSSoC24/Postman-Challenge",
            "summary": "The Postman-Challenge repository has experienced updates, including a pull request aimed at updating the add-your-certificate.md file by adding a name, indicating participant engagement and the repository's role in tracking progresses or achievements in challenges."
        },
        "MaryamMohamedYahya/Postman-Challenge": {
            "link": "https://github.com/MaryamMohamedYahya/Postman-Challenge",
            "summary": "Activities in the Postman-Challenge repository include updates to the add-your-certificate.md file, specifically adding a name, reflecting individual progress or participation in challenges or projects related to the Postman Challenge."
        }
    },
    "profile_summary": "This developer is a highly skilled and accomplished professional with a strong background in programming languages such as TypeScript and Python. With a demonstrated ability to design, develop, and deploy innovative software solutions, they possess a unique combination of technical expertise and creative problem-solving skills. As an active member of the development community, they have built a professional network of peers and have made significant contributions to the open-source community through their public repositories.\n\nAs a seasoned developer with a portfolio of 15 public repositories, they have consistently demonstrated their ability to deliver high-quality code and collaborate with others to achieve common goals. With a growing professional network of like-minded individuals, they are well-positioned to leverage their skills and expertise to drive innovation and growth in the tech industry. By leveraging their expertise in TypeScript and Python, they are able to develop efficient, scalable, and reliable software solutions that meet the evolving needs of businesses and organizations, making them a valuable asset to any team or project."
}