{
    "username": "maryammohamedyahya",
    "name": "maryammohamedyahya",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/147263523?v=4",
    "profile_url": "https://github.com/MaryamMohamedYahya",
    "top_languages": [
        [
            "TypeScript",
            1
        ],
        [
            "Python",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "skills-communicate-using-markdown",
            "description": "My clone repository",
            "score": 0.28559061529244567,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/skills-communicate-using-markdown",
            "updatedAt": "2024-06-16T12:19:07Z"
        },
        {
            "name": "Amico",
            "description": null,
            "score": 0.2756128029460251,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/MaryamMohamedYahya/Amico",
            "updatedAt": "2024-05-07T17:04:38Z"
        },
        {
            "name": "Todo",
            "description": null,
            "score": 0.2753942218332271,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/MaryamMohamedYahya/Todo",
            "updatedAt": "2024-05-07T11:08:30Z"
        },
        {
            "name": "Trial",
            "description": null,
            "score": 0.26344758823084113,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/Trial",
            "updatedAt": "2024-03-02T03:20:26Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 15,
    "pull_requests_merged": 10,
    "issues_closed": 3,
    "achievements": {
        "total_contributions": 152,
        "repositories_contributed_to": 12
    },
    "social_accounts": [],
    "activity_summary": {
        "MaryamMohamedYahya/Top-100-Coders": {
            "link": "https://github.com/MaryamMohamedYahya/Top-100-Coders",
            "summary": "Recent activities in the Top-100-Coders repository include multiple push events with updates to the profile and creation of new files, indicating ongoing development and maintenance efforts."
        },
        "GSSoC24/Hack-Web3Conf": {
            "link": "https://github.com/GSSoC24/Hack-Web3Conf",
            "summary": "The Hack-Web3Conf repository saw a recent pull request event related to the Postman Challenge, suggesting collaborative work and contributions to the project."
        },
        "MaryamMohamedYahya/Hack-Web3Conf": {
            "link": "https://github.com/MaryamMohamedYahya/Hack-Web3Conf",
            "summary": "Activity in the Hack-Web3Conf repository involved a push event with file uploads, which appears to be related to the Postman Challenge, indicating active participation in the challenge."
        },
        "GSSoC24/Postman-Challenge": {
            "link": "https://github.com/GSSoC24/Postman-Challenge",
            "summary": "The Postman-Challenge repository received a pull request to update the add-your-certificate.md file, adding a name, which suggests that participants are engaged in the challenge and contributing to the repository."
        },
        "MaryamMohamedYahya/Postman-Challenge": {
            "link": "https://github.com/MaryamMohamedYahya/Postman-Challenge",
            "summary": "In the Postman-Challenge repository, there was a push event updating the add-your-certificate.md file with the addition of a name, demonstrating progress and engagement with the challenge."
        }
    },
    "profile_summary": "Maryammohamedyahya is a highly skilled and innovative software developer with a strong foundation in programming languages such as TypeScript and Python. With a portfolio of 15 public repositories, she demonstrates a high level of productivity and commitment to collaborative development. Her technical expertise and attention to detail enable her to deliver high-quality solutions that meet the needs of clients and users. As a dedicated and results-driven professional, she is well-equipped to tackle complex projects and contribute to the success of any organization.\n\nWith a keen eye for detail and a passion for staying up-to-date with the latest industry trends, Maryammohamedyahya is a valuable asset to any development team. Her expertise in TypeScript and Python makes her a versatile and adaptable developer, capable of working on a wide range of projects, from backend development to data analysis. As she continues to grow her professional network and expand her influence, Maryammohamedyahya is poised to make a significant impact in the world of software development, delivering innovative solutions and driving technological advancements in her field."
}