{
    "username": "maryammohamedyahya",
    "name": null,
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/147263523?v=4",
    "profile_url": "https://github.com/MaryamMohamedYahya",
    "top_languages": [
        [
            "TypeScript",
            1
        ],
        [
            "Python",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "skills-communicate-using-markdown",
            "description": "My clone repository",
            "score": 0.2850253285215969,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/skills-communicate-using-markdown",
            "updatedAt": "2024-06-16T12:19:07Z"
        },
        {
            "name": "Amico",
            "description": null,
            "score": 0.2751769250533908,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/MaryamMohamedYahya/Amico",
            "updatedAt": "2024-05-07T17:04:38Z"
        },
        {
            "name": "Todo",
            "description": null,
            "score": 0.27474613157243294,
            "stars": 0,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/MaryamMohamedYahya/Todo",
            "updatedAt": "2024-05-07T11:08:30Z"
        },
        {
            "name": "Trial",
            "description": null,
            "score": 0.26298338105721913,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/MaryamMohamedYahya/Trial",
            "updatedAt": "2024-03-02T03:20:26Z"
        }
    ],
    "followers": 1,
    "following": 0,
    "public_repos": 15,
    "pull_requests_merged": 10,
    "issues_closed": 3,
    "achievements": {
        "total_contributions": 309,
        "repositories_contributed_to": 12
    },
    "social_accounts": [],
    "activity_summary": {
        "MaryamMohamedYahya/Top-100-Coders": {
            "link": "https://github.com/MaryamMohamedYahya/Top-100-Coders",
            "summary": "Recent activities in the Top-100-Coders repository include multiple push events, resulting in the creation and update of various files such as user profiles and code documentation, with changes made between November 8 and November 9, 2024."
        },
        "GSSoC24/Hack-Web3Conf": {
            "link": "https://github.com/GSSoC24/Hack-Web3Conf",
            "summary": "The Hack-Web3Conf repository experienced a notable pull request event on November 10, 2024, related to a Postman Challenge, indicating active collaboration and potential integration of new web3 conference features."
        },
        "GSSoC24/Postman-Challenge": {
            "link": "https://github.com/GSSoC24/Postman-Challenge",
            "summary": "In the Postman-Challenge repository, a pull request was initiated on November 9, 2024, aiming to update the add-your-certificate.md file by adding a contributor's name, demonstrating ongoing community engagement and certificate updates."
        },
        "MaryamMohamedYahya/Hack-Web3Conf": {
            "link": "https://github.com/MaryamMohamedYahya/Hack-Web3Conf",
            "summary": "The Hack-Web3Conf repository, hosted under MaryamMohamedYahya, saw a push event on November 10, 2024, where files were added via upload, referencing an external pull request from the GSSoC24 Postman-Challenge, indicating integration of challenge solutions."
        },
        "MaryamMohamedYahya/Postman-Challenge": {
            "link": "https://github.com/MaryamMohamedYahya/Postman-Challenge",
            "summary": "Within the Postman-Challenge repository under MaryamMohamedYahya, an update was made on November 9, 2024, to the add-your-certificate.md file, where the contributor added their name, mirroring the update seen in the GSSoC24 Postman-Challenge, showcasing personal progress in the challenge."
        }
    },
    "profile_summary": "This skilled developer is a proficient programmer with strong expertise in TypeScript and Python, utilizing these technologies to drive innovative solutions and deliver high-quality results. With a growing professional network and a single but significant follower, this individual has established a foundation for collaboration and influence within the development community. Their notable presence on GitHub is marked by an impressive collection of 15 public repositories, showcasing a commitment to active development, transparency, and community engagement.\n\nAs a dedicated and results-driven professional, this developer brings a unique combination of technical expertise and passion for innovation to the table. By leveraging their proficiency in TypeScript and Python, they consistently produce cutting-edge solutions that meet the evolving needs of the industry. With a strong foundation in software development and a proven track record of delivering successful projects, this developer is poised to make a lasting impact in the tech landscape, driving growth, and excellence through their work."
}