{
    "username": "mcblair",
    "name": "Matt Blair",
    "bio": "The DevOp",
    "location": "Portland, OR",
    "avatar_url": "https://avatars.githubusercontent.com/u/12667624?u=4c3ac6d56333b7925a2315f09509b61a20c16f97&v=4",
    "profile_url": "https://github.com/mcblair",
    "top_languages": [
        [
            "Go",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "configure-aws-profile-action",
            "description": null,
            "score": 10.262294650573761,
            "stars": 28,
            "forks": 8,
            "language": null,
            "url": "https://github.com/mcblair/configure-aws-profile-action",
            "updatedAt": "2024-12-17T14:47:07Z"
        },
        {
            "name": "configure-aws-profiles",
            "description": null,
            "score": 0.3874766502109932,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/mcblair/configure-aws-profiles",
            "updatedAt": "2024-12-10T07:06:04Z"
        },
        {
            "name": "dagger-repro",
            "description": null,
            "score": 0.36067376022224085,
            "stars": 0,
            "forks": 0,
            "language": "Go",
            "url": "https://github.com/mcblair/dagger-repro",
            "updatedAt": "2024-10-20T21:41:22Z"
        }
    ],
    "followers": 4,
    "following": 4,
    "public_repos": 5,
    "pull_requests_merged": 2,
    "issues_closed": 15,
    "achievements": {
        "total_contributions": 1808,
        "repositories_contributed_to": 1
    },
    "social_accounts": [],
    "activity_summary": {
        "mcblair/configure-aws-profiles": {
            "link": "https://github.com/mcblair/configure-aws-profiles",
            "summary": "Recent activities include multiple push events to improve the repository's functionality. Notably, an update removed unnecessary wiping of AWS environment variables and verified credentials with a region, enhancing the overall configuration process. Other commits focused on safer concurrency and directory management."
        },
        "pulumi/pulumi": {
            "link": "https://github.com/pulumi/pulumi",
            "summary": "A significant recent activity is a pull request event aimed at supporting the `--clear-pending-creates` option for the `refresh` command within the Go Automation API. This contribution aligns with and further fulfills issue #11336, indicating ongoing development and refinement of Pulumi's capabilities."
        },
        "Tallied-Technologies/terraform-provider-basistheory": {
            "link": "https://github.com/Tallied-Technologies/terraform-provider-basistheory",
            "summary": "The repository saw a recent push event involving a rename operation, suggesting ongoing refinement and maintenance of the Terraform provider for BasisTheory. Although the activity is not extensively detailed, it indicates that the repository is being actively updated and managed."
        }
    },
    "profile_summary": "Matt Blair, also known as The DevOp, is a highly skilled developer with a strong focus on Go programming language. With a growing professional network of followers and a portfolio of public repositories, Matt demonstrates his commitment to collaborative development and open-source innovation. As a seasoned expert in his field, Matt possesses a unique blend of technical expertise and DevOps knowledge, allowing him to bridge the gap between development and operations. His proficiency in Go enables him to build scalable, efficient, and reliable systems that meet the demands of modern software development.\n\nAs a dedicated and innovative professional, Matt Blair brings a high level of technical expertise and passion to his work. With a strong track record of active development and a reputation for reliability, Matt is an asset to any project or organization. His expertise in Go and DevOps makes him an ideal candidate for companies seeking to leverage the latest technologies and methodologies to drive innovation and growth. With his strong online presence and growing influence, Matt is well-positioned to collaborate with other developers and contribute to the advancement of the Go programming language and the broader developer community."
}