{
    "username": "mihan786chistie",
    "name": "Syed Md Mihan Chistie",
    "bio": "Kimi no Na wa.",
    "location": "Bangalore, Karnataka",
    "avatar_url": "https://avatars.githubusercontent.com/u/42113027?u=3d4af1887a30d24cb97a20c94813fc18c061d040&v=4",
    "profile_url": "https://github.com/Mihan786Chistie",
    "top_languages": [
        [
            "Python",
            8
        ],
        [
            "TypeScript",
            2
        ],
        [
            "JavaScript",
            5
        ]
    ],
    "top_projects": [
        {
            "name": "CoronaCounter",
            "description": "It's a script which scrapes every possible data of the Coronavirus Outbreak and also calculates some interesting data and prints them at an instant.",
            "score": 2.56009599008049,
            "stars": 1,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/Mihan786Chistie/CoronaCounter",
            "updatedAt": "2023-04-11T14:14:15Z"
        },
        {
            "name": "summarly",
            "description": "Introducing Summarly: your go-to app for quick and easy YouTube video summaries. Summarly automatically extracts and condenses video content into concise, easy-to-read overviews, highlighting key points and takeaways. Perfect for staying informed on the go, Summarly saves you time and helps you get straight to the essentials.",
            "score": 2.495798556907557,
            "stars": 2,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Mihan786Chistie/summarly",
            "updatedAt": "2024-11-21T12:54:02Z"
        },
        {
            "name": "Mihan786Chistie",
            "description": null,
            "score": 1.6403008112909587,
            "stars": 1,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Mihan786Chistie/Mihan786Chistie",
            "updatedAt": "2024-12-26T00:53:56Z"
        },
        {
            "name": "FishDiseaseML",
            "description": null,
            "score": 1.6353211812009505,
            "stars": 1,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/Mihan786Chistie/FishDiseaseML",
            "updatedAt": "2024-07-22T07:13:03Z"
        },
        {
            "name": "ML_Employee_Attrition",
            "description": null,
            "score": 1.55412395560479,
            "stars": 1,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/Mihan786Chistie/ML_Employee_Attrition",
            "updatedAt": "2023-12-12T10:08:52Z"
        },
        {
            "name": "react-spring-movie",
            "description": null,
            "score": 1.5400390866485965,
            "stars": 1,
            "forks": 0,
            "language": "Java",
            "url": "https://github.com/Mihan786Chistie/react-spring-movie",
            "updatedAt": "2023-02-28T09:23:06Z"
        },
        {
            "name": "ApoDSpace_Action",
            "description": "It is a voice-activated application that allows users to fetch and display the Astronomy Picture of the Day from NASA's APOD API. Additionally, users can explore a gallery of previous APODs. This repository contains the code and resources required to create and deploy this Google Assistant Action.",
            "score": 1.5398980965931042,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Mihan786Chistie/ApoDSpace_Action",
            "updatedAt": "2023-08-22T11:48:39Z"
        },
        {
            "name": "potpie-assignment",
            "description": null,
            "score": 0.46600120091970887,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/Mihan786Chistie/potpie-assignment",
            "updatedAt": "2024-12-04T06:01:10Z"
        }
    ],
    "followers": 46,
    "following": 95,
    "public_repos": 66,
    "pull_requests_merged": 17,
    "issues_closed": 1,
    "achievements": {
        "total_contributions": 372,
        "repositories_contributed_to": 5
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/syed-md-mihan-chistie"
        },
        {
            "provider": "twitter",
            "url": "https://twitter.com/mihan2go"
        },
        {
            "provider": "generic",
            "url": "https://hashnode.com/@Mihan786Chistie"
        },
        {
            "provider": "generic",
            "url": "https://bento.me/mihan2go"
        }
    ],
    "activity_summary": {
        "Mihan786Chistie/alai-flask-server": {
            "link": "https://github.com/Mihan786Chistie/alai-flask-server",
            "summary": "Recent activities in the alai-flask-server repository include a push event and a pull request event, both of which involved updates to the app.py file. These activities suggest ongoing development and collaboration on the project, with a focus on refining the application's core functionality."
        },
        "Mihan786Chistie/skill-share": {
            "link": "https://github.com/Mihan786Chistie/skill-share",
            "summary": "The skill-share repository has seen significant activity, including multiple push events and a pull request event. These events indicate a surge in development, with updates and an initial commit, suggesting the project is in its early stages of growth and development."
        },
        "Mihan786Chistie/Mihan786Chistie": {
            "link": "https://github.com/Mihan786Chistie/Mihan786Chistie",
            "summary": "Recent activities in the Mihan786Chistie repository include back-to-back push events focused on updating the README.md file. These updates suggest a refinement of the repository's documentation, potentially aiming to improve user experience or clarify project information."
        },
        "Mihan786Chistie/alai": {
            "link": "https://github.com/Mihan786Chistie/alai",
            "summary": "The alai repository experienced a recent push event that involved an update to the README.md file. This activity indicates a minor but notable adjustment to the project's documentation, possibly reflecting changes in the project's status or goals."
        }
    },
    "profile_summary": "Syed Md Mihan Chistie is a highly skilled software developer with a strong foundation in programming languages such as Python, TypeScript, and JavaScript. With a notable presence on GitHub, he has built a professional network of 46 followers who recognize his technical expertise and innovative approach to software development. His impressive portfolio of 66 public repositories showcases his active involvement in various development projects, demonstrating his ability to design, develop, and deploy high-quality software solutions. As a dedicated developer, Syed Md Mihan Chistie stays up-to-date with the latest industry trends and technologies, ensuring his skills remain current and relevant.\n\nWith a unique value proposition that combines technical expertise with a passion for creative problem-solving, Syed Md Mihan Chistie delivers reliable and efficient software solutions that meet the evolving needs of the industry. His bio, inspired by \"Kimi no Na wa\", reflects his artistic and curious nature, which he applies to his work as a developer. As a seasoned professional with a strong online presence, Syed Md Mihan Chistie is well-equipped to collaborate with other developers, share knowledge, and drive innovation in the field of software development, making him a valuable asset to any project or organization that requires high-quality technical expertise and a forward-thinking approach."
}