{
    "username": "mohamedfaz",
    "name": "Mohamed Fazil",
    "bio": "Currently pursuing B.Tech CS (2023-27) at SSET Karukutty.\r\n",
    "location": "Thrissur, Kerala, India.",
    "avatar_url": "https://avatars.githubusercontent.com/u/145818177?u=af3ff3ad693320ef710f1d14b2e624777757f209&v=4",
    "profile_url": "https://github.com/MOHAMEDFAZ",
    "top_languages": [
        [
            "C",
            1
        ],
        [
            "Python",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "Data-Structures",
            "description": "A collection of practical code examples for common data structures like arrays, linked lists, stacks, queues, trees, and more. Perfect for learning and refreshing your knowledge of algorithms! Each structure is well-documented with clear explanations and usage examples.  ",
            "score": 0.4454613065600551,
            "stars": 0,
            "forks": 0,
            "language": "C",
            "url": "https://github.com/MOHAMEDFAZ/Data-Structures",
            "updatedAt": "2024-12-28T16:29:16Z"
        },
        {
            "name": "Senate-Election-Voting-System",
            "description": "Its a python based election voting system ",
            "score": 0.24430426781495693,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/MOHAMEDFAZ/Senate-Election-Voting-System",
            "updatedAt": "2024-12-01T14:41:09Z"
        },
        {
            "name": "LEET-CODE",
            "description": null,
            "score": 0.16933763344737873,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/MOHAMEDFAZ/LEET-CODE",
            "updatedAt": "2023-12-29T10:02:29Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 4,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 6,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "instagram",
            "url": "https://www.instagram.com/1_mohamedfazil/"
        }
    ],
    "activity_summary": {
        "MOHAMEDFAZ/Data-Structures": {
            "link": "https://github.com/MOHAMEDFAZ/Data-Structures",
            "summary": "Recent activities in the Data-Structures repository include uploaded files on December 28, 2024, and an update to the README.md file on December 1, 2024, reflecting ongoing development and documentation efforts."
        },
        "MOHAMEDFAZ/SEVS": {
            "link": "https://github.com/MOHAMEDFAZ/SEVS",
            "summary": "The SEVS repository experienced significant activity on December 1, 2024, with the creation and subsequent update of the README.md file, indicating initial setup and configuration of the project, likely marking the beginning of its development phase."
        }
    },
    "profile_summary": "Mohamed Fazil is a highly motivated and skilled developer with a strong foundation in programming languages, particularly C and Python. He is currently pursuing his Bachelor of Technology in Computer Science at SSET Karukutty, with a keen interest in applying his technical skills to real-world problems. With a growing portfolio of public repositories, Mohamed demonstrates his ability to design, develop, and deploy innovative software solutions. His expertise in C and Python enables him to tackle complex projects with ease, making him a valuable asset to any development team.\n\nAs a emerging developer, Mohamed brings a fresh perspective and passion for coding to the table. His public repositories showcase his active participation in the development community, with a focus on creating high-quality, reliable code. With a strong educational background and a drive to continuously learn and improve, Mohamed is well-positioned to make a significant impact in the tech industry. His unique blend of technical skills, creativity, and enthusiasm makes him an exciting talent to watch, and his professional network is poised to grow as he continues to deliver innovative solutions and collaborate with like-minded developers."
}