{
    "username": "mrzubairdotin",
    "name": "Mr Zubair",
    "bio": "👋 Hi There! I'm Mr. Zubair — Frontend Developer | Aspiring Full Stack Developer 🚀",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/156564399?u=684ad548a2280a4951b6e1fec0f604b9b768c5ec&v=4",
    "profile_url": "https://github.com/mrzubairdotin",
    "top_languages": [
        [
            "JavaScript",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "vanilla-html-css-js-projects",
            "description": "This repository contains simple web development projects built using vanilla HTML, CSS, and JavaScript. These projects do not rely on any external libraries or frameworks, showcasing basic web development concepts and techniques. Perfect for beginners to explore and learn the fundamentals of frontend development.",
            "score": 0.40392376209658654,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/mrzubairdotin/vanilla-html-css-js-projects",
            "updatedAt": "2024-11-17T05:48:29Z",
            "isPinned": false,
            "homepage": null
        },
        {
            "name": "mrzubairdotin",
            "description": null,
            "score": 0.3726382475977037,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/mrzubairdotin/mrzubairdotin",
            "updatedAt": "2024-11-02T16:09:14Z",
            "isPinned": false,
            "homepage": null
        },
        {
            "name": "JavaScript-30-Days-Challenge-Basic-to-Advanced",
            "description": "This is my JavaScript chanllage to learn 30 days javascript basic to advanced",
            "score": 0.2927421047512304,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/mrzubairdotin/JavaScript-30-Days-Challenge-Basic-to-Advanced",
            "updatedAt": "2024-07-23T04:48:08Z",
            "isPinned": false,
            "homepage": null
        }
    ],
    "followers": 0,
    "following": 15,
    "public_repos": 3,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 18,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "activity_summary": {
        "mrzubairdotin/mrzubairdotin": {
            "link": "https://github.com/mrzubairdotin/mrzubairdotin",
            "summary": "The repository has witnessed recent activity with a push event updating the README.md file, indicating ongoing maintenance and improvement efforts as of November 2, 2024."
        }
    },
    "profile_summary": "Mr. Zubair is a highly motivated and innovative frontend developer with a strong foundation in JavaScript, driving his passion for creating seamless and user-friendly digital experiences. With a growing portfolio of public repositories, he demonstrates his commitment to active development and continuous learning, showcasing his ability to design, develop, and deploy high-quality web applications. As an aspiring full stack developer, he is expanding his skill set to tackle complex projects and deliver comprehensive solutions that meet the evolving needs of the industry.\n\nAs a dedicated and results-driven professional, Mr. Zubair brings a unique value proposition to the table, combining technical expertise with a collaborative mindset and a passion for innovation. With a strong focus on frontend development, he is well-versed in the latest JavaScript frameworks and technologies, enabling him to craft responsive, scalable, and efficient solutions that drive business success. With his expertise and enthusiasm, Mr. Zubair is poised to make a significant impact in the tech industry, and his professional network is expected to grow rapidly as he continues to deliver exceptional results and showcase his technical prowess."
}