{
    "username": "nishant-tiwari",
    "name": null,
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/46021229?v=4",
    "profile_url": "https://github.com/nishant-tiwari",
    "top_languages": [
        [
            "Shell",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "testDevops2",
            "description": "devops training by yogesh raheja",
            "score": 0.06526916284657307,
            "stars": 0,
            "forks": 0,
            "language": "Shell",
            "url": "https://github.com/nishant-tiwari/testDevops2",
            "updatedAt": "2019-03-08T07:31:44Z"
        },
        {
            "name": "testdevops",
            "description": null,
            "score": 0.06511443407512059,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/nishant-tiwari/testdevops",
            "updatedAt": "2019-02-01T06:38:41Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "This developer is a skilled technical expert with a strong foundation in Shell scripting, bringing a high level of proficiency and expertise to the table. With a focus on delivering high-quality solutions, they have established a reputation for reliability and technical prowess. Although they are still building their professional network, their active development efforts are evident in the two public repositories they have created, showcasing their ability to design, develop, and deploy innovative solutions. Their work demonstrates a keen understanding of industry trends and a commitment to staying up-to-date with the latest technologies.\n\nAs a dedicated and innovative professional, this developer is well-equipped to drive projects forward with their technical expertise and passion for development. With a solid understanding of Shell scripting, they are able to craft efficient and effective solutions that meet the needs of modern applications. Their unique value proposition lies in their ability to balance technical complexity with simplicity and elegance, resulting in solutions that are both robust and easy to maintain. With a strong work ethic and a commitment to excellence, this developer is poised to make a significant impact in the industry, and their skills and expertise make them an attractive asset to any organization seeking a skilled and innovative technical professional."
}