{
    "username": "olawale-ib",
    "name": "Afeez Musa",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/117480453?u=066dd3bae55114f4f1083d578b7e4131d12a6b02&v=4",
    "profile_url": "https://github.com/olawale-ib",
    "top_languages": [
        [
            "Java",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "devops-auto",
            "description": null,
            "score": 0.15271327735172285,
            "stars": 0,
            "forks": 0,
            "language": "Java",
            "url": "https://github.com/olawale-ib/devops-auto",
            "updatedAt": "2023-01-30T10:50:48Z",
            "isPinned": false,
            "homepage": null
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 12,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 104,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Afeez Musa is a skilled Java developer with a strong technical foundation and a passion for innovative software development. With a focus on delivering high-quality solutions, he has established himself as a reliable and proficient programmer. His expertise in Java has enabled him to develop a wide range of applications, from simple tools to complex systems. As a committed developer, Afeez Musa is dedicated to staying up-to-date with the latest industry trends and technologies, ensuring his skills remain relevant and effective.\n\nWith a portfolio of 12 public repositories, Afeez Musa has demonstrated his ability to design, develop, and deploy software applications with ease. His proficiency in Java has allowed him to create efficient and scalable solutions, making him a valuable asset to any development team. As a growing professional in the field, Afeez Musa is eager to expand his network and collaborate with like-minded developers to drive innovation and excellence in software development. With his strong technical skills and dedication to his craft, he is poised to make a significant impact in the world of Java development and beyond."
}