{
    "username": "omdeep-tyagi",
    "name": "Omdeep Tyagi",
    "bio": "Full-stack Developer | Competitive Programmer ",
    "location": "Ghaziabad",
    "avatar_url": "https://avatars.githubusercontent.com/u/166030469?v=4",
    "profile_url": "https://github.com/Omdeep-Tyagi",
    "top_languages": [
        [
            "JavaScript",
            10
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "ComicVerse",
            "description": "Node.js and Express.js backend for managing a comic book inventory. It provides a RESTful API for CRUD operations, with MongoDB as the database. Features include pagination, filtering, and sorting, along with robust error handling",
            "score": 1.7469681213421313,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/ComicVerse",
            "updatedAt": "2024-11-29T20:27:46Z"
        },
        {
            "name": "VersionVault",
            "description": "Developed a backend for a version control system with repository management and user authentication, implementing RESTful APIs and using AWS S3 for data storage.",
            "score": 1.7276340711049545,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/VersionVault",
            "updatedAt": "2024-11-29T20:27:22Z"
        },
        {
            "name": "SimplySync",
            "description": " Developed a web-based contact manager app using Node.js, Express, and MongoDB for secure contact storage. Implemented user authentication for secure access and management of contacts.",
            "score": 1.693974214991953,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/SimplySync",
            "updatedAt": "2024-11-29T20:26:59Z"
        },
        {
            "name": "Belong",
            "description": null,
            "score": 0.6255485871363695,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Omdeep-Tyagi/Belong",
            "updatedAt": "2024-12-11T16:45:04Z"
        },
        {
            "name": "SimplySync-Frontend",
            "description": null,
            "score": 0.5094349078426629,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/SimplySync-Frontend",
            "updatedAt": "2024-12-07T13:09:11Z"
        },
        {
            "name": "TradeEase",
            "description": null,
            "score": 0.49268810812957664,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/TradeEase",
            "updatedAt": "2024-12-22T10:16:57Z"
        },
        {
            "name": "Omdeep-Tyagi",
            "description": null,
            "score": 0.4603915146452023,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Omdeep-Tyagi/Omdeep-Tyagi",
            "updatedAt": "2024-12-22T10:50:13Z"
        },
        {
            "name": "Weather-App",
            "description": "This is a fully functional Weather App built with React, demonstrating key React concepts like state management, component lifecycle, hooks, conditional rendering, and API integration. The app provides real-time weather updates for any city entered by the user, showcasing how to build dynamic, user-friendly applications with React.",
            "score": 0.43681001432994365,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Omdeep-Tyagi/Weather-App",
            "updatedAt": "2024-12-10T08:06:29Z"
        }
    ],
    "followers": 3,
    "following": 6,
    "public_repos": 14,
    "pull_requests_merged": 3,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 63,
        "repositories_contributed_to": 1
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/omdeep-tyagi-428854272/"
        }
    ],
    "activity_summary": {
        "Omdeep-Tyagi/TradeEase": {
            "link": "https://github.com/Omdeep-Tyagi/TradeEase",
            "summary": "Recent activities in the TradeEase repository have focused on updating the gitIgnore file, with multiple pushes on December 22. Additionally, updates were made to the Login.js and Signup.js files on December 21 and December 10, indicating ongoing development and refinement of the application's authentication features."
        },
        "Omdeep-Tyagi/Omdeep-Tyagi": {
            "link": "https://github.com/Omdeep-Tyagi/Omdeep-Tyagi",
            "summary": "The Omdeep-Tyagi repository has seen recent updates, including multiple pushes on December 22 with general updates, as well as an update to the README.md file on November 29, suggesting maintenance and documentation efforts for the repository."
        }
    },
    "profile_summary": "Omdeep Tyagi is a highly skilled full-stack developer and competitive programmer with a strong background in JavaScript and HTML. With a proven track record of delivering high-quality solutions, Omdeep has established himself as a reliable and innovative professional in the field of software development. His extensive experience and expertise in web development have enabled him to create efficient, scalable, and user-friendly applications that meet the needs of diverse clients. As a seasoned developer, Omdeep stays up-to-date with the latest industry trends and technologies, ensuring that his skills remain relevant and effective.\n\nAs a respected member of the developer community, Omdeep has built a network of peers and collaborators who appreciate his technical expertise and creative approach to problem-solving. With 14 public repositories and a growing following of 3, Omdeep's online presence reflects his commitment to transparency, collaboration, and continuous learning. By leveraging his technical expertise and passion for innovation, Omdeep delivers cutting-edge solutions that drive business results and exceed client expectations. Whether working on personal projects or collaborating with others, Omdeep brings a unique blend of technical skill, creativity, and dedication to every endeavor, solidifying his position as a trusted and accomplished full-stack developer in the industry."
}