{
    "username": "popiegloria",
    "name": "ArfanMThafseer",
    "bio": "Here  to innovate, Find problems and create solutions. ",
    "location": "India, Kerala",
    "avatar_url": "https://avatars.githubusercontent.com/u/90204858?u=b958424cd45b8fd7371bd25cb9b571e0b6647d8e&v=4",
    "profile_url": "https://github.com/PopieGloria",
    "top_languages": [
        [
            "PHP",
            1
        ],
        [
            "HTML",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "DeckWise",
            "description": null,
            "score": 0.3834333279529972,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/PopieGloria/DeckWise",
            "updatedAt": "2024-11-02T19:26:30Z"
        },
        {
            "name": "ML-_AI",
            "description": null,
            "score": 0.3580247281365456,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/PopieGloria/ML-_AI",
            "updatedAt": "2024-10-18T03:42:33Z"
        },
        {
            "name": "Synth_ID",
            "description": null,
            "score": 0.27453260889552017,
            "stars": 0,
            "forks": 0,
            "language": "PHP",
            "url": "https://github.com/PopieGloria/Synth_ID",
            "updatedAt": "2024-04-30T16:15:45Z"
        },
        {
            "name": "PopieGloria",
            "description": null,
            "score": 0.2383442026565461,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/PopieGloria/PopieGloria",
            "updatedAt": "2024-10-26T17:45:39Z"
        },
        {
            "name": "Firehash",
            "description": "Firebase GDSC camp",
            "score": 0.16368627829411217,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/PopieGloria/Firehash",
            "updatedAt": "2023-09-30T04:00:26Z"
        }
    ],
    "followers": 5,
    "following": 9,
    "public_repos": 9,
    "pull_requests_merged": 1,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 41,
        "repositories_contributed_to": 3
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/arfanmthafseer"
        }
    ],
    "activity_summary": {
        "Navaneeth-Git/oopsie": {
            "link": "https://github.com/Navaneeth-Git/oopsie",
            "summary": "Recent activities in this repository include multiple push events with various fixes, improvements, and updates to the codebase and README file. Changes were made to enhance sensitivity, refine code, and address issues. Commit messages indicate a range of modifications, from fixing specific problems to updating the repository's documentation."
        },
        "PopieGloria/oopsie": {
            "link": "https://github.com/PopieGloria/oopsie",
            "summary": "This repository has seen significant recent activity, primarily consisting of push events that update the script.js file, improve sensitivity, and modify the README file. Multiple changes were made to the repository's content, including the addition of images, updates to the demo video, and modifications to the contributor list, indicating ongoing development and maintenance."
        },
        "PopieGloria/PopieGloria": {
            "link": "https://github.com/PopieGloria/PopieGloria",
            "summary": "Recent activity in this repository is relatively limited, with a single push event updating the README.md file. This suggests that the repository may be in a maintenance phase or that activities are currently focused on other aspects of the project."
        }
    },
    "profile_summary": "ArfanMThafseer is a skilled PHP and HTML developer with a strong passion for innovation and problem-solving. With a solid foundation in web development, he brings a unique approach to finding creative solutions to complex problems. As an active member of the GitHub community, ArfanMThafseer has built a professional network of like-minded individuals, with 5 followers who appreciate his technical expertise and collaborative spirit. His extensive portfolio of 9 public repositories showcases his commitment to ongoing development and passion for sharing knowledge with others.\n\nAs a driven and innovative developer, ArfanMThafseer is dedicated to delivering high-quality solutions that meet the evolving needs of the tech industry. With a focus on PHP and HTML, he is well-versed in the latest web development trends and technologies, ensuring that his projects are always up-to-date and effective. With a strong bio that reflects his mission to innovate and create solutions, ArfanMThafseer is a reliable and skilled professional who is always looking for new challenges and opportunities to grow. His technical expertise, combined with his collaborative approach and passion for innovation, make him a valuable asset to any development team or project."
}