{
    "error": "An unexpected error occurred: User 'ppy' not found or query returned no data.",
    "activity_summary": {
        "ppy/osu": {
            "link": "https://github.com/ppy/osu",
            "summary": "The osu repository has experienced significant activity with recent push and pull requests aimed at enhancing the gaming experience. These updates include speeding up the metronome in the timing screen when the control key is pressed, displaying storyboards in the editor background, and modifying beat divisor behavior. The changes also address points discussed in issue #31263 and #31144, focusing on smoother gameplay and improved user interaction."
        },
        "ppy/osu-queue-score-statistics": {
            "link": "https://github.com/ppy/osu-queue-score-statistics",
            "summary": "The osu-queue-score-statistics repository has seen recent updates, primarily focusing on disallowing daily challenge-related medals from being awarded on non-daily-challenge score submissions. This change aims to improve the accuracy and fairness of medal awards, addressing issues discussed in #309. The updates also include adjustments to test cases and code quality improvements."
        },
        "ppy/osu-server-beatmap-submission": {
            "link": "https://github.com/ppy/osu-server-beatmap-submission",
            "summary": "The osu-server-beatmap-submission repository has undergone updates to enhance observability by integrating Sentry and Datadog. These changes include adding logging and ensuring user IDs are logged in Sentry events. The goal is to improve the monitoring and troubleshooting of beatmap submissions, making the process more reliable and transparent."
        },
        "ppy/veldrid": {
            "link": "https://github.com/ppy/veldrid",
            "summary": "The Veldrid repository has seen a pull request aimed at removing the use of a potentially buggy pattern involving `Unsafe.AsRef` and `Unsafe.AsPointer`. This change replaces the pattern with GC-safe versions to prevent GC holes and ensure the stability and reliability of the Veldrid codebase."
        }
    },
    "profile_summary": null
}