{
    "username": "prithvirajnaik",
    "name": "prithvirajnaik",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/85544834?v=4",
    "profile_url": "https://github.com/prithvirajnaik",
    "top_languages": [
        [
            "JavaScript",
            1
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "disaterMange",
            "description": "A git hub repo made for the team kalki to work on the problem statement of disaster management",
            "score": 0.30533388460794725,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/prithvirajnaik/disaterMange",
            "updatedAt": "2024-08-11T03:25:30Z"
        },
        {
            "name": "simon-one.github.io",
            "description": null,
            "score": 0.28153807492503696,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/prithvirajnaik/simon-one.github.io",
            "updatedAt": "2024-06-02T08:42:10Z"
        }
    ],
    "followers": 2,
    "following": 2,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 23,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Prithvirajnaik is a skilled and accomplished developer with a strong foundation in JavaScript and HTML, delivering high-quality solutions that drive innovation and growth. With a growing professional network of peers and industry leaders, prithvirajnaik has established a reputation for reliability, technical expertise, and a passion for staying at the forefront of industry trends. By actively contributing to the development community through public repositories, prithvirajnaik demonstrates a commitment to collaborative learning, open-source development, and continuous improvement.\n\nAs a proficient JavaScript and HTML expert, prithvirajnaik brings a unique blend of technical skills and creative vision to the table, crafting tailored solutions that meet the evolving needs of clients and users. With a focus on writing clean, efficient, and well-documented code, prithvirajnaik ensures seamless integration, scalability, and performance. By leveraging industry-relevant tools and technologies, prithvirajnaik delivers high-impact results that drive business success, making them a valuable asset to any development team or project, and a trusted partner for companies seeking innovative, effective, and reliable web solutions."
}