{
    "username": "progprnv",
    "name": "progprnv",
    "bio": "Cybersecurity Researcher & Likes to crack codes rather than building one!!\r\n\r\n/ C / Python / C++ / Js / Bash / Html ",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/145828371?u=4a779d1fc0f06da5a5ee30b6552bcabf42129144&v=4",
    "profile_url": "https://github.com/progprnv",
    "top_languages": [
        [
            "C",
            3
        ],
        [
            "C++",
            2
        ],
        [
            "Python",
            7
        ]
    ],
    "top_projects": [
        {
            "name": "Interncrow",
            "description": "Tensed about your job or career? Welcome InternCrow - Your Minimalistic Free Job Finder Tool ",
            "score": 6.095346453673217,
            "stars": 7,
            "forks": 2,
            "language": "HTML",
            "url": "https://github.com/progprnv/Interncrow",
            "updatedAt": "2024-11-27T12:36:28Z"
        },
        {
            "name": "Chatter-Hacktoberfest_2024",
            "description": "Chatter is a minimalist web application designed for users to post and view messages easily. Built with PHP, it allows anyone to share their thoughts without the need for user accounts or complicated security features.",
            "score": 4.975131017878444,
            "stars": 5,
            "forks": 1,
            "language": "PHP",
            "url": "https://github.com/progprnv/Chatter-Hacktoberfest_2024",
            "updatedAt": "2024-11-27T12:36:09Z"
        },
        {
            "name": "SecMySIte",
            "description": "SEC-MY_SITE is a Flask-based web app designed to scan domains for essential security headers like Content-Security-Policy (CSP), CSRF tokens, CORS protection, and host header validation. It provides an easy-to-use interface for users to input domains and receive insights on their security posture, helping identify potential vulnerabilities.",
            "score": 4.616621323844663,
            "stars": 4,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/progprnv/SecMySIte",
            "updatedAt": "2024-11-27T12:36:11Z"
        },
        {
            "name": "Hackathon-Winning-Tips-Tricks",
            "description": "Must need repo to level up on Hackathon Events!! Master the art of problem solving and ideating projects. Be sure to use these tips nd tricks on your next hackathon!!!",
            "score": 4.203005439390173,
            "stars": 6,
            "forks": 0,
            "language": null,
            "url": "https://github.com/progprnv/Hackathon-Winning-Tips-Tricks",
            "updatedAt": "2024-11-30T14:11:00Z"
        },
        {
            "name": "Aircrack-ng-144p",
            "description": "Aircrack-Ng-144p lite v0.1.1 is a C-based Wi-Fi network scanner tool that scans and displays basic information about nearby Wi-Fi networks, including SSID, BSSID, channel, and signal strength.",
            "score": 3.8745950346742175,
            "stars": 5,
            "forks": 0,
            "language": "C++",
            "url": "https://github.com/progprnv/Aircrack-ng-144p",
            "updatedAt": "2024-11-27T12:36:25Z"
        },
        {
            "name": "Secure-KTU-Project_Davinci",
            "description": "Project Davinci, led by Government Engineering College (GEC) Thrissur, focuses on \"Secure-KTU,\" enhancing the security of the KTU website. The project assesses vulnerabilities per NCIIPC RVDP standards, addressing threats like data breaches and unauthorized access, ensuring safer online services. ",
            "score": 3.565237487463854,
            "stars": 4,
            "forks": 0,
            "language": null,
            "url": "https://github.com/progprnv/Secure-KTU-Project_Davinci",
            "updatedAt": "2024-11-27T12:35:58Z"
        },
        {
            "name": "reconP",
            "description": "reconP is a powerful subdomain discovery and verification tool that integrates multiple APIs to gather and check the status of subdomains for a given target domain.",
            "score": 3.526108340123077,
            "stars": 2,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/progprnv/reconP",
            "updatedAt": "2024-11-27T12:36:14Z"
        },
        {
            "name": "scope",
            "description": "SCOPE [Subdomain Cache Observation, Poisoning & Evaluation] is a simple, yet powerful tool designed to help you find and test vulnerabilities in subdomains that might be exposed to cache poisoning attacks. If a website isn't properly handling cache, it could lead to security issues where malicious content gets stored and served to users.",
            "score": 3.1849500888535216,
            "stars": 3,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/progprnv/scope",
            "updatedAt": "2024-12-13T23:47:32Z"
        }
    ],
    "followers": 70,
    "following": 68,
    "public_repos": 41,
    "pull_requests_merged": 1,
    "issues_closed": 3,
    "achievements": {
        "total_contributions": 774,
        "repositories_contributed_to": 6
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/pranav-jayan-818b52208"
        }
    ],
    "activity_summary": {
        "Cybersecurity-Chronicles-by-progprnv": {
            "link": "https://github.com/progprnv/Cybersecurity-Chronicles-by-progprnv",
            "summary": "Recent activities include updates to the CYBER-GITA_SESSION.txt file, with a new file creation on December 15th and subsequent update on the same day, indicating ongoing project development and refinement."
        },
        "Job-Hunting-00": {
            "link": "https://github.com/progprnv/Job-Hunting-00",
            "summary": "The repository has seen updates to the Readme.md file on December 7th and 8th, suggesting efforts to refine the project's documentation and presentation, potentially enhancing user experience and understanding of the project's purpose."
        },
        "Astra": {
            "link": "https://github.com/progprnv/Astra",
            "summary": "Significant activities include improvements to the authentication handling in login.py, with a refactor on December 6th, and an update to requirements.txt on December 8th, indicating a focus on enhancing the project's core functionality and dependency management."
        },
        "Live-ASCII-Converter": {
            "link": "https://github.com/progprnv/Live-ASCII-Converter",
            "summary": "A recent update to the README.md file on December 18th suggests ongoing maintenance and documentation refinement, ensuring users have access to the most current information about the project and its capabilities."
        },
        "Winter-Arc-Deep-Recon": {
            "link": "https://github.com/progprnv/Winter-Arc-Deep-Recon",
            "summary": "The project saw an update to the Readme.md file on December 12th, indicating efforts to improve project documentation and potentially expand its user base through clearer communication of its objectives and functionality."
        }
    },
    "profile_summary": "Progprnv is a highly skilled cybersecurity researcher with a strong background in programming languages such as C, C++, and Python. With a proven track record of delivering high-quality solutions, progprnv has established themselves as a trusted expert in their field, with a network of 70 professional followers and an impressive portfolio of 41 public repositories. Their unique approach to cybersecurity, centered around cracking codes rather than building them, has earned them a reputation as a innovative and results-driven professional.\n\nAs a seasoned developer with expertise in a range of programming languages, including JavaScript, Bash, and HTML, progprnv brings a distinctive blend of technical skills and creative problem-solving to the table. With a passion for cybersecurity research and a talent for analyzing complex systems, progprnv is dedicated to staying at the forefront of industry trends and technologies. By leveraging their technical expertise and collaborative approach, progprnv delivers effective solutions that drive results and add value to their clients and partners, solidifying their position as a leading cybersecurity researcher and developer in their field."
}