{
    "username": "progprnv",
    "name": "progprnv",
    "bio": "Cybersecurity Researcher & Likes to crack codes rather than building one!!\r\n\r\n/ C / Python / C++ / Js / Bash / Html ",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/145828371?u=4a779d1fc0f06da5a5ee30b6552bcabf42129144&v=4",
    "profile_url": "https://github.com/progprnv",
    "top_languages": [
        [
            "C",
            3
        ],
        [
            "C++",
            2
        ],
        [
            "Python",
            7
        ]
    ],
    "top_projects": [
        {
            "name": "Kalyani",
            "description": "Encoder & Decoder Tool Made For Destructive XSS Testing",
            "score": null,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/progprnv/Kalyani",
            "updatedAt": "2024-12-21T11:19:31Z"
        },
        {
            "name": "Interncrow",
            "description": "Tensed about your job or career? Welcome InternCrow - Your Minimalistic Free Job Finder Tool ",
            "score": 6.095040961504168,
            "stars": 7,
            "forks": 2,
            "language": "HTML",
            "url": "https://github.com/progprnv/Interncrow",
            "updatedAt": "2024-11-27T12:36:28Z"
        },
        {
            "name": "Chatter-Hacktoberfest_2024",
            "description": "Chatter is a minimalist web application designed for users to post and view messages easily. Built with PHP, it allows anyone to share their thoughts without the need for user accounts or complicated security features.",
            "score": 4.972852616858792,
            "stars": 5,
            "forks": 1,
            "language": "PHP",
            "url": "https://github.com/progprnv/Chatter-Hacktoberfest_2024",
            "updatedAt": "2024-11-27T12:36:09Z"
        },
        {
            "name": "SecMySIte",
            "description": "SEC-MY_SITE is a Flask-based web app designed to scan domains for essential security headers like Content-Security-Policy (CSP), CSRF tokens, CORS protection, and host header validation. It provides an easy-to-use interface for users to input domains and receive insights on their security posture, helping identify potential vulnerabilities.",
            "score": 4.614088303463489,
            "stars": 4,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/progprnv/SecMySIte",
            "updatedAt": "2024-11-27T12:36:11Z"
        },
        {
            "name": "Hackathon-Winning-Tips-Tricks",
            "description": "Must need repo to level up on Hackathon Events!! Master the art of problem solving and ideating projects. Be sure to use these tips nd tricks on your next hackathon!!!",
            "score": 4.2024877653904325,
            "stars": 6,
            "forks": 0,
            "language": null,
            "url": "https://github.com/progprnv/Hackathon-Winning-Tips-Tricks",
            "updatedAt": "2024-11-30T14:11:00Z"
        },
        {
            "name": "Aircrack-ng-144p",
            "description": "Aircrack-Ng-144p lite v0.1.1 is a C-based Wi-Fi network scanner tool that scans and displays basic information about nearby Wi-Fi networks, including SSID, BSSID, channel, and signal strength.",
            "score": 3.8742698440004597,
            "stars": 5,
            "forks": 0,
            "language": "C++",
            "url": "https://github.com/progprnv/Aircrack-ng-144p",
            "updatedAt": "2024-11-27T12:36:25Z"
        },
        {
            "name": "Secure-KTU-Project_Davinci",
            "description": "Project Davinci, led by Government Engineering College (GEC) Thrissur, focuses on \"Secure-KTU,\" enhancing the security of the KTU website. The project assesses vulnerabilities per NCIIPC RVDP standards, addressing threats like data breaches and unauthorized access, ensuring safer online services. ",
            "score": 3.5641951599501773,
            "stars": 4,
            "forks": 0,
            "language": null,
            "url": "https://github.com/progprnv/Secure-KTU-Project_Davinci",
            "updatedAt": "2024-11-27T12:35:58Z"
        },
        {
            "name": "reconP",
            "description": "reconP is a powerful subdomain discovery and verification tool that integrates multiple APIs to gather and check the status of subdomains for a given target domain.",
            "score": 3.5254902854875185,
            "stars": 2,
            "forks": 1,
            "language": "Python",
            "url": "https://github.com/progprnv/reconP",
            "updatedAt": "2024-11-27T12:36:14Z"
        }
    ],
    "followers": 69,
    "following": 68,
    "public_repos": 43,
    "pull_requests_merged": 2,
    "issues_closed": 3,
    "achievements": {
        "total_contributions": 818,
        "repositories_contributed_to": 7
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/pranav-jayan-818b52208"
        }
    ],
    "activity_summary": {
        "Kalyani": {
            "link": "https://github.com/progprnv/Kalyani",
            "summary": "The Kalyani repository has seen significant activity with numerous push events occurred on December 21, 2024, including updates to script.js, styles.css, and index.html, as well as the creation and deletion of a CNAME file, and the initial creation of readme.md, index.html, and styles.css."
        },
        "ASCII-Kuttappan": {
            "link": "https://github.com/progprnv/ASCII-Kuttappan",
            "summary": "The ASCII-Kuttappan repository experienced a series of push events on December 20, 2024, involving updates to app.py, requirements.txt, and readme.md, as well as the renaming of main.py to app.py, indicating ongoing development and refinement of the project."
        },
        "devb.io": {
            "link": "https://github.com/sunithvs/devb.io",
            "summary": "The devb.io repository, maintained by sunithvs, saw two significant pull requests on December 21, 2024, which implemented error handling for the GitHub profile fetcher and updated the Dockerfile for dynamic port configuration, enhancing the application's reliability, flexibility, and adherence to standard DevOps practices."
        },
        "devb.io (progprnv)": {
            "link": "https://github.com/progprnv/devb.io",
            "summary": "The devb.io repository, maintained by progprnv, had push events on December 21, 2024, that implemented error handling for the GitHub profile fetcher and configured the application through environment variables, mirroring updates found in the sunithvs/devb.io repository and demonstrating collaborative development."
        }
    },
    "profile_summary": "Progprnv is a highly skilled cybersecurity researcher with a strong foundation in programming languages, including C, C++, and Python. With a keen interest in cracking codes, progprnv has developed a unique expertise in identifying vulnerabilities and developing innovative solutions to complex cybersecurity challenges. As a seasoned developer with 43 public repositories, progprnv has demonstrated a consistent ability to design, develop, and deploy high-quality code, leveraging expertise in languages such as JavaScript, Bash, and HTML. \n\nAs a respected member of the development community, progprnv has built a professional network of 69 followers, showcasing influence and expertise in the field of cybersecurity research. With a passion for staying at the forefront of industry trends and advancements, progprnv continues to push the boundaries of what is possible in cybersecurity, driving innovation and delivering high-impact results. By combining technical expertise with a relentless drive to crack codes and solve complex problems, progprnv has established a reputation as a reliable, skilled, and forward-thinking cybersecurity researcher, poised to make a lasting impact in the industry."
}