{
    "username": "riyas-iqbal",
    "name": "Riyas Iqbal",
    "bio": "In a world of algorithms, may the possibilities be endless.",
    "location": "kochi, kerala",
    "avatar_url": "https://avatars.githubusercontent.com/u/109857789?u=e94c843ed345f867c8b5364d374f1d9dc708f4fb&v=4",
    "profile_url": "https://github.com/Riyas-iqbal",
    "top_languages": [
        [
            "TypeScript",
            7
        ],
        [
            "JavaScript",
            12
        ],
        [
            "Handlebars",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Theora",
            "description": "Theora is a online learning platform designed to provide a seamless online learning experience. With Theora, students can access courses, track their progress, and interact with instructors and peers",
            "score": 11.009619980185963,
            "stars": 45,
            "forks": 7,
            "language": "JavaScript",
            "url": "https://github.com/Riyas-iqbal/Theora",
            "updatedAt": "2024-10-10T09:37:28Z"
        },
        {
            "name": "Express-boilerplate",
            "description": "Pre-configured and reusable template for building web applications using Express. Includes the basic file structure, configuration, and packages needed to get started quickly with building a new application. In progress...",
            "score": 4.6275077244926495,
            "stars": 8,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Riyas-iqbal/Express-boilerplate",
            "updatedAt": "2024-10-10T09:37:26Z"
        },
        {
            "name": "User-management-system",
            "description": "User management system with an admin side built using React, Node, Redux, REST API, Express, and MongoDB. The system allows for the creation, deletion, and editing of user accounts, as well as the management of User profile picture. It also includes a robust admin interface for managing the users.",
            "score": 4.3866329931110135,
            "stars": 7,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Riyas-iqbal/User-management-system",
            "updatedAt": "2024-05-16T11:41:14Z"
        },
        {
            "name": "NextGen-Store",
            "description": "Next-gen store is an e-commerce site built using Node.js, Express, and MongoDB with server-side rendering, Features - Product catalog, Shopping cart, Checkout, Search and navigation, Customer account, Inventory management, Analytics and more",
            "score": 4.384393688748421,
            "stars": 7,
            "forks": 0,
            "language": "CSS",
            "url": "https://github.com/Riyas-iqbal/NextGen-Store",
            "updatedAt": "2024-06-03T14:04:06Z"
        },
        {
            "name": "password-generator",
            "description": "A React Typescript application that generates passwords based on custom conditions ",
            "score": 1.5446385119596286,
            "stars": 1,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/Riyas-iqbal/password-generator",
            "updatedAt": "2023-06-26T13:29:35Z"
        },
        {
            "name": "Typescript",
            "description": " TypeScript repository designed to provide a hands-on playground environment for learning and experimenting with TypeScript.",
            "score": 1.5439265880169473,
            "stars": 1,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/Riyas-iqbal/Typescript",
            "updatedAt": "2023-07-11T06:59:14Z"
        },
        {
            "name": "nextjs-playground",
            "description": null,
            "score": 1.540760978939597,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Riyas-iqbal/nextjs-playground",
            "updatedAt": "2023-06-15T12:40:56Z"
        },
        {
            "name": "techcache",
            "description": "Techcache is a personal knowledge base and code repository for my tech stack, where I store notes, code snippets, and examples related to various programming languages and frameworks. This repository is intended for my personal use, but feel free to browse and use any code snippets that you find useful.",
            "score": 1.5404687691463672,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Riyas-iqbal/techcache",
            "updatedAt": "2023-06-15T12:40:54Z"
        }
    ],
    "followers": 62,
    "following": 75,
    "public_repos": 28,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 360,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://linkedin.com/in/riyas-iqbal"
        }
    ],
    "profile_summary": "Riyas Iqbal is a highly skilled and accomplished developer with a strong expertise in TypeScript, JavaScript, and Handlebars. With a professional network of 62 followers, Riyas has established himself as a reliable and influential figure in the development community. His extensive portfolio of 28 public repositories showcases his dedication to active development and his passion for creating innovative solutions. As a seasoned developer, Riyas brings a unique combination of technical skills and creative vision to the table, making him a valuable asset to any project or team.\n\nWith a keen eye for detail and a drive to push the boundaries of what is possible, Riyas is always looking for new ways to improve and expand his skills. His mantra, \"In a world of algorithms, may the possibilities be endless,\" reflects his enthusiasm for exploring new ideas and his commitment to delivering high-quality results. As a developer who is always looking to the future, Riyas is well-versed in the latest industry trends and technologies, and is dedicated to staying up-to-date with the latest advancements in his field. With his strong technical foundation and innovative approach, Riyas is a developer who can be relied upon to deliver innovative solutions that meet the needs of today and tomorrow."
}