{
    "username": "rsb-23",
    "name": "Mr. RB",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/57601627?v=4",
    "profile_url": "https://github.com/rsb-23",
    "top_languages": [
        [
            "Python",
            6
        ],
        [
            "JavaScript",
            2
        ],
        [
            "Batchfile",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "right-to-be-forgotten",
            "description": "“Right to be Forgotten” is a right to have private information removed from the internet search engine, database, websites or other public platforms.",
            "score": 3.089298424407873,
            "stars": 3,
            "forks": 0,
            "language": null,
            "url": "https://github.com/rsb-23/right-to-be-forgotten",
            "updatedAt": "2024-12-21T16:56:06Z"
        },
        {
            "name": "Ek-Cup-Tcha",
            "description": "Captcha solver extension",
            "score": 2.6899126854657958,
            "stars": 2,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/rsb-23/Ek-Cup-Tcha",
            "updatedAt": "2024-12-25T18:24:43Z"
        },
        {
            "name": "digital-literacy",
            "description": "A quick guide to invoke digital literacy among people and secure their digital life.",
            "score": 2.4141216252216235,
            "stars": 2,
            "forks": 0,
            "language": "Batchfile",
            "url": "https://github.com/rsb-23/digital-literacy",
            "updatedAt": "2024-12-13T20:30:48Z"
        },
        {
            "name": "1page-automation",
            "description": "Simple browser-based automation using 1-page python scripts",
            "score": 2.411808977764733,
            "stars": 2,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/1page-automation",
            "updatedAt": "2024-09-27T16:35:09Z"
        },
        {
            "name": "rsb-23.github.io",
            "description": null,
            "score": 1.6925518258934493,
            "stars": 1,
            "forks": 0,
            "language": null,
            "url": "https://github.com/rsb-23/rsb-23.github.io",
            "updatedAt": "2024-09-03T19:39:52Z"
        },
        {
            "name": "check-typo",
            "description": "Github action to check typos in diff",
            "score": 0.46600120091970887,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/check-typo",
            "updatedAt": "2024-12-01T22:07:23Z"
        },
        {
            "name": "high-on-ai",
            "description": null,
            "score": 0.4094376306140961,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/high-on-ai",
            "updatedAt": "2024-11-19T05:42:28Z"
        },
        {
            "name": "vobjectx",
            "description": "Forked from py-vobject/vobject v0.9.8",
            "score": 0.34742423384957516,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/vobjectx",
            "updatedAt": "2024-11-05T17:39:10Z"
        }
    ],
    "followers": 1,
    "following": 1,
    "public_repos": 25,
    "pull_requests_merged": 15,
    "issues_closed": 4,
    "achievements": {
        "total_contributions": 220,
        "repositories_contributed_to": 9
    },
    "social_accounts": [],
    "activity_summary": {
        "rsb-23/infotainer": {
            "link": "https://github.com/rsb-23/infotainer",
            "summary": "Recent activities in the infotainer repository include multiple push events with updates to the codebase, including the creation of a CNAME and the enabling of eslint v9, demonstrating ongoing development and maintenance efforts."
        },
        "rsb-23/check-typo": {
            "link": "https://github.com/rsb-23/check-typo",
            "summary": "The check-typo repository has seen significant activity, including a pull request focused on fixing a PR comment token, along with multiple push events addressing syntax errors, import issues, and workflow adjustments, highlighting a period of active debugging and improvement."
        },
        "rsb-23/universal-android-debloater-next-generation": {
            "link": "https://github.com/rsb-23/universal-android-debloater-next-generation",
            "summary": "Activity in the universal-android-debloater-next-generation repository includes push events that removed unnecessary whitespace and optional fields from descriptions, and the implementation of a linting workflow using pre-commit hooks and actions/check-diff-typo, indicating efforts to refine and standardize the codebase."
        },
        "rsb-23/Ek-Cup-Tcha": {
            "link": "https://github.com/rsb-23/Ek-Cup-Tcha",
            "summary": "The Ek-Cup-Tcha repository initiated with an initial commit followed by updates that centered around UI changes, including adjustments to the captcha preview and manifest configuration updates, marking the beginnings of the project's development."
        },
        "rsb-23/digital-literacy": {
            "link": "https://github.com/rsb-23/digital-literacy",
            "summary": "Recent activity in the digital-literacy repository involves the addition of documentation related to fraud and optouts, contributing to the expansion and improvement of the project's informational resources."
        }
    },
    "profile_summary": "Mr. RB is a highly skilled and accomplished developer with a strong foundation in programming languages such as Python, JavaScript, and Batchfile. With a growing professional network of followers and a substantial portfolio of 25 public repositories, he has established himself as a dedicated and innovative developer in the industry. His expertise in these technical areas enables him to design, develop, and implement effective solutions that meet the needs of his clients and contribute to the advancement of the field. As a talented and motivated individual, Mr. RB is committed to staying up-to-date with the latest technologies and trends, ensuring that his skills remain relevant and in demand.\n\nWith a unique blend of technical expertise and professional achievements, Mr. RB offers a distinctive value proposition that sets him apart from his peers. His proficiency in Python, JavaScript, and Batchfile allows him to tackle complex projects with confidence and deliver high-quality results. As a reliable and skilled developer, he is well-equipped to collaborate with other professionals, contribute to open-source projects, and drive innovation in the industry. By leveraging his technical skills and experience, Mr. RB is poised to make a lasting impact in the world of software development and continue to grow as a leading developer in his field."
}