{
    "username": "rsb-23",
    "name": "rsb-23",
    "bio": null,
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/57601627?v=4",
    "profile_url": "https://github.com/rsb-23",
    "top_languages": [
        [
            "Python",
            6
        ],
        [
            "JavaScript",
            2
        ],
        [
            "Batchfile",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "right-to-be-forgotten",
            "description": "“Right to be Forgotten” is a right to have private information removed from the internet search engine, database, websites or other public platforms.",
            "score": 3.0917050429707853,
            "stars": 3,
            "forks": 0,
            "language": null,
            "url": "https://github.com/rsb-23/right-to-be-forgotten",
            "updatedAt": "2024-12-21T16:56:06Z"
        },
        {
            "name": "digital-literacy",
            "description": "A quick guide to invoke digital literacy among people and secure their digital life.",
            "score": 2.414215146629955,
            "stars": 2,
            "forks": 0,
            "language": "Batchfile",
            "url": "https://github.com/rsb-23/digital-literacy",
            "updatedAt": "2024-12-13T20:30:48Z"
        },
        {
            "name": "1page-automation",
            "description": "Simple browser-based automation using 1-page python scripts",
            "score": 2.411922313157577,
            "stars": 2,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/1page-automation",
            "updatedAt": "2024-09-27T16:35:09Z"
        },
        {
            "name": "Ek-Cup-Tcha",
            "description": "Captcha solver extension",
            "score": 1.9157285469170322,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/rsb-23/Ek-Cup-Tcha",
            "updatedAt": "2024-12-08T17:52:16Z"
        },
        {
            "name": "rsb-23.github.io",
            "description": null,
            "score": 1.6944585899030287,
            "stars": 1,
            "forks": 0,
            "language": null,
            "url": "https://github.com/rsb-23/rsb-23.github.io",
            "updatedAt": "2024-09-03T19:39:52Z"
        },
        {
            "name": "check-typo",
            "description": "Github action to check typos in diff",
            "score": 0.49268810812957664,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/check-typo",
            "updatedAt": "2024-12-01T22:07:23Z"
        },
        {
            "name": "high-on-ai",
            "description": null,
            "score": 0.4218996210940925,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/high-on-ai",
            "updatedAt": "2024-11-19T05:42:28Z"
        },
        {
            "name": "vobjectx",
            "description": "Forked from py-vobject/vobject v0.9.8",
            "score": 0.35189130858241585,
            "stars": 0,
            "forks": 0,
            "language": "Python",
            "url": "https://github.com/rsb-23/vobjectx",
            "updatedAt": "2024-11-05T17:39:10Z"
        }
    ],
    "followers": 1,
    "following": 1,
    "public_repos": 25,
    "pull_requests_merged": 16,
    "issues_closed": 8,
    "achievements": {
        "total_contributions": 219,
        "repositories_contributed_to": 9
    },
    "social_accounts": [],
    "activity_summary": {
        "rsb-23/check-typo": {
            "link": "https://github.com/rsb-23/check-typo",
            "summary": "Recent activities have focused on resolving syntax errors, fixing import issues, and refining the repository's workflow. A PAT was added to the workflow, and a PR comment token fix was implemented. Multiple push events have occurred, addressing various issues such as path errors, formatting, and typo corrections, ultimately leading to a merged pull request."
        },
        "rsb-23/infotainer": {
            "link": "https://github.com/rsb-23/infotainer",
            "summary": "Recent activities have centered around updating the repository, with multiple push events occurring on the same day. The updates include enabling eslint v9, creating a CNAME file, and making other general updates to the repository, showcasing ongoing maintenance and improvement efforts."
        },
        "rsb-23/universal-android-debloater-next-generation": {
            "link": "https://github.com/rsb-23/universal-android-debloater-next-generation",
            "summary": "Activities have been directed towards refining the repository, with push events focused on removing whitespace suffixes, eliminating optional fields, and enhancing the description. Additionally, a uad_list linting workflow was introduced, incorporating pre-commit hooks and the actions/check-diff-typo action, demonstrating a commitment to code quality and consistency."
        },
        "rsb-23/digital-literacy": {
            "link": "https://github.com/rsb-23/digital-literacy",
            "summary": "A recent push event added documentation regarding fraud and optouts, contributing to the repository's growth and informational value. This update indicates ongoing efforts to expand and refine the repository's content, addressing critical aspects of digital literacy."
        },
        "rsb-23/rsb-23.github.io": {
            "link": "https://github.com/rsb-23/rsb-23.github.io",
            "summary": "A recent push event resulted in the creation of a CNAME file, which is a crucial step in configuring domain settings for the GitHub Pages site. This action suggests that the repository is being set up or updated for hosting a website or blog, marking the initial steps in establishing an online presence."
        }
    },
    "profile_summary": "rsb-23 is a skilled and accomplished developer with a strong foundation in programming languages such as Python, JavaScript, and Batchfile. With a growing network of professional connections and a notable influence in the development community, rsb-23 has established themselves as a reliable and innovative expert in their field. Their technical expertise is complemented by a proven track record of delivering high-quality solutions, as evident from their extensive collection of public repositories, which showcases their active development and commitment to open-source collaboration.\n\nAs a seasoned developer, rsb-23 brings a unique combination of technical skills and professional experience to the table, making them a valuable asset to any project or organization. With a focus on leveraging industry-relevant technologies to drive innovation and growth, rsb-23 is well-versed in the latest trends and best practices in software development. Their expertise in Python, JavaScript, and Batchfile enables them to design, develop, and deploy scalable and efficient solutions that meet the evolving needs of businesses and users alike, cementing their position as a trusted and results-driven developer in the industry."
}