{
    "username": "sadeed-bs",
    "name": "Sadeed Bin Sadik",
    "bio": " I know Artificial intelligence and Web development. I learned Python, JavaScript, Java, C, C++, and HTML",
    "location": "Keralam, India",
    "avatar_url": "https://avatars.githubusercontent.com/u/70870990?v=4",
    "profile_url": "https://github.com/Sadeed-BS",
    "top_languages": [],
    "top_projects": [
        {
            "name": "INFINITY-WEB",
            "description": "This is a website based store for all operating system and a open source program",
            "score": 0.2590691396358171,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Sadeed-BS/INFINITY-WEB",
            "updatedAt": "2024-10-19T05:23:40Z"
        }
    ],
    "followers": 2,
    "following": 7,
    "public_repos": 6,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 4,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Sadeed Bin Sadik is a highly skilled developer with expertise in artificial intelligence and web development, possessing a strong foundation in programming languages such as Python, JavaScript, Java, C, C++, and HTML. With a growing professional network and influence, as evidenced by his followers, Sadeed demonstrates a notable ability to collaborate and share knowledge with others in the development community. His active involvement in development is further highlighted by his public repositories, showcasing his dedication to creating innovative solutions and contributing to the open-source community.\n\nAs a seasoned developer, Sadeed brings a unique combination of technical expertise and passion for innovation to the table, making him a valuable asset to any project or team. With his proficiency in AI and web development, he is well-equipped to design and implement cutting-edge solutions that drive results. Sadeed's commitment to staying up-to-date with industry trends and best practices enables him to deliver high-quality work, and his strong work ethic ensures reliability and efficiency in his collaborations. By leveraging his technical skills and expertise, Sadeed is poised to make a significant impact in the world of artificial intelligence and web development, and is an ideal partner for businesses and individuals seeking innovative and effective solutions."
}