{
    "username": "sandravizz",
    "name": "sandraviz",
    "bio": "Statistician with a passion for visualisation and design.",
    "location": "Lisbon, Portgual ",
    "avatar_url": "https://avatars.githubusercontent.com/u/25296493?u=89c76a9cc12e48f4c5e7e101de8f70c0a94d5329&v=4",
    "profile_url": "https://github.com/sandravizz",
    "top_languages": [
        [
            "R",
            1
        ],
        [
            "JavaScript",
            3
        ],
        [
            "Svelte",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "Natural-disasters",
            "description": "Web based data visualisation project about natural disasters using d3.js ",
            "score": 5.180467946268357,
            "stars": 6,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/sandravizz/Natural-disasters",
            "updatedAt": "2024-12-12T14:51:22Z"
        },
        {
            "name": "D3.js-beginners-course",
            "description": "This repository belongs to a d3.js beginners course, which I'm teaching in different universities. ",
            "score": 3.0179400434040033,
            "stars": 3,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/sandravizz/D3.js-beginners-course",
            "updatedAt": "2024-12-12T14:45:04Z"
        },
        {
            "name": "Analytical-System-Design",
            "description": "Teaching material for bachelor course at Arcada",
            "score": 2.912888309541754,
            "stars": 0,
            "forks": 5,
            "language": "HTML",
            "url": "https://github.com/sandravizz/Analytical-System-Design",
            "updatedAt": "2024-06-15T11:02:11Z"
        },
        {
            "name": "D3-dataviz-gallery",
            "description": "Collection of d3.js data visulaisations using using structured code to easily replicate. (work in progress)",
            "score": 2.471970708908652,
            "stars": 2,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/sandravizz/D3-dataviz-gallery",
            "updatedAt": "2024-12-12T14:40:12Z"
        },
        {
            "name": "Data-breach-analysis",
            "description": "What Data Breaches Tell Us: An Analysis of 17,000 U.S. Data Breaches using D3.js ",
            "score": 2.4444056588519643,
            "stars": 2,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/sandravizz/Data-breach-analysis",
            "updatedAt": "2024-12-12T14:39:17Z"
        },
        {
            "name": "AI-ethical-challenges",
            "description": "Teaching material for bachelor course at Arcada",
            "score": 2.420113019038218,
            "stars": 2,
            "forks": 0,
            "language": "Jupyter Notebook",
            "url": "https://github.com/sandravizz/AI-ethical-challenges",
            "updatedAt": "2024-06-15T11:06:58Z"
        },
        {
            "name": "Global_inequality_Story",
            "description": "Dataviz Project about Global Inequality",
            "score": 1.7497426669069123,
            "stars": 1,
            "forks": 0,
            "language": "Svelte",
            "url": "https://github.com/sandravizz/Global_inequality_Story",
            "updatedAt": "2024-12-18T18:33:03Z"
        },
        {
            "name": "Global-Inequality-Data",
            "description": "This repository includes the data wrangling about the Global Inequality dataviz project using vanilla js and the library arquero.js",
            "score": 1.6530076134079132,
            "stars": 1,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/sandravizz/Global-Inequality-Data",
            "updatedAt": "2024-10-27T17:24:49Z"
        }
    ],
    "followers": 43,
    "following": 22,
    "public_repos": 12,
    "pull_requests_merged": 1,
    "issues_closed": 1,
    "achievements": {
        "total_contributions": 422,
        "repositories_contributed_to": 2
    },
    "social_accounts": [
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/sandradataviz/"
        }
    ],
    "activity_summary": {
        "sandravizz/Global_inequality_Story": {
            "link": "https://github.com/sandravizz/Global_inequality_Story",
            "summary": "Activity has been observed in this repository over the past two weeks, with multiple push events containing updates to the project's structure and design. These updates include improvements to the project's footer, axis font, and overall design aesthetics. Such activities indicate that the project is in an active state of development."
        },
        "sandravizz/D3-dataviz-gallery": {
            "link": "https://github.com/sandravizz/D3-dataviz-gallery",
            "summary": "Recent activity in this repository suggests ongoing efforts to enhance the project's design and dataviz gallery. Updates to the repository include code and chart cleaning, improvements in design, and minor changes to the readme file. These updates indicate a focus on refining the project's overall appearance and user experience."
        },
        "sandravizz/Natural-disasters": {
            "link": "https://github.com/sandravizz/Natural-disasters",
            "summary": "Activity in this repository includes updates to the project's design and a minor fix to a link error. Recent push events suggest that the project is undergoing minor refinements aimed at enhancing its functionality and overall quality. These updates are concentrated around specific aspects of the project, indicating targeted efforts to resolve identified issues."
        },
        "sandravizz/Global-Inequality-Intro": {
            "link": "https://github.com/sandravizz/Global-Inequality-Intro",
            "summary": "This repository has seen recent updates to its index and readme files. These updates suggest ongoing efforts to refine the project's documentation and overall introduction. They indicate a focus on improving the project's User Experience (UX) and facilitating a better understanding of the project's purpose and intentions for its users."
        },
        "sandravizz/Global-Inequality-Data": {
            "link": "https://github.com/sandravizz/Global-Inequality-Data",
            "summary": "Recent activity in this repository is limited to updates and improvements to the project's readme file. These activities suggest that the project is undergoing minor refinements, with a focus on improving documentation and overall project presentation. Such updates indicate efforts to enhance the project's accessibility and user-friendliness."
        }
    },
    "profile_summary": "SandraViz is a seasoned statistician and versatile developer with a unique blend of technical expertise and creative vision. With a strong foundation in R and JavaScript, she excels in data analysis and visualisation, leveraging Svelte to craft intuitive, data-driven user experiences. Her prolific output on GitHub, comprising 12 public repositories, showcases her dedication to active development and collaboration. As a respected figure in her professional network, she has garnered a significant following, with 43 followers attesting to her influence and thought leadership in the field.\n\nAs a statistician with a passion for visualisation and design, SandraViz brings a distinctive perspective to the world of data analysis. Her work seamlessly converges technical skill and creative flair, yielding innovative solutions that distill complex data into actionable insights. With a keen eye for detail and a talent for problem-solving, she delivers high-quality results that exceed expectations. Whether navigating complex data landscapes or crafting elegant visual narratives, SandraViz is a reliable, adaptable, and forward-thinking professional who consistently delivers value through her technical expertise and collaborative approach."
}