{
    "username": "shsharkar",
    "name": "Md. Sazzad Hossain Sharkar",
    "bio": "I am a software engineer, web developer, and AI prompt engineering expert passionate about #TechLife, #WebDev, #AIPrompt, #Innovation, and #Coding.",
    "location": "Dhaka, Bangladesh",
    "avatar_url": "https://avatars.githubusercontent.com/u/12555542?u=6aec7a2f678cc1f1ca645f1cb9367937511e405d&v=4",
    "profile_url": "https://github.com/SHSharkar",
    "top_languages": [
        [
            "HTML",
            9
        ],
        [
            "JavaScript",
            2
        ],
        [
            "TSQL",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "ChatGPT-Power-Prompts-for-PHP-and-Laravel-Developer",
            "description": "ChatGPT Power Prompts for PHP and Laravel Developer",
            "score": 7.925798279774581,
            "stars": 13,
            "forks": 4,
            "language": "HTML",
            "url": "https://github.com/SHSharkar/ChatGPT-Power-Prompts-for-PHP-and-Laravel-Developer",
            "updatedAt": "2024-11-12T01:17:40Z"
        },
        {
            "name": "Laravel-Rsync-Deploy",
            "description": "Deploy Laravel developed project with Rsync. (GitHub Action)",
            "score": 6.979719048074225,
            "stars": 7,
            "forks": 5,
            "language": "Dockerfile",
            "url": "https://github.com/SHSharkar/Laravel-Rsync-Deploy",
            "updatedAt": "2023-09-21T19:42:50Z"
        },
        {
            "name": "Stremio-Real-Debrid-Addon",
            "description": "Stream your Real Debrid files in Stremio. Disclaimer: This addon is not official and is not affiliated with the Real Debrid website.",
            "score": 3.927815530142675,
            "stars": 5,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/SHSharkar/Stremio-Real-Debrid-Addon",
            "updatedAt": "2024-12-15T18:40:23Z"
        },
        {
            "name": "SlugifyPro-Advanced-Text-to-Slug-Converter",
            "description": "SlugifyPro is a comprehensive tool designed for generating slugs with advanced customization options. Easily choose your separator—hyphen, underscore, or dot—and set the case to either lowercase or as-is to meet your specific requirements.",
            "score": 2.4398611671977233,
            "stars": 2,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/SHSharkar/SlugifyPro-Advanced-Text-to-Slug-Converter",
            "updatedAt": "2024-08-08T12:19:38Z"
        },
        {
            "name": "GPT-Instructions",
            "description": "GPT Instructions for Laravel Framework and Ecosystem.",
            "score": 1.7248323932930065,
            "stars": 1,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/SHSharkar/GPT-Instructions",
            "updatedAt": "2024-11-26T09:43:04Z"
        },
        {
            "name": "PHP-Refactor-Toolkit",
            "description": "The PHP Refactor Toolkit is a comprehensive script designed to streamline and automate the refactoring of PHP code. It leverages several powerful tools to ensure your code adheres to best practices and modern coding standards.",
            "score": 1.6911735918757542,
            "stars": 1,
            "forks": 0,
            "language": "Shell",
            "url": "https://github.com/SHSharkar/PHP-Refactor-Toolkit",
            "updatedAt": "2024-08-09T12:45:04Z"
        },
        {
            "name": "MySQL-DB-Management-Shell-Script",
            "description": "This script is designed to manage MySQL databases by providing functionalities to clear all tables in a specified database and to import SQL files into a database.",
            "score": 1.6876968627675741,
            "stars": 1,
            "forks": 0,
            "language": "Shell",
            "url": "https://github.com/SHSharkar/MySQL-DB-Management-Shell-Script",
            "updatedAt": "2024-08-08T12:19:25Z"
        },
        {
            "name": "GitBranchGen-Effortless-Git-Branch-Name-Generator",
            "description": "GitBranchGen simplifies your Git workflow by auto-generating readable and consistent branch names based on your input. Add a prefix, choose your separator, and ensure your branch names align with best practices effortlessly.",
            "score": 1.6318237785610588,
            "stars": 1,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/SHSharkar/GitBranchGen-Effortless-Git-Branch-Name-Generator",
            "updatedAt": "2024-08-08T12:19:30Z"
        }
    ],
    "followers": 8,
    "following": 2,
    "public_repos": 33,
    "pull_requests_merged": 16,
    "issues_closed": 19,
    "achievements": {
        "total_contributions": 1184,
        "repositories_contributed_to": 3
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/szd_sh"
        },
        {
            "provider": "facebook",
            "url": "https://www.facebook.com/SHSDevWiz"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/shsharkar"
        }
    ],
    "activity_summary": {
        "aiFdn/SN-JetBrains-Mono": {
            "link": "https://github.com/aiFdn/SN-JetBrains-Mono",
            "summary": "Recent activities include multiple updates to ext.json and main.css files, indicating ongoing development and refinement of the repository's content, with the most recent push events occurring on December 16, 2024."
        },
        "SHSharkar/Strong-Password-Generator": {
            "link": "https://github.com/SHSharkar/Strong-Password-Generator",
            "summary": "Significant activities involve comprehensive updates to the password generator's UI, functionality, and performance metrics, along with enhancements to responsive design, Tailwind CSS, and password strength display logic, showcasing active development and improvement of the password generator's capabilities, with updates as recent as December 15, 2024."
        },
        "SHSharkar/Shades-of-Purple-Warp-Terminal": {
            "link": "https://github.com/SHSharkar/Shades-of-Purple-Warp-Terminal",
            "summary": "Recent push events include the creation of a README.md file and a new shades_of_purple_super_dark.yaml file, along with an update to the README.md, indicating initial setup and configuration activities within the repository, with the most recent changes made on December 18, 2024."
        },
        "SHSharkar/Stremio-Real-Debrid-Addon": {
            "link": "https://github.com/SHSharkar/Stremio-Real-Debrid-Addon",
            "summary": "Notable activities involve the creation of new assets such as real-debrid-logo.png and updates to server.js, configure.html, and package.json, suggesting ongoing development and refinement of the addon's functionality, with significant updates occurring on December 15, 2024, and earlier contributions including the addition of Docker-related files for containerized application setup."
        },
        "SHSharkar/GPT-Instructions": {
            "link": "https://github.com/SHSharkar/GPT-Instructions",
            "summary": "Recent activities are limited to updates of documentations on November 26, 2024, and November 7, 2024, indicating periodic refinement and expansion of the repository's instructional content."
        }
    },
    "profile_summary": "Md. Sazzad Hossain Sharkar is a highly skilled software engineer and web developer with a strong background in HTML, JavaScript, and TSQL. As a dedicated professional with a passion for innovation and coding, he has established himself as a proficient expert in his field. With a notable presence on GitHub, he has garnered a network of followers and actively contributes to the development community through his public repositories. His expertise in web development and AI prompt engineering has enabled him to deliver high-quality solutions that meet the evolving needs of the tech industry.\n\nAs a seasoned developer with a keen interest in tech life, web development, AI prompt engineering, and innovation, Md. Sazzad Hossain Sharkar brings a unique value proposition to the table. With a proven track record of delivering cutting-edge solutions, he is well-versed in leveraging his technical skills to drive innovation and growth. His commitment to staying up-to-date with the latest industry trends and technologies has earned him a reputation as a reliable and forward-thinking professional. With his strong technical foundation and passion for coding, Md. Sazzad Hossain Sharkar is poised to continue making significant contributions to the development community, driving innovation and excellence in the field of software engineering and web development."
}