{
    "username": "sivaramanahv",
    "name": "Siva Ramana H V (Work)",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/177501691?u=6fe2e4708b5a8f05be716f8a279789be401f5e3b&v=4",
    "profile_url": "https://github.com/SivaRamanaHV",
    "top_languages": [],
    "top_projects": [
        {
            "name": "ToDoApp",
            "description": null,
            "score": 0.30533388460794725,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/SivaRamanaHV/ToDoApp",
            "updatedAt": "2024-08-12T16:50:16Z"
        },
        {
            "name": "SivaRamanaHV",
            "description": "Config files for my GitHub profile.",
            "score": 0.30310623938664655,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/SivaRamanaHV/SivaRamanaHV",
            "updatedAt": "2024-08-07T11:36:01Z"
        }
    ],
    "followers": 0,
    "following": 1,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 4,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Siva Ramana H V is a skilled and innovative developer with a strong foundation in programming and software development. With a growing presence on GitHub, he has established himself as a credible and talented professional in the tech community. His public repositories demonstrate his ability to design, develop, and deploy high-quality software solutions, showcasing his technical expertise and attention to detail. As a dedicated and passionate developer, Siva Ramana H V is committed to staying up-to-date with the latest technologies and trends, ensuring his skills remain relevant and in-demand.\n\nWith a focus on delivering exceptional results and driving innovation, Siva Ramana H V brings a unique value proposition to the table. His technical expertise, combined with his passion for problem-solving and collaboration, makes him an asset to any development team. As he continues to build his professional network and expand his influence, Siva Ramana H V is poised to make a meaningful impact in the tech industry. With his strong work ethic and commitment to excellence, he is an ideal partner for businesses and organizations seeking reliable, high-performing, and innovative software solutions, and is well-positioned to drive success in his future endeavors."
}