{
    "username": "siva-raman",
    "name": "Sivaram",
    "bio": "Graduate",
    "location": "India ",
    "avatar_url": "https://avatars.githubusercontent.com/u/33574954?v=4",
    "profile_url": "https://github.com/Siva-raman",
    "top_languages": [],
    "top_projects": [
        {
            "name": "My-Base",
            "description": null,
            "score": 0.06358058656857288,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Siva-raman/My-Base",
            "updatedAt": "2017-11-11T14:50:57Z"
        },
        {
            "name": "Ruby",
            "description": null,
            "score": 0.06358058656857288,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Siva-raman/Ruby",
            "updatedAt": "2017-11-11T15:19:16Z"
        },
        {
            "name": "Ruby_learn",
            "description": null,
            "score": 0.06358058656857288,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Siva-raman/Ruby_learn",
            "updatedAt": "2017-11-11T16:32:48Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 3,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Sivaram is a highly motivated and detail-oriented graduate with a strong foundation in software development, actively contributing to the open-source community through his public repositories. With a growing presence on GitHub, he is poised to expand his professional network and increase his influence in the developer community. As a skilled programmer, Sivaram brings a unique combination of technical expertise and innovative thinking to the table, making him an asset to any project or team. His strong work ethic and dedication to delivering high-quality solutions have earned him a reputation as a reliable and results-driven developer.\n\nAs a talented and ambitious developer, Sivaram is committed to staying at the forefront of the latest technologies and trends, continuously updating his skills to meet the evolving needs of the industry. With a solid understanding of software development principles and a passion for coding, he is well-equipped to tackle complex projects and collaborate with other developers to achieve exceptional results. By leveraging his technical expertise and creative problem-solving skills, Sivaram is able to drive innovation and deliver cutting-edge solutions that exceed expectations, making him a valuable addition to any development team or organization."
}