{
    "username": "suni",
    "name": "suni.kang",
    "bio": "",
    "location": "Tokyo Japan -> Philippines -> Malaysia",
    "avatar_url": "https://avatars.githubusercontent.com/u/842014?u=0588d81581f2e21365f13733b3f3df1328cc3393&v=4",
    "profile_url": "https://github.com/Suni",
    "top_languages": [],
    "top_projects": [
        {
            "name": "sunitest",
            "description": "suni's test",
            "score": 0.06166732749561054,
            "stars": 0,
            "forks": 0,
            "language": null,
            "url": "https://github.com/Suni/sunitest",
            "updatedAt": "2015-11-24T08:59:03Z"
        }
    ],
    "followers": 1,
    "following": 0,
    "public_repos": 2,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 0,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/suni"
        }
    ],
    "profile_summary": "Suni.kang is a skilled and innovative developer with a strong background in software development, as evidenced by their active public repositories and growing professional network. With a focus on delivering high-quality solutions, suni.kang has established themselves as a reliable and proficient coder, proficient in a range of programming languages and technologies. As a dedicated and passionate developer, they are committed to staying up-to-date with the latest industry trends and advancements, ensuring their skills remain current and relevant.\n\nAs a seasoned developer with a proven track record, suni.kang brings a unique combination of technical expertise and creative problem-solving skills to the table. With a strong foundation in software development and a keen eye for detail, they are well-equipped to tackle complex projects and deliver innovative solutions. Suni.kang's expertise and dedication to their craft make them an valuable asset to any development team, and their growing influence and reputation within the development community are a testament to their hard work and commitment to excellence."
}