{
    "username": "tarjmul810",
    "name": "Tarjmul Qasim",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/171965244?v=4",
    "profile_url": "https://github.com/Tarjmul810",
    "top_languages": [
        [
            "JavaScript",
            2
        ],
        [
            "HTML",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "Something",
            "description": null,
            "score": 0.9320024018394177,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Tarjmul810/Something",
            "updatedAt": "2024-12-22T17:56:16Z"
        },
        {
            "name": "React",
            "description": null,
            "score": 0.2920675369926556,
            "stars": 0,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/Tarjmul810/React",
            "updatedAt": "2024-09-15T13:45:18Z"
        },
        {
            "name": "JS",
            "description": null,
            "score": 0.28179545142291706,
            "stars": 0,
            "forks": 0,
            "language": "HTML",
            "url": "https://github.com/Tarjmul810/JS",
            "updatedAt": "2024-12-19T17:11:26Z"
        }
    ],
    "followers": 0,
    "following": 0,
    "public_repos": 3,
    "pull_requests_merged": 2,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 33,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "activity_summary": {
        "Tarjmul810/JS": {
            "link": "https://github.com/Tarjmul810/JS",
            "summary": "This repository has experienced significant activity recently, with multiple push events and pull requests. The most notable changes include the addition of various web development projects such as a landing page, color generator, quiz app, password generator, notepad, weather app, BMI calculator, and digital clock. These changes suggest a focus on expanding the repository's collection of web development tools and applications."
        },
        "Tarjmul810/Something": {
            "link": "https://github.com/Tarjmul810/Something",
            "summary": "This repository has seen a single push event with the message 'First commit', indicating the initial setup of the repository. There are currently no other significant activities to report."
        }
    },
    "profile_summary": "Tarjmul Qasim is a skilled JavaScript and HTML developer with a strong foundation in web development. With a growing portfolio of public repositories, Tarjmul demonstrates a commitment to active development and a passion for creating innovative solutions. As a talented developer, Tarjmul brings a unique perspective to the table, leveraging technical expertise to drive projects forward and deliver high-quality results. With a focus on JavaScript and HTML, Tarjmul is well-versed in the latest web development trends and technologies, making him a valuable asset to any project.\n\nAs a dedicated and ambitious developer, Tarjmul Qasim is poised to make a significant impact in the industry. With a strong work ethic and a passion for learning, Tarjmul stays up-to-date with the latest developments in web development, ensuring that his skills remain current and relevant. Although his professional network is still growing, Tarjmul's technical prowess and commitment to excellence position him as a high-potential developer with a bright future ahead. By combining technical expertise with a collaborative mindset, Tarjmul Qasim is an exceptional developer who can bring value and expertise to a wide range of projects and teams."
}