{
    "username": "tulir",
    "name": "Tulir Asokan",
    "bio": "Go/Python/JS developer, Ubuntu/GNOME user, Sysadmin, Star Trek, Stargate & Doctor Who fan",
    "location": "Finland",
    "avatar_url": "https://avatars.githubusercontent.com/u/4224639?v=4",
    "profile_url": "https://github.com/tulir",
    "top_languages": [
        [
            "Go",
            14
        ],
        [
            "TypeScript",
            1
        ],
        [
            "Java",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "whatsmeow",
            "description": "Go library for the WhatsApp web multidevice API",
            "score": 24.871796568664394,
            "stars": 2347,
            "forks": 441,
            "language": "Go",
            "url": "https://github.com/tulir/whatsmeow",
            "updatedAt": "2024-12-24T04:56:03Z"
        },
        {
            "name": "gomuks",
            "description": "A Matrix client written in Go.",
            "score": 21.924618540630405,
            "stars": 1392,
            "forks": 125,
            "language": "TypeScript",
            "url": "https://github.com/tulir/gomuks",
            "updatedAt": "2024-12-23T20:46:25Z"
        },
        {
            "name": "mauview",
            "description": "A Go TUI library based on tcell.",
            "score": 11.094935629963885,
            "stars": 48,
            "forks": 7,
            "language": "Go",
            "url": "https://github.com/tulir/mauview",
            "updatedAt": "2024-12-09T12:56:58Z"
        },
        {
            "name": "mauliasproxy",
            "description": "A simple Matrix room alias proxy",
            "score": 8.219591391479783,
            "stars": 23,
            "forks": 2,
            "language": "Go",
            "url": "https://github.com/tulir/mauliasproxy",
            "updatedAt": "2024-10-09T23:58:12Z"
        },
        {
            "name": "maulu",
            "description": "A fairly simple URL shortening backend written in Go",
            "score": 6.439690317922309,
            "stars": 9,
            "forks": 2,
            "language": "Go",
            "url": "https://github.com/tulir/maulu",
            "updatedAt": "2024-11-25T00:49:25Z"
        },
        {
            "name": "lwnfeed",
            "description": "A full-text RSS feed generator for LWN.net",
            "score": 6.211937219860452,
            "stars": 11,
            "forks": 1,
            "language": "Go",
            "url": "https://github.com/tulir/lwnfeed",
            "updatedAt": "2024-05-27T08:13:37Z"
        },
        {
            "name": "maumirror",
            "description": "A GitHub repo mirroring system using webhooks",
            "score": 5.396249608050727,
            "stars": 7,
            "forks": 1,
            "language": "Go",
            "url": "https://github.com/tulir/maumirror",
            "updatedAt": "2024-04-16T04:20:07Z"
        },
        {
            "name": "zeroconfig",
            "description": "A relatively simple declarative config format for zerolog",
            "score": 4.853540186088164,
            "stars": 5,
            "forks": 1,
            "language": "Go",
            "url": "https://github.com/tulir/zeroconfig",
            "updatedAt": "2024-11-27T12:06:38Z"
        }
    ],
    "followers": 835,
    "following": 4,
    "public_repos": 125,
    "pull_requests_merged": 50,
    "issues_closed": 24,
    "achievements": {
        "total_contributions": 4408,
        "repositories_contributed_to": 56
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/tulir293"
        }
    ],
    "activity_summary": {
        "tulir/gomuks": {
            "link": "https://github.com/tulir/gomuks",
            "summary": "The repository has seen significant activity with multiple push events and a pull request. Recent updates include fixes to detecting database lock errors, sticker button size, and URL preview rendering. Additionally, improvements have been made to the timeline, room list, and preferences, including the addition of options to change the window title and favicon. These updates demonstrate ongoing efforts to enhance the user experience and resolve existing issues."
        },
        "mautrix/go": {
            "link": "https://github.com/mautrix/go",
            "summary": "Recent activities in the repository include push events and pull requests focused on enhancing the client functionality. Updates such as adding site_name to link previews, supporting the setting of status messages in SetPresence, and improvements to Olm unwedging for devices that restart often have been implemented. These changes aim to improve the overall performance and user interaction with the client."
        },
        "mautrix/slack": {
            "link": "https://github.com/mautrix/slack",
            "summary": "Activities in the repository include push events that focus on message conversion from Slack. Specifically, updates have been made to set the URL preview image MIME type and to bridge URL preview thumbnails when no image is present. These updates are geared towards improving the compatibility and functionality of message conversions between platforms."
        },
        "mautrix/whatsapp": {
            "link": "https://github.com/mautrix/whatsapp",
            "summary": "A recent push event in the repository addressed ensuring media info is not nil when converting from Matrix. This update is part of the ongoing efforts to improve the messaging experience and compatibility between WhatsApp and Matrix platforms."
        },
        "beeper/slackgo": {
            "link": "https://github.com/beeper/slackgo",
            "summary": "The repository has seen a push event that added thumb width and height to attachments. This update enhances the attachment handling in Slackgo, contributing to a more detailed and user-friendly interaction with attachments in the application."
        }
    },
    "profile_summary": "Tulir Asokan is a highly skilled and accomplished developer with a strong background in programming languages such as Go, TypeScript, and Java. With a large and active professional network of over 835 followers, Tulir has established himself as a trusted and influential figure in the development community. His extensive experience and expertise in software development are evident in his impressive portfolio of 125 public repositories, showcasing his ability to design, develop, and deploy high-quality solutions. As a versatile developer, Tulir is proficient in a range of technologies and is well-versed in system administration, utilizing his skills to drive innovation and efficiency.\n\nAs a seasoned developer with a passion for technology, Tulir brings a unique combination of technical expertise and creative problem-solving skills to the table. With a keen interest in open-source technologies, including Ubuntu and GNOME, Tulir is committed to staying at the forefront of industry trends and advancements. His dedication to delivering exceptional results and his passion for collaboration have earned him a reputation as a reliable and innovative professional. With a strong foundation in computer science and software engineering, Tulir is poised to drive success in a wide range of projects, from system administration to application development, and is an invaluable asset to any development team."
}