{
    "username": "vincidadesigns",
    "name": "Vincida Designs",
    "bio": "",
    "location": null,
    "avatar_url": "https://avatars.githubusercontent.com/u/89603559?v=4",
    "profile_url": "https://github.com/vincidadesigns",
    "top_languages": [
        [
            "SCSS",
            1
        ],
        [
            "CSS",
            1
        ]
    ],
    "top_projects": [
        {
            "name": "vincidadesigns.github.io",
            "description": null,
            "score": 1.456675816430397,
            "stars": 1,
            "forks": 0,
            "language": "SCSS",
            "url": "https://github.com/vincidadesigns/vincidadesigns.github.io",
            "updatedAt": "2021-11-21T19:51:26Z"
        },
        {
            "name": "vincidadesigns",
            "description": "Config files for my GitHub profile.",
            "score": 1.456667680123399,
            "stars": 1,
            "forks": 0,
            "language": null,
            "url": "https://github.com/vincidadesigns/vincidadesigns",
            "updatedAt": "2021-11-01T09:40:33Z"
        },
        {
            "name": "Be_creative",
            "description": "Let's build a beautiful website.",
            "score": 1.1104094367571522,
            "stars": 0,
            "forks": 1,
            "language": "CSS",
            "url": "https://github.com/vincidadesigns/Be_creative",
            "updatedAt": "2021-10-04T17:47:10Z"
        }
    ],
    "followers": 0,
    "following": 2,
    "public_repos": 7,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 1,
        "repositories_contributed_to": 0
    },
    "social_accounts": [],
    "profile_summary": "Vincida Designs is a skilled developer with a strong foundation in CSS and SCSS, bringing a high level of technical expertise to the table. With a growing portfolio of public repositories, this innovative professional demonstrates a commitment to active development and continuous learning. As a dedicated and results-driven individual, Vincida Designs is well-equipped to tackle complex projects and deliver high-quality solutions that meet the needs of clients and users alike. With a keen eye for detail and a passion for innovative design, Vincida Designs is a valuable asset to any development team.\n\nAs a professional with a strong focus on CSS and SCSS, Vincida Designs is able to leverage industry-relevant skills to drive projects forward and deliver successful outcomes. With a strong foundation in front-end development, this talented individual is able to craft responsive, user-friendly interfaces that enhance the overall user experience. With a growing presence in the development community, Vincida Designs is poised to make a lasting impact and establish a reputation as a reliable and skilled developer. By combining technical expertise with a passion for innovation and design, Vincida Designs is an excellent choice for anyone seeking a high-performing and innovative development partner."
}