{
    "username": "vishnurnair93",
    "name": "Vishnu R",
    "bio": "CTO @ BuyMeaCoffee",
    "location": "Calicut, Kerala",
    "avatar_url": "https://avatars.githubusercontent.com/u/11658934?u=eca298516857102317a840bbe5048bf059acd1e9&v=4",
    "profile_url": "https://github.com/vishnurnair93",
    "top_languages": [
        [
            "PHP",
            2
        ]
    ],
    "top_projects": [
        {
            "name": "aws-security-group",
            "description": "Api access to security group for ec2",
            "score": 0.0671976742701407,
            "stars": 0,
            "forks": 0,
            "language": "PHP",
            "url": "https://github.com/vishnurnair93/aws-security-group",
            "updatedAt": "2021-03-22T07:52:42Z"
        },
        {
            "name": "apicaller",
            "description": null,
            "score": 0.06580333282437334,
            "stars": 0,
            "forks": 0,
            "language": "PHP",
            "url": "https://github.com/vishnurnair93/apicaller",
            "updatedAt": "2019-07-16T05:56:31Z"
        }
    ],
    "followers": 8,
    "following": 1,
    "public_repos": 25,
    "pull_requests_merged": 0,
    "issues_closed": 0,
    "achievements": {
        "total_contributions": 1860,
        "repositories_contributed_to": 0
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/vishnurnair93"
        }
    ],
    "profile_summary": "Vishnu R is a highly skilled and accomplished developer with a strong foundation in PHP, delivering high-quality solutions that drive business growth and innovation. As the CTO at BuyMeaCoffee, he leverages his technical expertise to drive strategic initiatives and foster a culture of excellence. With a notable presence on GitHub, boasting 8 followers and an impressive portfolio of 25 public repositories, Vishnu R has established himself as a trusted and reliable expert in his field. His dedication to staying at the forefront of industry trends and advancements has earned him recognition as a insightful and forward-thinking professional.\n\nWith a proven track record of producing exceptional results, Vishnu R is a driving force in the development community, consistently pushing the boundaries of what is possible with PHP. His unique blend of technical prowess, business acumen, and collaborative spirit makes him an invaluable asset to any organization. As a seasoned CTO, Vishnu R brings a distinctive perspective to the table, combining technical expertise with a deep understanding of the needs and challenges of modern businesses. His commitment to delivering innovative, scalable, and efficient solutions has solidified his position as a leading developer and a sought-after expert in his field, with a reputation for excellence and a passion for driving success."
}