{
    "username": "vishakh-abhayan",
    "name": "Vishakh Abhayan",
    "bio": "✨ making simple tools that work",
    "location": "Earth ",
    "avatar_url": "https://avatars.githubusercontent.com/u/94307781?u=a88ffdea9afdd4ef9997ae6d304c7b12fea0b34d&v=4",
    "profile_url": "https://github.com/vishakh-abhayan",
    "top_languages": [
        [
            "TypeScript",
            10
        ],
        [
            "JavaScript",
            23
        ],
        [
            "Python",
            10
        ]
    ],
    "top_projects": [
        {
            "name": "Pentagon",
            "description": "This platform aims to provide a space for communities to collaborate, learn, and share educational resources. The platform leverages Web3 technologies and MetaMask for authentication, and it utilizes NFTs to reward users upon achieving course milestones.",
            "score": 7.050128578535133,
            "stars": 8,
            "forks": 4,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Pentagon",
            "updatedAt": "2024-08-02T07:48:15Z"
        },
        {
            "name": "Todo",
            "description": "Todois a simple todo list application built with React and React Router. It allows users to create, manage, and track their tasks.",
            "score": 5.902614216420836,
            "stars": 16,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Todo",
            "updatedAt": "2024-11-27T13:16:10Z"
        },
        {
            "name": "Mcomin",
            "description": "A Drop Shipping platform ",
            "score": 5.583489753217948,
            "stars": 8,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/Mcomin",
            "updatedAt": "2023-11-24T23:36:53Z"
        },
        {
            "name": "Web_bootcamp",
            "description": " In this study program, we will cover various topics in web and mobile app development, including building a website, creating a digital business card, designing a space exploration site, developing a passenger counter app, and building a game, among others.",
            "score": 5.169468292568213,
            "stars": 6,
            "forks": 1,
            "language": "HTML",
            "url": "https://github.com/vishakh-abhayan/Web_bootcamp",
            "updatedAt": "2024-08-02T07:48:12Z"
        },
        {
            "name": "Clip_Book",
            "description": null,
            "score": 5.086874802590447,
            "stars": 6,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Clip_Book",
            "updatedAt": "2023-09-06T10:09:44Z"
        },
        {
            "name": "encrystorage",
            "description": "A lightweight and secure solution for encrypting and decrypting sensitive data in the local storage of web browsers.",
            "score": 5.035277152884483,
            "stars": 10,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/encrystorage",
            "updatedAt": "2024-08-02T07:48:08Z"
        },
        {
            "name": "Beyond_Us_Hackthon",
            "description": null,
            "score": 5.0109731250434795,
            "stars": 3,
            "forks": 3,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/Beyond_Us_Hackthon",
            "updatedAt": "2023-10-08T11:44:19Z"
        },
        {
            "name": "ReactFlix",
            "description": "A React movie website powered by TMDB database and built with CSS Flex and Grid and React Hooks. Discover and explore your favorite movies with ease!",
            "score": 4.835313735300569,
            "stars": 9,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/ReactFlix",
            "updatedAt": "2024-10-31T10:22:06Z"
        }
    ],
    "followers": 687,
    "following": 718,
    "public_repos": 138,
    "pull_requests_merged": 67,
    "issues_closed": 4,
    "achievements": {
        "total_contributions": 1162,
        "repositories_contributed_to": 25
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/AbhayanVishakh"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/vishakh-abhayan/"
        },
        {
            "provider": "generic",
            "url": "https://www.producthunt.com/@abhayanvishakh"
        }
    ],
    "activity_summary": {
        "gtech-mulearn/mulearn": {
            "link": "https://github.com/gtech-mulearn/mulearn",
            "summary": "Recent activities include fixes to the layout, such as the Navbar and Footer, and improvements to the mobile UI. Additionally, there have been updates to the embedding section and dynamic title, as well as the resolution of broken LinkedIn links for Execom Team members. Various pull requests have been merged, focusing on features and bug fixes, showcasing a high level of collaboration and maintenance efforts."
        },
        "vishakh-abhayan/omr_frontend": {
            "link": "https://github.com/vishakh-abhayan/omr_frontend",
            "summary": "This repository has seen recent updates, including the addition of mail IDs and addresses, implementation of 'p and t', and the inclusion of feathers sections and FAQs. There have also been changes to routes and the incorporation of G sheet and waitlist box components, indicating ongoing development and refinement of the project's features and functionalities."
        },
        "vishakh-abhayan/omr_demo": {
            "link": "https://github.com/vishakh-abhayan/omr_demo",
            "summary": "Activities in this repository include fixes for build bugs, the implementation of session management, and updates to the favicon and meta data, suggesting efforts to stabilize and enhance the demo's performance and user experience."
        },
        "vishakh-abhayan/Learn_GO": {
            "link": "https://github.com/vishakh-abhayan/Learn_GO",
            "summary": "Recent activities involve updates to the README.md file and the addition of new files via upload, indicating ongoing documentation and content expansion for learning and development purposes."
        },
        "vishakh-abhayan/mulearn": {
            "link": "https://github.com/vishakh-abhayan/mulearn",
            "summary": "This repository has seen significant updates, including the implementation of a user interest selection page, improvements to the onboarding flow, and various UI updates and fixes. The integration of Discord for onboarding and interest selection, along with the removal of unused codes, highlights a focus on enhancing user experience and streamlining the application."
        }
    },
    "profile_summary": "Vishakh Abhayan is a highly skilled and accomplished developer with a strong proficiency in programming languages such as TypeScript, JavaScript, and Python. With a large network of 687 followers, he has established himself as a reputable and influential figure in the development community. His extensive portfolio of 138 public repositories is a testament to his active involvement in software development and his commitment to creating innovative solutions. Vishakh's technical expertise and passion for building simple yet effective tools have earned him a unique position in the industry.\n\nAs a seasoned developer, Vishakh Abhayan brings a wealth of knowledge and experience to the table, making him a valuable asset to any project. His ability to craft simple tools that work is a reflection of his dedication to delivering high-quality solutions that meet the needs of users. With his expertise in TypeScript, JavaScript, and Python, Vishakh is well-equipped to tackle complex development challenges and create innovative software applications. His strong online presence and reputation for reliability make him an attractive collaborator for companies and individuals seeking to bring their software visions to life, and his commitment to making simple tools that work sets him apart as a leader in his field."
}