{
    "username": "vishakh-abhayan",
    "name": "Vishakh Abhayan",
    "bio": "✨ making simple tools that work",
    "location": "Earth ",
    "avatar_url": "https://avatars.githubusercontent.com/u/94307781?u=a88ffdea9afdd4ef9997ae6d304c7b12fea0b34d&v=4",
    "profile_url": "https://github.com/vishakh-abhayan",
    "top_languages": [
        [
            "TypeScript",
            10
        ],
        [
            "JavaScript",
            23
        ],
        [
            "Python",
            10
        ]
    ],
    "top_projects": [
        {
            "name": "Pentagon",
            "description": "This platform aims to provide a space for communities to collaborate, learn, and share educational resources. The platform leverages Web3 technologies and MetaMask for authentication, and it utilizes NFTs to reward users upon achieving course milestones.",
            "score": 7.050839904584504,
            "stars": 8,
            "forks": 4,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Pentagon",
            "updatedAt": "2024-08-02T07:48:15Z"
        },
        {
            "name": "Todo",
            "description": "Todois a simple todo list application built with React and React Router. It allows users to create, manage, and track their tasks.",
            "score": 5.90313826321971,
            "stars": 16,
            "forks": 0,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Todo",
            "updatedAt": "2024-11-27T13:16:10Z"
        },
        {
            "name": "Mcomin",
            "description": "A Drop Shipping platform ",
            "score": 5.583711387845365,
            "stars": 8,
            "forks": 1,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/Mcomin",
            "updatedAt": "2023-11-24T23:36:53Z"
        },
        {
            "name": "Web_bootcamp",
            "description": " In this study program, we will cover various topics in web and mobile app development, including building a website, creating a digital business card, designing a space exploration site, developing a passenger counter app, and building a game, among others.",
            "score": 5.1700256209289766,
            "stars": 6,
            "forks": 1,
            "language": "HTML",
            "url": "https://github.com/vishakh-abhayan/Web_bootcamp",
            "updatedAt": "2024-08-02T07:48:12Z"
        },
        {
            "name": "Clip_Book",
            "description": null,
            "score": 5.087186265183999,
            "stars": 6,
            "forks": 1,
            "language": "TypeScript",
            "url": "https://github.com/vishakh-abhayan/Clip_Book",
            "updatedAt": "2023-09-06T10:09:44Z"
        },
        {
            "name": "encrystorage",
            "description": "A lightweight and secure solution for encrypting and decrypting sensitive data in the local storage of web browsers.",
            "score": 5.0358657227566,
            "stars": 10,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/encrystorage",
            "updatedAt": "2024-08-02T07:48:08Z"
        },
        {
            "name": "Beyond_Us_Hackthon",
            "description": null,
            "score": 5.011398857758667,
            "stars": 3,
            "forks": 3,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/Beyond_Us_Hackthon",
            "updatedAt": "2023-10-08T11:44:19Z"
        },
        {
            "name": "ReactFlix",
            "description": "A React movie website powered by TMDB database and built with CSS Flex and Grid and React Hooks. Discover and explore your favorite movies with ease!",
            "score": 4.835734248080622,
            "stars": 9,
            "forks": 0,
            "language": "JavaScript",
            "url": "https://github.com/vishakh-abhayan/ReactFlix",
            "updatedAt": "2024-10-31T10:22:06Z"
        }
    ],
    "followers": 685,
    "following": 718,
    "public_repos": 138,
    "pull_requests_merged": 170,
    "issues_closed": 9,
    "achievements": {
        "total_contributions": 1165,
        "repositories_contributed_to": 25
    },
    "social_accounts": [
        {
            "provider": "twitter",
            "url": "https://twitter.com/AbhayanVishakh"
        },
        {
            "provider": "linkedin",
            "url": "https://www.linkedin.com/in/vishakh-abhayan/"
        },
        {
            "provider": "generic",
            "url": "https://www.producthunt.com/@abhayanvishakh"
        }
    ],
    "activity_summary": {
        "gtech-mulearn/mulearn": {
            "link": "https://github.com/gtech-mulearn/mulearn",
            "summary": "Recently, there have been multiple commits on mulearn repository to fix various layout issues, including fixing the mobile UI and navbar and footer. There were also updates to add an embedding section and make the title dynamic, in addition to fixing broken LinkedIn links of Execom Team. New features like adding Ui layout and ig base layout have also been added."
        },
        "vishakh-abhayan/omr_demo": {
            "link": "https://github.com/vishakh-abhayan/omr_demo",
            "summary": "The omr_demo repository primarily saw bug fixes and new feature implementations, including fixing build bugs and adding session management. Other notable updates include updating the favicon and meta data, implementing Vercel analytics, and integrating a socket with the backend. Additionally, efforts were made to fix build pipelines and ESLint issues."
        },
        "vishakh-abhayan/omr_frontend": {
            "link": "https://github.com/vishakh-abhayan/omr_frontend",
            "summary": "On the omr_frontend repository, there were various new features added, including mail id and address, payment and totals, feathers section, and FAQs. Additionally, changes to routing have been made and demo URL updates have been implemented in actions. The changes reflect an ongoing effort to enhance the frontend capabilities and user interface."
        },
        "vishakh-abhayan/mulearn": {
            "link": "https://github.com/vishakh-abhayan/mulearn",
            "summary": "The mulearn repository by vishakh-abhayan has seen a significant update with a user interest selection page, including tags input and page switching. There has been an emphasis on Discord onboarding and interest selection. Furthermore, UI updates and refactorization of unused codes have been performed, showcasing efforts to enhance onboarding flows and overall user experience."
        }
    },
    "profile_summary": "Vishakh Abhayan is a highly skilled and influential software developer with expertise in TypeScript, JavaScript, and Python, boasting a strong reputation in the tech community. With 685 followers and an impressive portfolio of 138 public repositories, Vishakh has established himself as a dependable and innovative problem-solver, continually pushing the boundaries of what is possible with code. By focusing on creating simple yet effective tools, he has developed a unique value proposition that sets him apart from his peers.\n\nAs a versatile and accomplished developer, Vishakh excels at leveraging his technical expertise to drive solutions forward. With a talent for crafting clean, efficient, and well-organized codebases, he has proven himself to be a valuable asset to any project or team. By consistently delivering high-quality results and staying up-to-date with the latest industry trends and technologies, Vishakh has solidified his position as a go-to expert in his field, earning the respect and admiration of his peers and inspiring others with his passion for innovation and simplicity."
}